Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: There are two types of admins in MISP: Admins (also referred to as org admins) and Site Admins. Whilst the former can only do some limited administration of users of his/her own organisation, site admins have access to all of the features and data of the system. They are in charge of making sure that the system runs correctly and the maintenance of MISP.
si_lk: MISP හි පරිපාලකයින් වර්ග දෙකක් ඇත: පරිපාලකයින් (org admins ලෙසද හැඳින්වේ) සහ Site Admins. පළමු තැනැත්තාට කළ හැක්කේ ඔහුගේ/ඇයගේම සංවිධානයේ පරිශීලකයින් සීමිත පරිපාලනයක් පමණක් වන අතර, අඩවි පරිපාලකයින්ට පද්ධතියේ සියලුම විශේෂාංග සහ දත්ත වෙත ප්‍රවේශය ඇත. පද්ධතිය නිවැරදිව ක්‍රියාත්මක වන බවට වග බලා ගැනීම සහ MISP නඩත්තු කිරීම ඔවුන් භාරව සිටී.

source: Background Jobs
si_lk: පසුබිම් රැකියා

source: A lot of the heavier tasks are a burden to users, in that their actions can cause long delays (and in some cases timeouts) while the application logic is executing. To alleviate this, long processes have been (if enabled) moved to background jobs, meaning that their execution happens asynchronously in the background, allowing the user to freely interact with the platform whilst the request is being processed.
si_lk: යෙදුම් තර්කනය ක්‍රියාත්මක වන අතරතුර ඔවුන්ගේ ක්‍රියාවන් දිගු ප්‍රමාදයන් (සහ සමහර අවස්ථාවල කල් ඉකුත්වීම්) ඇති කළ හැකි බැවින්, බොහෝ බර කාර්යයන් පරිශීලකයින්ට බරක් වේ. මෙය සමනය කිරීම සඳහා, දිගු ක්‍රියාවලි (සක්‍රීය කර ඇත්නම්) පසුබිම් රැකියා වෙත ගෙන ගොස් ඇත, එනම් ඒවා ක්‍රියාත්මක කිරීම පසුබිමේ අසමමුහුර්තව සිදු වන අතර, ඉල්ලීම ක්‍රියාවට නංවන අතරතුර පරිශීලකයාට වේදිකාව සමඟ නිදහසේ අන්තර් ක්‍රියා කිරීමට ඉඩ සලසයි.

source: MISP Instance
si_lk: MISP උදාහරණය

source: A MISP instance is an installation of the MISP software and the connected database. All the data visible to the users is stored locally in the database and data that is shareable (based on the distribution settings) can be synchronised with other instances via the Sync actions. The instance that you are reading this manual on will be refered to as "this instance" or "your instance". The instances that your instance synchronises with will be refered to as "remote instances".
si_lk: MISP අවස්ථාවක් යනු MISP මෘදුකාංගය සහ සම්බන්ධිත දත්ත ගබඩාව ස්ථාපනය කිරීමයි. පරිශීලකයින්ට පෙනෙන සියලුම දත්ත දත්ත සමුදායේ ස්ථානීයව ගබඩා කර ඇති අතර බෙදාගත හැකි දත්ත (බෙදාහැරීමේ සිටුවම් මත පදනම්ව) සමමුහුර්ත ක්‍රියා හරහා වෙනත් අවස්ථා සමඟ සමමුහුර්ත කළ හැක. ඔබ මෙම අත්පොත කියවන අවස්ථාව "මෙම අවස්ථාව" හෝ "ඔබේ නිදසුන" ලෙසින් සඳහන් වේ. ඔබගේ අවස්ථාව සමමුහුර්ත වන අවස්ථා "දුරස්ථ අවස්ථා" ලෙසින් හඳුන්වනු ලැබේ.

source: Organisation administrators and Site administrators
si_lk: සංවිධාන පරිපාලකයින් සහ අඩවි පරිපාලකයින්

source: We have two types of administrators, site and organisation admins. The former has access to every administrator feature for all the data located on the system including global features such as the creation and modification of user roles and instance links, whilst organisation admins can administer users, events and logs of their own respective organisations.
si_lk: අපට අඩවි සහ සංවිධාන පරිපාලකයින් ලෙස පරිපාලකයින් වර්ග දෙකක් ඇත. පරිශීලක භූමිකාවන් සහ නිදසුන් සබැඳි නිර්මාණය කිරීම සහ වෙනස් කිරීම වැනි ගෝලීය විශේෂාංග ඇතුළුව පද්ධතියේ ඇති සියලුම දත්ත සඳහා පළමු පරිපාලක විශේෂාංගය සඳහා ප්‍රවේශය ඇත, සංවිධාන පරිපාලකයින්ට ඔවුන්ගේම සංවිධානවල පරිශීලකයින්, සිදුවීම් සහ ලොග් පරිපාලනය කළ හැකිය.

source: Pivot path
si_lk: විවර්තන මාර්ගය

source: The (branching) path taken by a user from event to event while following correlation links. This is represented by the branching graph in the event view.
si_lk: සහසම්බන්ධ සබැඳි අනුගමනය කරන අතරතුර පරිශීලකයෙකු විසින් සිදුවීමෙන් සිදුවීමට ගන්නා (අතු) මාර්ගය. මෙය සිද්ධි දර්ශනයේ ශාඛා ප්‍රස්ථාරයෙන් නිරූපණය කෙරේ.

source: Pivoting
si_lk: හැරවීම

source: The act of navigating from event to event through correlation links.
si_lk: සහසම්බන්ධ සබැඳි හරහා සිදුවීමෙන් සිදුවීමට සංචාලනය කිරීමේ ක්‍රියාව.

source: Each event can only be directly edited by users of the original creator organisation (and site admins). However, if another organisation would like to amend an event with extra information on an event, or if they'd like to correct a mistake in an attribute, they can create a Proposal. These proposals could then be accepted by the original creator organisation. These proposals can be pulled to another server, allowing users on connected instances to propose changes which then could be accepted by the original creators on another instance (and subsequently pushed back).
si_lk: සෑම සිදුවීමක්ම සෘජුවම සංස්කරණය කළ හැක්කේ මුල් නිර්මාපක සංවිධානයේ (සහ අඩවි පරිපාලකයින්) පරිශීලකයින්ට පමණි. කෙසේ වෙතත්, වෙනත් සංවිධානයක් සිදුවීමක් පිළිබඳ අමතර තොරතුරු සහිත සිදුවීමක් සංශෝධනය කිරීමට කැමති නම්, හෝ ඔවුන් ගුණාංගයක වරදක් නිවැරදි කිරීමට කැමති නම්, ඔවුන්ට යෝජනාවක් නිර්මාණය කළ හැකිය. මෙම යෝජනා පසුව මුල් නිර්මාතෘ සංවිධානයට පිළිගත හැකිය. මෙම යෝජනා වෙනත් සේවාදායකයකට ඇද ගත හැකි අතර, සම්බන්ධිත අවස්ථාවන්හි පරිශීලකයින්ට වෙනස්කම් යෝජනා කිරීමට ඉඩ ලබා දෙන අතර එය මුල් නිර්මාණකරුවන් විසින් වෙනත් අවස්ථාවක පිළිගත හැකිය (සහ පසුව පසුපසට තල්ලු කරනු ලැබේ).

source: Publishing
si_lk: ප්‍රකාශනය කරනවා

source: When an event is first created by a user, it is visible to everyone on the instance based on the access rights ("Your organisation only" events will not be visible to users of other organisations), but they will not be synchronised and they won't be exportable. For this, a user with publishing permission of the organisation that created the event has to publish the event. The system will then inform all the users of the instance that are subscribing to e-mail notifications and who have access to view the published event via an e-mail.
si_lk: සිදුවීමක් ප්‍රථමයෙන් පරිශීලකයෙකු විසින් නිර්මාණය කළ විට, ප්‍රවේශ අයිතීන් මත පදනම්ව එය සෑම කෙනෙකුටම දෘශ්‍යමාන වේ ("ඔබේ සංවිධානයට පමණක්" සිදුවීම් වෙනත් සංවිධානවල පරිශීලකයින්ට නොපෙනේ), නමුත් ඒවා සමමුහුර්ත නොවනු ඇති අතර ඔවුන් ජයග්‍රහණය කරනු ඇත. අපනයනය කළ නොහැක. මේ සඳහා, සිදුවීම නිර්මාණය කළ සංවිධානයේ ප්‍රකාශන අවසරය ඇති පරිශීලකයෙකුට සිදුවීම ප්‍රකාශයට පත් කළ යුතුය. ඊමේල් දැනුම්දීම් සඳහා දායක වන සහ විද්‍යුත් තැපෑලක් හරහා ප්‍රකාශිත සිදුවීම බැලීමට ප්‍රවේශය ඇති අවස්ථාවන් පිළිබඳව පද්ධතිය සියලු පරිශීලකයින්ට දැනුම් දෙනු ඇත.

source: Pull
si_lk: අදින්න

source: Pulling is the process of using the configured sync user on a remote instance to REST GET all of the accessible data (based on the distribution rights) to your instance and store it.
si_lk: ඇද ගැනීම යනු වින්‍යාසගත සමමුහුර්ත පරිශීලකයා දුරස්ථ අවස්ථාවක භාවිතා කර විවේක ගැනීම සඳහා ප්‍රවේශ විය හැකි සියලුම දත්ත (බෙදාහැරීමේ අයිතීන් මත පදනම්ව) ඔබේ අවස්ථාවට ලබාගෙන එය ගබඩා කිරීමේ ක්‍රියාවලියයි.

source: Push
si_lk: තල්ලුව

source: Pushing is the process of using a configured instance link to send an event or all accessible events (limited by the distribution rights) through the REST interface to a remote instance.
si_lk: තල්ලු කිරීම යනු REST අතුරුමුහුණත හරහා සිදුවීමක් හෝ සියලුම ප්‍රවේශ විය හැකි සිදුවීම් (බෙදාහැරීමේ අයිතීන් මගින් සීමා කර ඇත) දුරස්ථ අවස්ථාවක් වෙත යැවීමට වින්‍යාස කළ අවස්ථා සබැඳියක් භාවිතා කිරීමේ ක්‍රියාවලියයි.

source: Certain common tasks can be scheduled for a later execution or for regular recurring executions. These tasks currently include caching all of the export formats, pulling from all eligible instances and pushing to all eligible instances.
si_lk: සමහර පොදු කාර්යයන් පසුව ක්‍රියාත්මක කිරීම සඳහා හෝ නිතිපතා පුනරාවර්තන ක්‍රියාත්මක කිරීම් සඳහා සැලසුම් කළ හැක. මෙම කර්තව්‍යයන්ට දැනට සියලුම අපනයන ආකෘති හැඹිලිගත කිරීම, සියලුම සුදුසුකම් ලත් අවස්ථාවන්ගෙන් ඉවත් කිරීම සහ සියලුම සුදුසුකම් ලත් අවස්ථාවන් වෙත තල්ලු කිරීම ඇතුළත් වේ.

source: Sync User
si_lk: පරිශීලක සමමුහුර්ත කරන්න

source: A user of a role that grants sync permissions, these users (and their authentication keys) are used to serve as the points of connection between instances. Events pushed to an instance are pushed to a sync user, who then creates the events on the remote instance. Events pulled are added by the sync user that is used to connect the remote instance to your instance. As an administrator, keep in mind that a sync user needs auth key and publish permissions, has to have undergone the mandatory password change and has to have accepted the Terms of Use in order for the sync to work. Please make sure that all of these steps are taken before attempting to push or pull.
si_lk: සමමුහුර්ත අවසර ලබා දෙන භූමිකාවක පරිශීලකයෙකු, මෙම පරිශීලකයින් (සහ ඔවුන්ගේ සත්‍යාපන යතුරු) අවස්ථා අතර සම්බන්ධක ලක්ෂ්‍ය ලෙස සේවය කිරීමට භාවිතා කරයි. නිදසුනකට තල්ලු කරන ලද සිදුවීම් සමමුහුර්ත පරිශීලකයෙකු වෙත තල්ලු කරනු ලැබේ, පසුව ඔහු දුරස්ථ අවස්ථාවෙහි සිදුවීම් නිර්මාණය කරයි. ඇද ගන්නා ලද සිදුවීම් සමමුහුර්ත පරිශීලකයා විසින් එක් කරනු ලබන අතර එය දුරස්ථ අවස්ථාව ඔබගේ අවස්ථාවට සම්බන්ධ කිරීමට භාවිතා කරයි. පරිපාලකයෙකු ලෙස, සමමුහුර්ත පරිශීලකයෙකුට auth යතුර සහ ප්‍රකාශන අවසර අවශ්‍ය බව මතක තබා ගන්න, සමමුහුර්ත කිරීම ක්‍රියා කිරීම සඳහා අනිවාර්ය මුරපද වෙනස් කිරීමකට භාජනය වී තිබිය යුතු අතර භාවිත නියමයන් පිළිගෙන තිබිය යුතුය. කරුණාකර තල්ලු කිරීමට හෝ අදින්නට උත්සාහ කිරීමට පෙර මෙම සියලු පියවර ගෙන ඇති බව සහතික කර ගන්න.

source: Synchronisation
si_lk: සමමුහුර්තකරණය

source: What we call synchronisation is an exchange of data between two (or more) MISP instances through our pull and push mechanisms.
si_lk: අපි සමමුහුර්තකරණය ලෙස හඳුන්වන්නේ අපගේ ඇදීමේ සහ තල්ලු කිරීමේ යාන්ත්‍රණයන් හරහා MISP අවස්ථා දෙකක් (හෝ ඊට වැඩි) අතර දත්ත හුවමාරුවකි.

source: Tagging
si_lk: ටැග් කිරීම

source: Users with tagging rights can assigned various dynamically created tags to events, allowing an arbitrary link between events to be created. It is possible to filter events based on these tags and they can also be used to filter events for the automation.
si_lk: ටැග් කිරීමේ අයිතිය ඇති පරිශීලකයින්ට සිදුවීම් සඳහා ගතිකව සාදන ලද විවිධ ටැග් පැවරිය හැක, සිදුවීම් අතර අත්තනෝමතික සම්බන්ධයක් නිර්මාණය කිරීමට ඉඩ සලසයි. මෙම ටැග් මත පදනම්ව සිදුවීම් පෙරීමට හැකි අතර ඒවා ස්වයංක්‍රීයකරණය සඳහා සිදුවීම් පෙරීමටද භාවිතා කළ හැකිය.

source: Templating
si_lk: සැකිලි කිරීම

source: Users with templating rights can create easy to fill forms that help with the event creation process.
si_lk: ආකෘතිකරණ හිමිකම් ඇති පරිශීලකයින්ට සිදුවීම් නිර්මාණය කිරීමේ ක්‍රියාවලියට උපකාර වන පෝරම පිරවීමට පහසු නිර්මාණය කළ හැක.

source: The top bar
si_lk: ඉහළ තීරුව

source: This is the main menu that will be accessible from all of the views. In some instances, some additional buttons that will appear on top of these when a view provides it.
si_lk: සියලුම බැලීම් වලින් ප්‍රවේශ විය හැකි ප්‍රධාන මෙනුව මෙයයි. සමහර අවස්ථාවලදී, දර්ශනයක් සපයන විට මේවාට ඉහළින් දිස්වන අමතර බොත්තම් කිහිපයක්.

source: This menu contains all of the main functions of the site as a series of dropdown menus. These contains all (from the current user's perspective) accessible functions sorted into several groups.
si_lk: මෙම මෙනුවේ පතන මෙනු මාලාවක් ලෙස වෙබ් අඩවියේ සියලුම ප්‍රධාන කාර්යයන් අඩංගු වේ. කණ්ඩායම් කිහිපයකට වර්ග කර ඇති සියලුම (වර්තමාන පරිශීලකයාගේ දෘෂ්ටිකෝණයෙන්) ප්‍රවේශ විය හැකි කාර්යයන් මේවායේ අඩංගු වේ.

source: Home button
si_lk: මුල් පිටුව බොත්තම

source: This button will return you to the start screen of the application, which is the event index page (more about this later).
si_lk: මෙම බොත්තම ඔබව යෙදුමේ ආරම්භක තිරය වෙත ගෙන එනු ඇත, එය සිදුවීම් දර්ශක පිටුවයි (මේ ගැන වැඩි විස්තර පසුව).

source: All the malware data entered into MISP is made up of an event object that is described by its connected attributes. The Event actions menu gives access to all the functionality that has to do with the creation, modification, deletion, publishing, searching and listing of events and attributes.
si_lk: MISP වෙත ඇතුළු කරන ලද සියලුම අනිෂ්ට මෘදුකාංග දත්ත එහි සම්බන්ධිත ගුණාංග මගින් විස්තර කෙරෙන සිදුවීම් වස්තුවකින් සෑදී ඇත. සිදුවීම් ක්‍රියා මෙනුව සිදුවීම් සහ ගුණාංග නිර්මාණය කිරීම, වෙනස් කිරීම, මකා දැමීම, ප්‍රකාශනය කිරීම, සෙවීම සහ ලැයිස්තුගත කිරීම සම්බන්ධ සියලු ක්‍රියාකාරීත්වයන් වෙත ප්‍රවේශය ලබා දේ.

source: Input filters alter what and how data can be entered into this instance. Apart from the basic validation of attribute entry by type, it is possible for the site administrators to define regular expression replacements and blacklists for certain values in addition to blocking certain values from being exportable. Users can view these replacement and blacklist rules here whilst administrator can alter them.
si_lk: ආදාන පෙරහන් මෙම අවස්ථාවට දත්ත ඇතුළු කළ හැක්කේ කුමක්ද සහ කෙසේද යන්න වෙනස් කරයි. වර්ගය අනුව ගුණාංග ඇතුළත් කිරීමේ මූලික වලංගුකරණයට අමතරව, ඇතැම් අගයන් අපනයනය කිරීමෙන් අවහිර කිරීමට අමතරව ඇතැම් අගයන් සඳහා නිතිපතා ප්‍රකාශන ප්‍රතිස්ථාපන සහ අසාදු ලේඛන නිර්වචනය කිරීමට අඩවි පරිපාලකයින්ට හැකිය. පරිපාලකයාට ඒවා වෙනස් කළ හැකි අතර පරිශීලකයින්ට මෙම ප්‍රතිස්ථාපන සහ අසාදු ලේඛන නීති මෙතැනින් බැලිය හැක.

source: This menu gives you access to information about MISP and this instance. You can view and edit your own profile, view the manual, read the news or the terms of use again, see a list of the active organisations on this instance and a histogram of their contributions by attribute type.
si_lk: මෙම මෙනුව ඔබට MISP සහ මෙම අවස්ථාව පිළිබඳ තොරතුරු වෙත ප්‍රවේශය ලබා දේ. ඔබට ඔබේම පැතිකඩ බැලීම සහ සංස්කරණය කිරීම, අත්පොත බැලීම, පුවත් හෝ භාවිත නියමයන් නැවත කියවීම, මෙම අවස්ථාවෙහි සක්‍රිය සංවිධාන ලැයිස්තුවක් සහ ගුණාංග වර්ගය අනුව ඔවුන්ගේ දායකත්වයන් පිළිබඳ ඉතිහාස සටහනක් බැලීමට හැකිය.

source: With administrator access rights, shows a list of the connected instances and allows the initiation of a push and a pull (more about the synchronisation mechanisms later).
si_lk: පරිපාලක ප්‍රවේශ අයිතිවාසිකම් සමඟ, සම්බන්ධිත අවස්ථා ලැයිස්තුවක් පෙන්වන අතර තල්ලුවක් සහ ඇදීමක් ආරම්භ කිරීමට ඉඩ සලසයි (සමමුහුර්ත කිරීමේ යාන්ත්‍රණයන් ගැන පසුව වැඩි විස්තර).

source: Administrators can add, edit or remove user accounts and user roles. Roles define the access rights to certain features such as publishing of events, usage of the REST interface or synchronisation of any user belonging to the given role. Site administrators can also access a contact form, through which it is possible to reset the passwords of users, or to just get in touch with them via encrypted e-mails.
si_lk: පරිපාලකයින්ට පරිශීලක ගිණුම් සහ පරිශීලක භූමිකාවන් එක් කිරීමට, සංස්කරණය කිරීමට හෝ ඉවත් කිරීමට හැකිය. භූමිකාවන් සිදුවීම් ප්‍රකාශනය කිරීම, REST අතුරුමුහුණත භාවිතය හෝ ලබා දී ඇති භූමිකාවට අයත් ඕනෑම පරිශීලකයෙකුගේ සමමුහුර්තකරණය වැනි ඇතැම් විශේෂාංග සඳහා ප්‍රවේශ හිමිකම් නිර්වචනය කරයි. අඩවි පරිපාලකයින්ට සම්බන්ධතා පෝරමයකට ප්‍රවේශ විය හැකි අතර, එමඟින් පරිශීලකයින්ගේ මුරපද නැවත සැකසීමට හෝ සංකේතාත්මක විද්‍යුත් තැපෑල හරහා ඔවුන් හා සම්බන්ධ වීමට හැකිය.

source: Audit
si_lk: විගණන

source: If you have audit permissions, you can view the logs for your organisation (or for site admins for the entire system) here or even search the logs if you are interested in something specific.
si_lk: ඔබට විගණන අවසර තිබේ නම්, ඔබට ඔබේ සංවිධානය සඳහා (හෝ සමස්ත පද්ධතිය සඳහාම අඩවි පරිපාලකයින් සඳහා) ලඝු-සටහන් මෙතැනින් නැරඹිය හැකිය, නැතහොත් ඔබ විශේෂිත දෙයක් ගැන උනන්දුවක් දක්වන්නේ නම් ලොග සෙවීමට පවා හැකිය.

source: Discussions
si_lk: සාකච්ඡා

source: Link to the discussion threads.
si_lk: සාකච්ඡා නූල් වෙත සබැඳිය.

source: Proposal Notifications
si_lk: යෝජනා දැනුම්දීම්

source: This shows how many proposals your organisation has received and across how many events they are spread out. Clicking this will take you to the list of proposals.
si_lk: ඔබේ සංවිධානයට කොපමණ යෝජනා ලැබී තිබේද සහ ඒවා කොපමණ සිදුවීම් හරහා පැතිරී තිබේද යන්න මෙයින් පෙන්වයි. මෙය ක්ලික් කිරීමෙන් ඔබව යෝජනා ලැයිස්තුවට ගෙන යනු ඇත.

source: Logs you out of the system.
si_lk: ඔබව පද්ධතියෙන් ඉවත් කරයි.

source: A list of the contents of each of the above drop-down menus
si_lk: ඉහත එක් එක් පතන මෙනු වල අන්තර්ගත ලැයිස්තුවක්

source: Event actions
si_lk: සිදුවීම් ක්රියා

source: Lists all the events in the system that are not private or belong to your organisation. You can add, modify, delete, publish or view individual events from this view.
si_lk: පද්ධතියේ පුද්ගලික නොවන හෝ ඔබේ සංවිධානයට අයත් සියලුම සිදුවීම් ලැයිස්තුගත කරයි. ඔබට මෙම දසුනෙන් තනි සිදුවීම් එක් කිරීමට, වෙනස් කිරීමට, මැකීමට, ප්‍රකාශ කිරීමට හෝ බැලීමට හැකිය.

source: Allows you to fill out an event creation form and create the event object, which you can start populating with attributes.
si_lk: ඔබට සිදුවීම් නිර්මාණය කිරීමේ පෝරමයක් පුරවා සිදුවීම් වස්තුව සෑදීමට ඔබට ඉඩ සලසයි, එය ඔබට ගුණාංග සමඟින් පිරවිය හැකිය.

source: Lists all the attributes in the system that are not private or belong to your organisation. You can modify, delete or view each individual attribute from this view.
si_lk: පුද්ගලික නොවන හෝ ඔබේ සංවිධානයට අයත් පද්ධතියේ ඇති සියලුම ගුණාංග ලැයිස්තුගත කරයි. ඔබට මෙම දර්ශනයෙන් එක් එක් ගුණාංග වෙනස් කිරීමට, මකා දැමීමට හෝ බැලීමට හැකිය.

source: You can set search terms for a filtered attribute index view here.
si_lk: ඔබට පෙරන ලද උපලක්ෂණ දර්ශක දසුනක් සඳහා සෙවුම් පද මෙහි සැකසිය හැක.

source: Shows a list of all proposals that you are eligible to see.
si_lk: ඔබට දැකීමට සුදුසුකම් ඇති සියලුම යෝජනා ලැයිස්තුවක් පෙන්වයි.

source: Shows all of the events created by your organsiation that has pending proposals.
si_lk: අපේක්ෂිත යෝජනා ඇති ඔබේ සංවිධානය විසින් නිර්මාණය කරන ලද සියලුම සිදුවීම් පෙන්වයි.

source: List all the tags that have been created by users with tag creation rights on this instance.
si_lk: මෙම අවස්ථාවෙහි ටැග් නිර්මාණය කිරීමේ අයිතිය ඇති පරිශීලකයන් විසින් නිර්මාණය කර ඇති සියලුම ටැග් ලැයිස්තුගත කරන්න.

source: Create a new tag.
si_lk: නව ටැග් එකක් සාදන්න.

source: List all of the templates created by users with template creation rights on this instance.
si_lk: මෙම අවස්ථාවෙහි අච්චු නිර්මාණය කිරීමේ අයිතිය ඇති පරිශීලකයන් විසින් නිර්මාණය කරන ලද සියලුම සැකිලි ලැයිස්තුගත කරන්න.

source: Create a new template.
si_lk: නව අච්චුවක් සාදන්න.

source: Export the data accessible to you in various formats.
si_lk: ඔබට ප්‍රවේශ විය හැකි දත්ත විවිධ ආකෘතිවලින් අපනයනය කරන්න.

source: If you have authentication key access, you can view how to use your key to use the REST interface for automation here.
si_lk: ඔබට සත්‍යාපන යතුරු ප්‍රවේශය තිබේ නම්, ස්වයංක්‍රීයකරණය සඳහා REST අතුරුමුහුණත භාවිතා කිරීමට ඔබේ යතුර භාවිතා කරන ආකාරය ඔබට මෙතැනින් බැලිය හැක.

source: Input filters
si_lk: ආදාන පෙරහන්

source: You can view the Regular Expression rules, which modify the data that can be entered into the system. This can and should be used to help filter out personal information from automatic imports (such as removing the username from windows file paths), having unified representation for certain common values for easier correlation or simply standardising certain input. It is also possible to block certain values from being inserted. As a site administrator or a user with regex permission, you can also edit these rules.
si_lk: ඔබට පද්ධතියට ඇතුළත් කළ හැකි දත්ත වෙනස් කරන නිතිපතා ප්‍රකාශන රීති නැරඹිය හැකිය. මෙය ස්වයංක්‍රීය ආයාතවලින් (වින්ඩෝස් ගොනු මාර්ගවලින් පරිශීලක නාමය ඉවත් කිරීම වැනි) පුද්ගලික තොරතුරු පෙරීමට උදවු කිරීමට සහ පහසු සහසම්බන්ධතාව සඳහා ඇතැම් පොදු අගයන් සඳහා ඒකාබද්ධ නියෝජනයක් තිබීම හෝ යම් ආදානයක් සරලව ප්‍රමිතිකරණය කිරීම සඳහා භාවිතා කළ හැක. ඇතැම් අගයන් ඇතුළත් කිරීමෙන් අවහිර කිරීමට ද හැකිය. අඩවි පරිපාලකයෙකු හෝ regex අවසරය ඇති පරිශීලකයෙකු ලෙස, ඔබට මෙම නීති සංස්කරණය කිරීමටද හැකිය.

source: You can view the allowedlist rules, which contain the values that are blocked from being used for exports and automation on this instance. Site administrators have access to editing this list.
si_lk: ඔබට මෙම අවස්ථාවෙහිදී අපනයන සහ ස්වයංක්‍රීයකරණය සඳහා භාවිතා කිරීමෙන් අවහිර කර ඇති අගයන් අඩංගු අවසර ලැයිස්තු රීති නැරඹිය හැක. මෙම ලැයිස්තුව සංස්කරණය කිරීමට අඩවි පරිපාලකයින්ට ප්‍රවේශය ඇත.

source: Read about the latest news regarding the MISP system.
si_lk: MISP පද්ධතිය පිළිබඳ නවතම පුවත් කියවන්න.

source: Manage your user account.
si_lk: ඔබගේ පරිශීලක ගිණුම කළමනාකරණය කරන්න.

source: View some statistics about the currently stored attributes.
si_lk: දැනට ගබඩා කර ඇති ගුණාංග පිළිබඳ සමහර සංඛ්‍යාලේඛන බලන්න.

source: You can view the role permissions here.
si_lk: ඔබට මෙහි භූමිකාව අවසර නැරඹිය හැකිය.

source: A link to this user guide.
si_lk: මෙම පරිශීලක මාර්ගෝපදේශයට සබැඳියක්.

source: Terms &amp; Conditions
si_lk: නියමයන් &amp; කොන්දේසි

source: View the terms &amp; conditions again.
si_lk: කොන්දේසි &amp; කොන්දේසි නැවත බලන්න.

source: View a series of statistics about the users and the data on this instance.
si_lk: මෙම අවස්ථාවෙහි පරිශීලකයින් සහ දත්ත පිළිබඳ සංඛ්‍යාලේඛන මාලාවක් බලන්න.

source: Logs the current user out.
si_lk: වත්මන් පරිශීලකයා ඉවත් කරයි.

source: Connect your MISP instance to other instances, or view and modify the currently established connections.
si_lk: ඔබගේ MISP අවස්ථාව වෙනත් අවස්ථාවන්ට සම්බන්ධ කරන්න, නැතහොත් දැනට ස්ථාපිත සම්බන්ධතා බලන්න සහ වෙනස් කරන්න.

source: New User
si_lk: නව පරිශීලක

source: Create an account for a new user for your organisation. Site administrators can create users for any organisation.
si_lk: ඔබේ සංවිධානය සඳහා නව පරිශීලකයෙකු සඳහා ගිණුමක් සාදන්න. අඩවි පරිපාලකයින්ට ඕනෑම සංවිධානයක් සඳහා පරිශීලකයන් නිර්මාණය කළ හැකිය.

source: View, modify or delete the currently registered users.
si_lk: දැනට ලියාපදිංචි පරිශීලකයන් බලන්න, වෙනස් කරන්න හෝ මකා දමන්න.

source: New Role
si_lk: නව භූමිකාව

source: Create a new role group for the users of this instance, controlling their privileges to create, modify, delete and to publish events and to access certain features such as the logs or automation.
si_lk: මෙම අවස්ථාවෙහි භාවිතා කරන්නන් සඳහා නව භූමිකා කණ්ඩායමක් සාදන්න, සිදුවීම් සෑදීමට, වෙනස් කිරීමට, මකා දැමීමට සහ ප්‍රකාශ කිරීමට සහ ලොග හෝ ස්වයංක්‍රීයකරණය වැනි ඇතැම් විශේෂාංග වෙත ප්‍රවේශ වීමට ඔවුන්ගේ වරප්‍රසාද පාලනය කරන්න.

source: List, modify or delete currently existing roles.
si_lk: දැනට පවතින භූමිකාවන් ලැයිස්තුගත කරන්න, වෙනස් කරන්න හෝ මකන්න.

source: You can use this view to send messages to your current or future users or send them a new temporary password.
si_lk: ඔබගේ වත්මන් හෝ අනාගත පරිශීලකයින්ට පණිවිඩ යැවීමට හෝ ඔවුන්ට නව තාවකාලික මුරපදයක් යැවීමට ඔබට මෙම දර්ශනය භාවිතා කළ හැක.

source: Various tools, upgrade scripts that can help a site-admin run the instance.
si_lk: විවිධ මෙවලම්, අඩවි-පරිපාලකයෙකුට අවස්ථාව ක්‍රියාත්මක කිරීමට උදවු කළ හැකි උත්ශ්‍රේණිගත ස්ක්‍රිප්ට්.

source: Server Settings
si_lk: සේවාදායක සැකසුම්

source: Set up and diagnose your MISP installation.
si_lk: ඔබගේ MISP ස්ථාපනය සකසන්න සහ රෝග විනිශ්චය කරන්න.

source: View the background jobs and their progress.
si_lk: පසුබිම් රැකියා සහ ඒවායේ ප්‍රගතිය බලන්න.

source: Schedule the pre-defined tasks for your instance (this currently includes export caching, server pull and server push).
si_lk: ඔබගේ නිදසුන සඳහා පූර්ව නිර්වචනය කරන ලද කාර්යයන් උපලේඛනගත කරන්න (මෙයට දැනට අපනයන හැඹිලිගත කිරීම, සේවාදායක ඇදීම සහ සේවාදායක තල්ලුව ඇතුළත් වේ).

source: View the logs of the instance.
si_lk: සිද්ධියේ ලඝු බලන්න.

source: Search the logs by various attributes.
si_lk: විවිධ ගුණාංග අනුව ලඝු-සටහන් සොයන්න.

source: List all of the discussion threads.
si_lk: සියලුම සාකච්ඡා නූල් ලැයිස්තුගත කරන්න.

source: Create a new discussion thread.
si_lk: නව සාකච්ඡා ත්‍රෙඩ් එකක් සාදන්න.

source: The left bar
si_lk: වම් තීරුව

source: This bar changes based on each page-group. The blue selection shows you what page you are on.
si_lk: මෙම තීරුව එක් එක් පිටු-කණ්ඩායම මත පදනම්ව වෙනස් වේ. නිල් පැහැති තේරීම ඔබ කුමන පිටුවක සිටිනවාද යන්න පෙන්වයි.
