Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: Valid JSON array or comma separated
si_lk: වලංගු JSON අරාව හෝ කොමාව වෙන් කර ඇත

source: Valid JSON array composed from Object of the form {key: keyname, value: actualValue}
si_lk: වලංගු JSON අරාව {key: keyname, value: actualValue}පෝරමයේ වස්තුවෙන් සෑදී ඇත

source: You can't publish a galaxy cluster that is already published
si_lk: ඔබට දැනටමත් ප්‍රකාශනය කර ඇති මන්දාකිණි පොකුරක් ප්‍රකාශනය කළ නොහැක

source: Default galaxy cluster cannot be published
si_lk: පෙරනිමි මන්දාකිණි පොකුර ප්‍රකාශනය කළ නොහැක

source: Publish job queued. Job ID: %s
si_lk: රැකියා පෝලිම් ප්‍රකාශනය කරන්න. රැකියා ID: %s

source: Could not publish galaxy cluster
si_lk: මන්දාකිණි පොකුර ප්‍රකාශනය කළ නොහැකි විය

source: Galaxy cluster published
si_lk: Galaxy cluster ප්‍රකාශයට පත් කරන ලදී

source: You can't unpublish a galaxy cluster that is not published
si_lk: ඔබට ප්‍රකාශනය නොකළ මන්දාකිණි පොකුරක් ප්‍රකාශනය කිරීමෙන් ඉවත් කළ නොහැක

source: Default galaxy cluster cannot be unpublished
si_lk: පෙරනිමි මන්දාකිණි පොකුර ප්‍රකාශයට පත් කිරීම ඉවත් කළ නොහැක

source: Could not unpublish galaxy cluster
si_lk: මන්දාකිණි පොකුර ප්‍රකාශනය නොකිරීමට නොහැකි විය

source: Galaxy cluster unpublished
si_lk: Galaxy පොකුර ප්‍රකාශනය නොකළ

source: Galaxy cluster successfuly %s deleted%s.
si_lk: Galaxy cluster සාර්ථකයි %s%sලදී.

source: and added to the block list
si_lk: සහ වාරණ ලැයිස්තුවට එකතු කරන ලදී

source: Galaxy cluster could not be %s deleted.
si_lk: Galaxy පොකුර %s මකා දැමිය නොහැක.

source: Galaxy cluster successfuly restored.
si_lk: Galaxy පොකුර සාර්ථකව ප්‍රතිසාධනය කරන ලදී.

source: Galaxy cluster could not be %s restored.
si_lk: Galaxy පොකුර %s ප්‍රතිසාධනය කළ නොහැකි විය.

source: This function can only be reached via POST.
si_lk: මෙම කාර්යයට ළඟා විය හැක්කේ POST හරහා පමණි.

source: Default galaxy cluster cannot be updated
si_lk: පෙරනිමි මන්දාකිණි පොකුර යාවත්කාලීන කළ නොහැක

source: Galaxy cluster is not a fork
si_lk: Galaxy cluster යනු දෙබලක නොවේ

source: Cluster updated to the newer version
si_lk: පොකුර නව අනුවාදයට යාවත්කාලීන කරන ලදී

source: Element not found
si_lk: මූලද්රව්යය හමු නොවීය

source: Galaxy element %s deleted
si_lk: Galaxy මූලද්‍රව්‍ය %s මකන ලදී

source: Could not delete galaxy element
si_lk: මන්දාකිණි මූලද්‍රව්‍ය මැකීමට නොහැකි විය

source: All jobs have been purged
si_lk: සියලුම රැකියා පිරිසිදු කර ඇත

source: All completed jobs have been purged
si_lk: සම්පුර්ණ කරන ලද සියලුම රැකියා පිරිසිදු කර ඇත

source: Job status not found.
si_lk: රැකියා තත්ත්වය හමු නොවීය.

source: News item added.
si_lk: පුවත් අයිතමය එකතු කරන ලදී.

source: The news item could not be added.
si_lk: පුවත් අයිතමය එක් කළ නොහැකි විය.

source: News item updated.
si_lk: ප්‍රවෘත්ති අයිතමය යාවත්කාලීන කරන ලදී.

source: Could not update news item.
si_lk: ප්‍රවෘත්ති අයිතමය යාවත්කාලීන කිරීමට නොහැකි විය.

source: Noticelist not found.
si_lk: දැන්වීම් ලැයිස්තුව හමු නොවීය.

source: Noticelist enabled.
si_lk: දැන්වීම් ලැයිස්තුව සබල කර ඇත.

source: Noticelist disabled.
si_lk: දැනුම්දීම් අබල කර ඇත.

source: This endpoint expects a POST request.
si_lk: මෙම අවසන් ලක්ෂ්‍යය POST ඉල්ලීමක් අපේක්ෂා කරයි.

source: Invalid object reference.
si_lk: වලංගු නොවන වස්තු යොමුව.

source: All Objects
si_lk: සියලුම වස්තු

source: Invalid object template
si_lk: වලංගු නොවන වස්තු අච්චුව

source: Invalid object template id.
si_lk: වලංගු නොවන වස්තු අච්චු id.

source: Object Template deleted
si_lk: වස්තු අච්චුව මකා ඇත

source: Template not found
si_lk: අච්චුව හමු නොවීය

source: This action can only be reached via POST requests
si_lk: මෙම ක්‍රියාවට ළඟා විය හැක්කේ POST ඉල්ලීම් හරහා පමණි

source: You don't have permissions to create objects.
si_lk: ඔබට වස්තු සෑදීමට අවසර නැත.

source: Invalid template.
si_lk: වලංගු නොවන අච්චුවක්.

source: Object could not be saved.
si_lk: වස්තුව සුරැකීමට නොහැකි විය.

source: Invalid object.
si_lk: වලංගු නොවන වස්තුවකි.

source: Insufficient permissions to edit this object.
si_lk: මෙම වස්තුව සංස්කරණය කිරීමට ප්‍රමාණවත් අවසර නොමැත.

source: Force update anyway
si_lk: කෙසේ හෝ බලහත්කාරයෙන් යාවත්කාලීන කරන්න

source: Object attributes saved.
si_lk: වස්තු ගුණාංග සුරකින ලදී.

source: This function can only be accessed via POST or PUT
si_lk: මෙම කාර්යයට ප්‍රවේශ විය හැක්කේ POST හෝ PUT හරහා පමණි

source: Invalid object
si_lk: වලංගු නොවන වස්තුවකි

source: Invalid template
si_lk: වලංගු නොවන අච්චුවක්

source: Invalid fields
si_lk: වලංගු නොවන ක්ෂේත්‍ර

source: Invalid field
si_lk: වලංගු නොවන ක්ෂේත්‍රය

source: You don't have permissions to delete objects.
si_lk: ඔබට වස්තු මැකීමට අවසර නැත.

source: Object not found or not authorised.
si_lk: වස්තුව හමු නොවීම හෝ අවසර දී නැත.

source: %s objects successfully reconstructed.
si_lk: වස්තූන් %s ක් සාර්ථකව ප්‍රතිනිර්මාණය කරන ලදී.

source: This action can only be reached via AJAX.
si_lk: මෙම ක්‍රියාවට ළඟා විය හැක්කේ AJAX හරහා පමණි.

source: Invalid sharing group.
si_lk: වලංගු නොවන බෙදාගැනීමේ කණ්ඩායම.

source: Failed to create an Object from Attributes. Error:
si_lk: ගුණාංග වලින් වස්තුවක් සෑදීමට අසමත් විය. දෝෂය:

source: No Attribute selected.
si_lk: ගුණාංගයක් තෝරා නැත.

source: Invalid object ID.
si_lk: වලංගු නොවන වස්තු ID.

source: Organisation BlockListing is not currently enabled on this instance.
si_lk: මෙම අවස්ථාවේදී සංවිධානය අවහිර ලැයිස්තුගත කිරීම දැනට සබල කර නොමැත.

source: This feature is disabled on this instance for normal users.
si_lk: සාමාන්‍ය පරිශීලකයින් සඳහා මෙම අවස්ථාවෙහිදී මෙම විශේෂාංගය අක්‍රිය කර ඇත.

source: Unknown
si_lk: නොදන්නා

source: The organisation has been successfully added.
si_lk: සංවිධානය සාර්ථකව එකතු කර ඇත.

source: The organisation could not be added.
si_lk: සංවිධානය එක් කළ නොහැකි විය.

source: Not specified
si_lk: විශේෂයෙන් දක්වා නැති

source: Invalid organisation.
si_lk: වලංගු නොවන සංවිධානයක්.

source: Invalid organisation
si_lk: වලංගු නොවන සංවිධානයක්

source: Organisation updated.
si_lk: සංවිධානය යාවත්කාලීන කරන ලදී.

source: The organisation could not be updated.
si_lk: සංවිධානය යාවත්කාලීන කළ නොහැකි විය.

source: Action not allowed, post or delete request expected.
si_lk: ක්‍රියාවට අවසර නැත, තැපැල් කිරීම හෝ මකා දැමීම අපේක්ෂා කෙරේ.

source: Organisation deleted
si_lk: සංවිධානය මකා දමන ලදී

source: Organisation could not be deleted. Generally organisations should never be deleted, instead consider moving them to the known remote organisations list. Alternatively, if you are certain that you would like to remove an organisation and are aware of the impact, make sure that there are no users or events still tied to this organisation before deleting it.
si_lk: සංවිධානය මැකීමට නොහැකි විය. සාමාන්‍යයෙන් ආයතන කිසිවිටක මකා දැමිය යුතු නැත, ඒ වෙනුවට ඒවා දන්නා දුරස්ථ සංවිධාන ලැයිස්තුවට ගෙනයාම සලකා බලන්න. විකල්පයක් ලෙස, ඔබ සංවිධානයක් ඉවත් කිරීමට කැමති බව සහ එහි බලපෑම පිළිබඳව දැනුවත් බව ඔබට විශ්වාස නම්, එය මැකීමට පෙර මෙම සංවිධානයට සම්බන්ධ පරිශීලකයන් හෝ සිදුවීම් නොමැති බවට වග බලා ගන්න.

source: Organisation %s
si_lk: සංවිධානය %s

source: This action is not enabled on this instance.
si_lk: මෙම අවස්ථාවේදී මෙම ක්‍රියාව සබල කර නොමැත.

source: The organisation has been successfully merged.
si_lk: සංවිධානය සාර්ථකව ඒකාබද්ධ කර ඇත.

source: There was an error while merging the organisations. To find out more about what went wrong, refer to the audit logs. If you would like to revert the changes, you can find a .sql file
si_lk: සංවිධාන ඒකාබද්ධ කිරීමේදී දෝෂයක් ඇති විය. වැරදී ඇති දේ පිළිබඳ වැඩිදුර සොයා බැලීම සඳහා, විගණන ලඝු-සටහන් වෙත යොමු වන්න. ඔබ වෙනස්කම් ප්‍රතිවර්තනය කිරීමට කැමති නම්, ඔබට .sql ගොනුවක් සොයා ගත හැක

source: Discussion about Event #%s (%s)
si_lk: සිදුවීම #%s (%s) පිළිබඳ සාකච්ඡාව

source: Invalid thread
si_lk: වලංගු නොවන නූල්

source: Cannot post an empty message.
si_lk: හිස් පණිවිඩයක් පළ කළ නොහැක.

source: Post added
si_lk: පෝස්ට් එකතු කරන ලදී

source: The post could not be added.
si_lk: පළ කිරීම එක් කළ නොහැකි විය.

source: Invalid post
si_lk: වලංගු නොවන පළ කිරීම

source: This is not your post.
si_lk: මෙය ඔබගේ සටහන නොවේ.

source: Post edited
si_lk: පළ කිරීම සංස්කරණය කරන ලදී

source: The post could not be edited. Please, try again.
si_lk: පළ කිරීම සංස්කරණය කළ නොහැකි විය. කරුණාකර නැවත උත්සාහ කරන්න.

source: This post doesn't belong to you, so you cannot delete it.
si_lk: මෙම පළ කිරීම ඔබට අයිති නැති නිසා ඔබට එය මකා දැමිය නොහැක.

source: Post and thread deleted
si_lk: පළ කිරීම සහ නූල් මකා ඇත

source: Post deleted
si_lk: පළ කිරීම මකා දමන ලදී

source: The Regexp has been saved.
si_lk: Regexp සුරකින ලදි.

source: The Regexp could not be saved. Please, try again.
si_lk: Regexp සුරැකීමට නොහැකි විය. කරුණාකර නැවත උත්සාහ කරන්න.

source: The Regular expressions have been saved.
si_lk: සාමාන්‍ය ප්‍රකාශන සුරැකී ඇත.

source: Could not create the Regex entry as no types were selected. Either check "All" or check the types that you wish the Regex to affect.
si_lk: කිසිදු වර්ගයක් තෝරා නොගත් නිසා Regex ප්‍රවේශය තැනීමට නොහැකි විය. එක්කෝ "සියල්ල" පරීක්ෂා කරන්න, නැතහොත් Regex බලපෑමට ඔබ කැමති වර්ග පරීක්ෂා කරන්න.

source: All done! Number of changed attributes:
si_lk: සියල්ල නිමයි! වෙනස් කළ ගුණාංග ගණන:

source: All done! Found and cleaned
si_lk: සියල්ල නිමයි! සොයාගෙන පිරිසිදු කර ඇත

source: Invalid entry.
si_lk: වලංගු නොවන ඇතුල්වීමක්.

source: Entry removed.
si_lk: ඇතුල්වීම ඉවත් කරන ලදී.

source: Invalid Role
si_lk: වලංගු නොවන භූමිකාව

source: The Role has been saved
si_lk: භූමිකාව සුරැකී ඇත

source: The Role could not be saved. Please, try again.
si_lk: භූමිකාව සුරැකීමට නොහැකි විය. කරුණාකර නැවත උත්සාහ කරන්න.

source: It is not possible to delete role that is assigned to users.
si_lk: පරිශීලකයින්ට පවරා ඇති භූමිකාව මකා දැමිය නොහැක.

source: Default role set.
si_lk: පෙරනිමි කාර්ය භාරය.

source: Default role unset.
si_lk: පෙරනිමි භූමිකාව සකසා නැත.

source: Event '%s' not found.
si_lk: '%s' සිදුවීම හමු නොවීය.

source: Download failed. %s
si_lk: බාගත කිරීම අසමත් විය. %s

source: Remote event preview
si_lk: දුරස්ථ සිදුවීම් පෙරදසුන

source: Server overlap analysis matrix
si_lk: සේවාදායක අතිච්ඡාදනය විශ්ලේෂණ අනුකෘතිය

source: The pull filter rules must be in valid JSON format.
si_lk: අදින්න පෙරහන් රීති වලංගු JSON ආකෘතියෙන් විය යුතුය.

source: The push filter rules must be in valid JSON format.
si_lk: තල්ලු පෙරහන් රීති වලංගු JSON ආකෘතියෙන් විය යුතුය.

source: That organisation could not be created as the uuid is in use already.
si_lk: uuid දැනටමත් භාවිතයේ පවතින බැවින් එම සංවිධානය නිර්මාණය කළ නොහැක.

source: Couldn't save the new organisation, are you sure that the uuid is in the correct format? Also, make sure the organisation's name doesn't clash with an existing one.
si_lk: නව සංවිධානය සුරැකීමට නොහැකි විය, uuid නිවැරදි ආකෘතියේ ඇති බව ඔබට විශ්වාසද? එසේම, සංවිධානයේ නම පවතින නමක් සමඟ ගැටෙන්නේ නැති බවට වග බලා ගන්න.

source: The server has been saved
si_lk: සේවාදායකය සුරැකී ඇත

source: The server could not be saved. Please, try again.
si_lk: සේවාදායකය සුරැකීමට නොහැකි විය. කරුණාකර නැවත උත්සාහ කරන්න.

source: Invalid server
si_lk: වලංගු නොවන සේවාදායකය

source: Couldn't save the new organisation, are you sure that the uuid is in the correct format?.
si_lk: නව සංවිධානය සුරැකීමට නොහැකි විය, uuid නිවැරදි ආකෘතියේ ඇති බව ඔබට විශ්වාසද?.

source: This endpoint expects POST requests.
si_lk: මෙම අවසන් ලක්ෂ්‍යය POST ඉල්ලීම් අපේක්ෂා කරයි.

source: Server deleted
si_lk: සේවාදායකය මකා ඇත

source: Server was not deleted
si_lk: සේවාදායකය මකා නැත

source: Settings saved
si_lk: සැකසීම් සුරකින ලදී

source: Could not save the settings. Invalid input.
si_lk: සැකසුම් සුරැකීමට නොහැකි විය. වලංගු නොවන ආදානය.

source: Pull setting not enabled for this server.
si_lk: මෙම සේවාදායකය සඳහා අදින්න සැකසීම සබල කර නැත.

source: Pulling.
si_lk: ඇදගෙන යනවා.

source: Pull queued for background execution. Job ID: %s
si_lk: පසුබිම ක්‍රියාත්මක කිරීම සඳහා අදින්න පෝලිමේ. රැකියා ID: %s

source: The remote server is too outdated to initiate a push towards it. Please notify the hosting organisation of the remote instance.
si_lk: එය වෙත තල්ලුවක් ආරම්භ කිරීමට දුරස්ථ සේවාදායකය යල් පැන ගිය වැඩිය. කරුණාකර දුරස්ථ අවස්ථාව පිළිබඳ සත්කාරක සංවිධානයට දැනුම් දෙන්න.

source: Push complete. %s events pushed, %s events could not be pushed.
si_lk: තල්ලු කිරීම සම්පූර්ණයි. සිදුවීම් %s ක් තල්ලු කර ඇත, සිදුවීම් %s ක් තල්ලු කළ නොහැක.

source: Pushing.
si_lk: තල්ලු කරනවා.

source: Push queued for background execution. Job ID: %s
si_lk: පසුබිම ක්‍රියාත්මක කිරීම සඳහා තල්ලු පෝලිමේ. රැකියා ID: %s

source: Filename not allowed
si_lk: ගොනු නාමයට අවසර නැත

source: Incorrect extension or empty file.
si_lk: වැරදි දිගුවක් හෝ හිස් ගොනුවක්.

source: OK
si_lk: හරි

source: not found
si_lk: හමු වුණේ නැහැ

source: is not writeable
si_lk: ලිවිය නොහැකි ය

source: not readable
si_lk: කියවිය නොහැක

source: FAIL: settings not set
si_lk: අසාර්ථකයි: සැකසීම් සකසා නැත

source: FAIL: Failed to load GnuPG
si_lk: අසාර්ථකයි: GnuPG පූරණය කිරීමට අසමත් විය

source: FAIL: Issues with the key/passphrase
si_lk: අසාර්ථකයි: යතුර/මුරපද සමඟ ගැටලු

source: FAIL: sign failed
si_lk: අසාර්ථකයි: ලකුණ අසාර්ථකයි

source: not configured (so not tested)
si_lk: වින්‍යාස කර නැත (එබැවින් පරීක්ෂා කර නැත)

source: Getting URL via proxy failed
si_lk: ප්‍රොක්සි හරහා URL ලබා ගැනීම අසාර්ථක විය

source: not enabled (so not tested)
si_lk: සබල කර නැත (එබැවින් පරීක්ෂා කර නැත)

source: Python ZeroMQ library not installed correctly.
si_lk: Python ZeroMQ පුස්තකාලය නිවැරදිව ස්ථාපනය කර නොමැත.

source: ZeroMQ script not running.
si_lk: ZeroMQ ස්ක්‍රිප්ට් ධාවනය නොවේ.

source: High
si_lk: ඉහළ

source: Alternative setting used
si_lk: විකල්ප සැකසුම භාවිතා කර ඇත

source: Test failed
si_lk: පරීක්ෂණය අසාර්ථක විය

source: System not enabled
si_lk: පද්ධතිය සබල කර නැත

source: No modules found
si_lk: මොඩියුල හමු නොවීය

source: Not configured (so not tested)
si_lk: වින්‍යාස කර නැත (එබැවින් පරීක්‍ෂා කර නැත)

source: Error connecting to Redis.
si_lk: Redis වෙත සම්බන්ධ වීමේ දෝෂයකි.

source: Error connecting to Supervisor.
si_lk: අධීක්ෂක වෙත සම්බන්ධ වීමේ දෝෂයකි.

source: Error connecting to Redis and Supervisor.
si_lk: Redis සහ Supervisor වෙත සම්බන්ධ වීමේ දෝෂයකි.

source: MISP will not operate correctly or will be unsecure until these issues are resolved.
si_lk: මෙම ගැටළු විසඳන තුරු MISP නිවැරදිව ක්‍රියා නොකරනු ඇත හෝ අනාරක්ෂිත වනු ඇත.

source: Some of the features of MISP cannot be utilised until these issues are resolved.
si_lk: මෙම ගැටළු විසඳන තුරු MISP හි සමහර විශේෂාංග භාවිතා කළ නොහැක.

source: There are some optional tweaks that could be done to improve the looks of your MISP instance.
si_lk: ඔබගේ MISP අවස්ථාවෙහි පෙනුම වැඩිදියුණු කිරීම සඳහා කළ හැකි විකල්ප වෙනස් කිරීම් කිහිපයක් තිබේ.

source: Diagnostics
si_lk: රෝග විනිශ්චය

source: Worker start signal sent
si_lk: සේවක ආරම්භක සංඥාව යවා ඇත

source: Only one `update` worker can run at a time
si_lk: වරකට ධාවනය කළ හැක්කේ එක් 'යාවත්කාලීන' සේවකයෙකුට පමණි

source: Worker stop signal sent
si_lk: සේවක නැවතුම් සංඥා යවා ඇත

source: Background jobs not enabled
si_lk: පසුබිම් රැකියා සබල කර නැත

source: Issue while contacting the remote server to retrieve event information
si_lk: සිදුවීම් තොරතුරු ලබා ගැනීම සඳහා දුරස්ථ සේවාදායකය සම්බන්ධ කර ගැනීමේදී ගැටළුවක්

source: This event could not be found or you don't have permissions to see it.
si_lk: මෙම සිදුවීම සොයා ගැනීමට නොහැකි විය හෝ ඔබට එය බැලීමට අවසර නොමැත.

source: The event has been found.
si_lk: සිද්ධිය සොයාගෙන ඇත.

source: Event ID translator
si_lk: සිදුවීම් ID පරිවර්තකය

source: This setting is redacted.
si_lk: මෙම සැකසුම නැවත සකස් කර ඇත.

source: Setting %s is invalid.
si_lk: %s සැකසීම වලංගු නොවේ.

source: This setting can only be edited via the CLI.
si_lk: මෙම සැකසුම සංස්කරණය කළ හැක්කේ CLI හරහා පමණි.

source: Killing workers.
si_lk: කම්කරුවන් මරනවා.

source: Restarting workers.
si_lk: කම්කරුවන් නැවත ආරම්භ කිරීම.

source: File not found.
si_lk: ගොනුව හමු නොවිණි.

source: File could not be deleted.
si_lk: ගොනුව මැකීමට නොහැකි විය.

source: Upload failed.
si_lk: උඩුගත කිරීම අසාර්ථක විය.

source: File already exists. If you would like to replace it, remove the old one first.
si_lk: ගොනුව දැනටමත් පවතී. ඔබට එය ප්‍රතිස්ථාපනය කිරීමට අවශ්‍ය නම්, පළමුව පැරණි එක ඉවත් කරන්න.

source: Something went wrong. %s
si_lk: මොකක්හරි වැරැද්දක් වෙලා. %s

source: Starting server caching.
si_lk: සේවාදායක හැඹිලිගත කිරීම ආරම්භ කිරීම.

source: Caching the servers has failed.
si_lk: සේවාදායකයන් හැඹිලිගත කිරීම අසාර්ථක විය.

source: Caching the servers has successfully completed.
si_lk: සේවාදායකයන් හැඹිලිගත කිරීම සාර්ථකව අවසන් කර ඇත.

source: Cannot create sync config - no host org ID configured for the instance.
si_lk: සමමුහුර්ත වින්‍යාසය සෑදිය නොහැක - උදාහරණය සඳහා ධාරක org ID වින්‍යාස කර නොමැත.

source: Configured host org not found. Please make sure that the setting is current on the instance.
si_lk: වින්‍යාස කළ ධාරක org හමු නොවීය. සැකසුම නිදසුනෙහි පවතින බව කරුණාකර සහතික කර ගන්න.

source: Could not save the server. Error: %s
si_lk: සේවාදායකය සුරැකීමට නොහැකි විය. දෝෂය: %s

source: API key updated.
si_lk: API යතුර යාවත්කාලීන කරන ලදී.

source: ID has to be a valid server connection
si_lk: හැඳුනුම්පත වලංගු සේවාදායක සම්බන්ධතාවයක් විය යුතුය

source: Invalid direction. Valid options:
si_lk: අවලංගු දිශාව. වලංගු විකල්ප:

source: Priority changed.
si_lk: ප්‍රමුඛතාවය වෙනස් විය.

source: Priority could not be changed.
si_lk: ප්රමුඛත්වය වෙනස් කළ නොහැකි විය.

source: This method can only be access via REST
si_lk: මෙම ක්‍රමයට ප්‍රවේශ විය හැක්කේ REST හරහා පමණි

source: Job created.
si_lk: රැකියා නිර්මාණය කර ඇත.

source: Could not discard proposal.
si_lk: යෝජනාව ඉවත දැමිය නොහැකි විය.

source: Attribute has not been added: attachments are added by "Add attachment" button
si_lk: උපලක්ෂණ එකතු කර නැත: ඇමුණුම් එකතු කරනු ලබන්නේ "ඇමිණුම් එකතු කරන්න" බොත්තම මගිනි

source: The lines
si_lk: රේඛා

source: The proposal has been saved
si_lk: යෝජනාව සුරැකී ඇත

source: Could not save the proposal. Errors: %s
si_lk: යෝජනාව සුරැකීමට නොහැකි විය. දෝෂ: %s

source: The proposal could not be saved. Please, try again.
si_lk: යෝජනාව සුරැකිය නොහැකි විය. කරුණාකර නැවත උත්සාහ කරන්න.

source: Invalid Proposal
si_lk: වලංගු නොවන යෝජනාවක්

source: Proposal not an attachment or malware-sample
si_lk: යෝජනාව ඇමුණුමක් හෝ අනිෂ්ට මෘදුකාංග-නියැදියක් නොවේ

source: The attachment has been uploaded
si_lk: ඇමුණුම උඩුගත කර ඇත

source: The attachment has been uploaded, but some of the proposals could not be created. The failed proposals are:
si_lk: ඇමුණුම උඩුගත කර ඇත, නමුත් සමහර යෝජනා නිර්මාණය කිරීමට නොහැකි විය. අසාර්ථක වූ යෝජනා මෙසේය.

source: The attachment could not be saved, please contact your administrator.
si_lk: ඇමුණුම සුරැකීමට නොහැකි විය, කරුණාකර ඔබේ පරිපාලක අමතන්න.

source: The proposed Attribute has been saved
si_lk: යෝජිත ගුණාංගය සුරැකී ඇත

source: The proposed Attribute could not be saved. Please, try again.
si_lk: යෝජිත ගුණාංගය සුරැකිය නොහැකි විය. කරුණාකර නැවත උත්සාහ කරන්න.

source: Invalid proposal.
si_lk: වලංගු නොවන යෝජනාවක්.

source: Sharing Group deleted
si_lk: බෙදාගැනීමේ කණ්ඩායම මකා ඇත

source: Sharing Group could not be deleted. Make sure that there are no events, attributes or threads belonging to this sharing group.
si_lk: බෙදාගැනීමේ කණ්ඩායම මැකීමට නොහැකි විය. මෙම බෙදාගැනීමේ කණ්ඩායමට අයත් සිදුවීම්, ගුණාංග හෝ නූල් නොමැති බව සහතික කර ගන්න.

source: Sharing Groups
si_lk: බෙදාගැනීමේ කණ්ඩායම්

source: SightingDB connection added.
si_lk: SightingDB සම්බන්ධතාවය එකතු කරන ලදී.

source: SightingDB connection could not be added.
si_lk: SightingDB සම්බන්ධතාවය එක් කළ නොහැකි විය.

source: Invalid SightingDB entry.
si_lk: වලංගු නොවන SightingDB ඇතුළත් කිරීම.

source: SightingDB connection updated.
si_lk: SightingDB සම්බන්ධතාවය යාවත්කාලීන කරන ලදී.

source: SightingDB connection could not be updated.
si_lk: SightingDB සම්බන්ධතාවය යාවත්කාලීන කළ නොහැකි විය.

source: SightingDB connection removed.
si_lk: SightingDB සම්බන්ධතාවය ඉවත් කරන ලදී.

source: SightingDB connection could not be removed.
si_lk: SightingDB සම්බන්ධතාවය ඉවත් කළ නොහැකි විය.

source: Pass a valid SightingDB ID
si_lk: වලංගු SightingDB හැඳුනුම්පතක් සම්මත කරන්න

source: Could not add the Sighting. Reason:
si_lk: දර්ශනය එක් කිරීමට නොහැකි විය. හේතුව:

source: Sighting added
si_lk: දර්ශනය එකතු කරන ලදී

source: You are not authorised to remove sightings data as you don't have permission to modify your organisation's data.
si_lk: ඔබට ඔබේ සංවිධානයේ දත්ත වෙනස් කිරීමට අවසර නොමැති බැවින් දර්ශන දත්ත ඉවත් කිරීමට ඔබට අවසර නැත.

source: Attribute not found
si_lk: ගුණාංගය හමු නොවීය

source: Invalid request.
si_lk: වලංගු නොවන ඉල්ලීමක්.

source: Sighting added.
si_lk: දර්ශනය එකතු කරන ලදී.

source: Sighting could not be added
si_lk: බැලීම එක් කළ නොහැකි විය

source: The tag collection has been saved
si_lk: ටැග් එකතුව සුරැකී ඇත

source: The tag collection could not be added. Reason:
si_lk: ටැග් එකතුව එක් කළ නොහැකි විය. හේතුව:

source: %s new tag collections added.
si_lk: නව ටැග් එකතු කිරීම් %s ක් එක් කරන ලදී.

source: Invalid Tag Collection
si_lk: වලංගු නොවන ටැග් එකතුවක්

source: You don't have editing rights on this Tag Collection.
si_lk: ඔබට මෙම ටැග් එකතුවෙහි සංස්කරණ හිමිකම් නොමැත.

source: Invalid tag collection.
si_lk: වලංගු නොවන ටැග් එකතුවක්.

source: Tag collection deleted.
si_lk: ටැග් එකතුව මකා ඇත.

source: Tag collection could not be deleted.
si_lk: ටැග් එකතුව මැකීමට නොහැකි විය.

source: You are not allowed to delete that.
si_lk: ඔබට එය මකා දැමීමට අවසර නැත.

source: Invalid tag collection
si_lk: වලංගු නොවන ටැග් එකතුවක්

source: Tag(s) added.
si_lk: ටැග්(ය) එකතු කරන ලදී.

source: Tag(s) could not be added.
si_lk: ටැග්(ය) එක් කළ නොහැකි විය.

source: All tags are already present, nothing to add.
si_lk: සියලුම ටැග් දැනටමත් ඇත, එකතු කිරීමට කිසිවක් නැත.

source: Invalid tag collection tag.
si_lk: වලංගු නොවන ටැග් එකතු කිරීමේ ටැගය.

source: Insufficient privileges to remove the tag from the collection.
si_lk: එකතුවෙන් ටැගය ඉවත් කිරීමට ප්‍රමාණවත් වරප්‍රසාද නැත.

source: Invalid tag or tag not associated with the collection.
si_lk: වලංගු නොවන ටැගය හෝ ටැගය එකතුව හා සම්බන්ධ නොවේ.

source: Failed to remove tag from the collection.
si_lk: එකතුවෙන් ටැගය ඉවත් කිරීමට අසමත් විය.

source: Tag deleted
si_lk: ටැගය මකා ඇත

source: Tag was not deleted
si_lk: ටැගය මකා නැත

source: Favourite Tags
si_lk: ප්රියතම ටැග්

source: Tag Collections
si_lk: ටැග් එකතු කිරීම්

source: Custom Tags
si_lk: අභිරුචි ටැග්

source: All Tags
si_lk: සියලුම ටැග්

source: Taxonomy Library
si_lk: වර්ගීකරණ පුස්තකාලය

source: Includes:
si_lk: ඇතුළත් වේ:

source: Cannot alter the tags of this data, only the organisation that has created the data (orgc) can modify global tags.
si_lk: මෙම දත්තවල ටැග් වෙනස් කළ නොහැක, දත්ත (orgc) නිර්මාණය කර ඇති සංවිධානයට පමණක් ගෝලීය ටැග් වෙනස් කළ හැක.

source: Please consider using local tags if you are in the host organisation of the instance.
si_lk: ඔබ එම අවස්ථාවෙහි සත්කාරක සංවිධානයේ සිටින්නේ නම් කරුණාකර දේශීය ටැග් භාවිතා කිරීම සලකා බලන්න.

source: Invalid Target.
si_lk: වලංගු නොවන ඉලක්කය.

source: Local tags can only be added by users of the host organisation.
si_lk: දේශීය ටැග් එකතු කළ හැක්කේ සත්කාරක සංවිධානයේ පරිශීලකයින්ට පමණි.

source: Tag not found and insufficient privileges to create it.
si_lk: ටැගය සොයාගත නොහැකි වූ අතර එය නිර්මාණය කිරීමට ප්‍රමාණවත් වරප්‍රසාද නොමැත.

source: Unable to create tag. Reason:
si_lk: ටැගය සෑදීමට නොහැක. හේතුව:

source: Invalid Tag.
si_lk: වලංගු නොවන ටැගය.

source: Invalid Tag. This tag can only be set by a fixed organisation.
si_lk: වලංගු නොවන ටැගය. මෙම ටැගය සැකසිය හැක්කේ ස්ථාවර සංවිධානයකට පමණි.

source: Invalid Tag. This tag can only be set by a fixed user.
si_lk: වලංගු නොවන ටැගය. මෙම ටැගය සැකසිය හැක්කේ ස්ථාවර පරිශීලකයෙකුට පමණි.

source: %s already has the requested tag attached, no changes had to be made for tag %s.
si_lk: %s දැනටමත් ඉල්ලූ ටැගය අමුණා ඇත, ටැගය %sසඳහා කිසිදු වෙනසක් සිදු නොකළ යුතුය.

source: Failed to attach tag to object.
si_lk: වස්තුව වෙත ටැගය ඇමිණීම අසාර්ථක විය.

source: Failed to attach %s tags. Reasons: %s
si_lk: ටැග් %s ක් ඇමිණීම අසාර්ථක විය. හේතු: %s

source: Successfully attached %s tags to %s (%s)
si_lk: %s (%s) වෙත ටැග් %s ක් සාර්ථකව අමුණා ඇත

source: . %s already has the requested tag attached, no changes had to be made for tags %s.
si_lk: . %s හි දැනටමත් ඉල්ලූ ටැගය අමුණා ඇත, ටැග් %sසඳහා කිසිදු වෙනසක් සිදු නොකළ යුතුය.
