Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: Allows to translate a local ID into the corresponding event ID on sync servers configured.
si_lk: වින්‍යාස කර ඇති සමමුහුර්ත සේවාදායක මත දේශීය හැඳුනුම්පතක් අනුරූප සිදුවීම් ID බවට පරිවර්තනය කිරීමට ඉඩ දෙන්න.

source: Event ID or UUID
si_lk: සිදුවීම් ID හෝ UUID

source: Referencing an event which is
si_lk: සිදුවීමක් සඳහන් කිරීම

source: remote
si_lk: දුරස්ථ

source: ID referenced on server
si_lk: ID සේවාදායකයේ සඳහන් කර ඇත

source: Local ID
si_lk: දේශීය හැඳුනුම්පත

source: Remote ID:
si_lk: දුරස්ථ ID:

source: preview
si_lk: පෙරදසුන

source: Remote server unreachable: %s
si_lk: දුරස්ථ සේවාදායකයට ළඟා විය නොහැක: %s

source: Not found
si_lk: හමු වුණේ නැහැ

source: Paste server data
si_lk: සේවාදායක දත්ත අලවන්න

source: Paste a MISP server metadata JSON below to add sync connections.
si_lk: සමමුහුර්ත සම්බන්ධතා එක් කිරීමට පහත MISP සේවාදායක පාරදත්ත JSON අලවන්න.

source: Server metadata JSON
si_lk: සේවාදායක පාරදත්ත JSON

source: Servers
si_lk: සේවාදායකයන්

source: Connection test
si_lk: සම්බන්ධතා පරීක්ෂණය

source: Sync user
si_lk: පරිශීලක සමමුහුර්ත කරන්න

source: Reset API key
si_lk: API යතුර යළි පිහිටුවන්න

source: Remote Organisation
si_lk: දුරස්ථ සංවිධානය

source: URL params
si_lk: URL පරාමිතීන්

source: Move server priority up
si_lk: සේවාදායක ප්‍රමුඛතාවය ඉහළට ගෙන යන්න

source: Move server priority down
si_lk: සේවාදායක ප්‍රමුඛතාවය පහළට ගෙන යන්න

source: Test the connection to the remote instance
si_lk: දුරස්ථ අවස්ථාවට සම්බන්ධතාවය පරීක්ෂා කරන්න

source: Run
si_lk: දුවන්න

source: View the sync user of the remote instance
si_lk: දුරස්ථ අවස්ථාවෙහි සමමුහුර්ත පරිශීලකයා බලන්න

source: Remotely reset API key
si_lk: API යතුර දුරස්ථව යළි පිහිටුවන්න

source: Internal instance that ignores distribution level degradation *WARNING: Only use this setting if you have several internal instances and the sync link is to an internal extension of the current MISP community*
si_lk: බෙදා හැරීමේ මට්ටම පිරිහීම නොසලකා හරින අභ්‍යන්තර අවස්ථාව *අවවාදයයි: ඔබට අභ්‍යන්තර අවස්ථා කිහිපයක් තිබේ නම් සහ සමමුහුර්ත සබැඳිය වත්මන් MISP ප්‍රජාවේ අභ්‍යන්තර දිගුවකට නම් පමණක් මෙම සැකසුම භාවිතා කරන්න*

source: Normal sync link to an external MISP instance. Distribution degradation will follow the normal rules.
si_lk: බාහිර MISP නිදසුනකට සාමාන්‍ය සමමුහුර්ත සබැඳිය. බෙදා හැරීමේ පිරිහීම සාමාන්ය නීති අනුගමනය කරනු ඇත.

source: Age: %s%s
si_lk: වයස: %s%s

source: Explore
si_lk: ගවේෂණය කරන්න

source: Pull updates to events that already exist locally
si_lk: දැනටමත් දේශීයව පවතින සිදුවීම් වෙත යාවත්කාලීන අදින්න

source: Pull updates
si_lk: යාවත්කාලීන අදින්න

source: Pull known relevant custom clusters
si_lk: දන්නා අදාළ අභිරුචි පොකුරු අදින්න

source: Pull relevant clusters
si_lk: අදාළ පොකුරු අදින්න

source: Cache instance
si_lk: හැඹිලි උදාහරණය

source: An action is already in progress...
si_lk: ක්‍රියාවක් දැනටමත් සිදු වෙමින් පවතී...

source: An action is already in progress. Starting new actions is not possible until completion of the current action process.
si_lk: ක්‍රියාවක් දැනටමත් සිදුවෙමින් පවතී. වත්මන් ක්‍රියා ක්‍රියාවලිය අවසන් වන තුරු නව ක්‍රියා ආරම්භ කළ නොහැක.

source: Show Update Progress Page
si_lk: යාවත්කාලීන ප්‍රගති පිටුව පෙන්වන්න

source: Running this script may take a very long time depending of the size of your database. It is adviced that you <b>back your database up</b> before running it.
si_lk: මෙම ස්ක්‍රිප්ට් ධාවනය කිරීම ඔබගේ දත්ත සමුදායේ ප්‍රමාණය අනුව ඉතා දිගු කාලයක් ගත විය හැක. එය ක්‍රියාත්මක කිරීමට පෙර ඔබගේ දත්ත සමුදාය <b>නැවත</b> ක් දක්වා ගෙන යන ලෙස උපදෙස් දෙනු ලැබේ.

source: Running this script will make this instance unusable for all users (not site-admin) during the time of upgrade.
si_lk: මෙම ස්ක්‍රිප්ට් ක්‍රියාත්මක කිරීමෙන් මෙම අවස්ථාව සියලු පරිශීලකයින්ට (අඩවි පරිපාලක නොවේ) උත්ශ්‍රේණිගත කිරීමේ කාලය තුළ භාවිත කළ නොහැකි වනු ඇත.

source: Action:
si_lk: කටයුතු:

source: This action has been done and cannot be run again.
si_lk: මෙම ක්‍රියාව සිදු කර ඇති අතර නැවත ධාවනය කළ නොහැක.

source: Filter the remote instance by tag: %s
si_lk: ටැගය මගින් දුරස්ථ අවස්ථාව පෙරහන් කරන්න: %s

source: Filter the remote instance on the tag: %s
si_lk: ටැගය මත දුරස්ථ අවස්ථාව පෙරහන් කරන්න: %s

source: You are currently viewing an event on the remote instance %s
si_lk: ඔබ දැනට දුරස්ථ අවස්ථාව %s හි සිදුවීමක් නරඹමින් සිටී

source: You are currently viewing the event index of the remote instance %s
si_lk: ඔබ දැනට දුරස්ථ අවස්ථාව %sහි සිදුවීම් දර්ශකය නරඹමින් සිටී

source: not
si_lk: නැහැ

source: published
si_lk: ප්රකාශයට පත් කරන ලදී

source: Failed pulls
si_lk: අසාර්ථක ඇදීම්

source: No failed pulls
si_lk: අසාර්ථක ඇදීම් නොමැත

source: Succeeded pulls
si_lk: සාර්ථක ඇදීම්

source: No succeeded pulls
si_lk: සාර්ථක ඇදීමක් නැත

source: Proposals pulled
si_lk: යෝජනා ඇදගෙන ගියා

source: No proposals pulled
si_lk: යෝජනා ඇදලා නැහැ

source: Sightings pulled
si_lk: දර්ශන ඇදී ගියේය

source: No sightings pulled
si_lk: දසුන් ඇදී ගියේ නැත

source: Failed pushes
si_lk: අසාර්ථක තල්ලු

source: No failed pushes
si_lk: අසාර්ථක තල්ලු කිරීම් නොමැත

source: Succeeded pushes
si_lk: සාර්ථක තල්ලු කිරීම්

source: No succeeded pushes
si_lk: සාර්ථක තල්ලු කිරීම් නොමැත

source: HTTP method to use
si_lk: භාවිතා කිරීමට HTTP ක්රමය

source: Relative path to query
si_lk: විමසුමට සාපේක්ෂ මාර්ගය

source: Use full path - disclose my apikey
si_lk: සම්පූර්ණ මාර්ගය භාවිතා කරන්න - මගේ apikey හෙළි කරන්න

source: Bookmark query
si_lk: Bookmark විමසුම

source: Bookmark name
si_lk: Bookmark නම

source: Show result
si_lk: ප්රතිඵල පෙන්වන්න

source: Skip SSL validation
si_lk: SSL වලංගුකරණය මඟ හරින්න

source: HTTP headers
si_lk: HTTP ශීර්ෂ

source: Inject
si_lk: එන්නත් කරන්න

source: Show rules
si_lk: නීති පෙන්වන්න

source: HTTP body
si_lk: HTTP ශරීරය

source: Run query
si_lk: විමසුම ධාවනය කරන්න

source: Queried URL
si_lk: විමසන ලද URL

source: Response code
si_lk: ප්‍රතිචාර කේතය

source: Request duration
si_lk: ඉල්ලීම් කාලය

source: Response headers
si_lk: ප්‍රතිචාර ශීර්ෂ

source: Warning: app/Config/config.php is not writeable. This means that any setting changes made here will NOT be saved.
si_lk: අවවාදයයි: යෙදුම/Config/config.php ලිවිය නොහැක. මෙයින් අදහස් කරන්නේ මෙහි සිදු කරන ලද කිසිදු සැකසුම් වෙනස් කිරීමක් සුරැකෙන්නේ නැති බවයි.

source: To edit a setting, simply double click it.
si_lk: සැකසීම් සංස්කරණය කිරීමට, එය දෙවරක් ක්ලික් කරන්න.

source: Updates are locked due to an ongoing update process. Release the update lock only if you know what you are doing.
si_lk: පවතින යාවත්කාලීන ක්‍රියාවලියක් හේතුවෙන් යාවත්කාලීන අගුලු දමා ඇත. ඔබ කරන්නේ කුමක්දැයි ඔබ දන්නේ නම් පමණක් යාවත්කාලීන අගුල මුදා හරින්න.

source: Before unlocking, make sure %s is healthy
si_lk: අගුලු හැරීමට පෙර, %s සෞඛ්‍ය සම්පන්න බව සහතික කර ගන්න

source: the update worker
si_lk: යාවත්කාලීන සේවකයා

source: automatically unlock in %smin %ssec
si_lk: මිනිත්තු %sතත්පර %sකින් ස්වයංක්‍රීයව අගුළු ඇරීම

source: Release update lock
si_lk: යාවත්කාලීන අගුල මුදා හරින්න

source: Complete update progression
si_lk: සම්පූර්ණ යාවත්කාලීන ප්‍රගතිය

source: %s remaining
si_lk: %s ඉතිරි

source: Database Update progress for update %s
si_lk: යාවත්කාලීන %sසඳහා දත්ත සමුදා යාවත්කාලීන ප්‍රගතිය

source: Update
si_lk: යාවත්කාලීන කරන්න

source: Started @
si_lk: පටන් ගත්තේ @

source: Elapsed Time @
si_lk: ගත වූ කාලය @

source: No update in progress
si_lk: යාවත්කාලීන කිරීමක් සිදු නොවේ

source: Follow updates
si_lk: යාවත්කාලීන අනුගමනය කරන්න

source: Total
si_lk: සමස්ත

source: View details on the usage of %s on the %s controller
si_lk: %s පාලකය මත %s භාවිතය පිළිබඳ විස්තර බලන්න

source: View user ID
si_lk: පරිශීලක හැඳුනුම්පත බලන්න

source: User #%s
si_lk: පරිශීලක #%s

source: Select instances to add
si_lk: එකතු කිරීමට අවස්ථා තෝරන්න

source: Available Instances
si_lk: පවතින අවස්ථා

source: Added Instances
si_lk: එකතු කළ අවස්ථා

source: Add servers to sharing group
si_lk: බෙදාගැනීමේ කණ්ඩායමට සේවාදායකයන් එක් කරන්න

source: Submodule
si_lk: උප මොඩියුලය

source: Current Version
si_lk: වත්මන් අනුවාදය

source: Version date
si_lk: අනුවාද දිනය

source: Update all submodules
si_lk: සියලුම උපමොඩියුල යාවත්කාලීන කරන්න

source: Outdated version (%s days, %s hours older than super project)
si_lk: යල් පැන ගිය අනුවාදය (දින%s , සුපිරි ව්‍යාපෘතියට වඩා පැය %s ක් පැරණි)

source: Newer version. Make sure to update MISP
si_lk: නව අනුවාදය. MISP යාවත්කාලීන කිරීමට වග බලා ගන්න

source: Invalid file permission.
si_lk: වලංගු නොවන ගොනු අවසරය.

source: Could not retrieve version
si_lk: අනුවාදය ලබා ගැනීමට නොහැකි විය

source: Update submodule
si_lk: උප මොඩියුලය යාවත්කාලීන කරන්න

source: Update result:
si_lk: ප්‍රතිඵලය යාවත්කාලීන කරන්න:

source: Do you want to pull the latest commit from the %s branch? If you have made local changes to MISP the merge will fail.
si_lk: ඔබට %s ශාඛාවෙන් නවතම කැපවීම ඇද ගැනීමට අවශ්‍යද? ඔබ MISP වෙත දේශීය වෙනස්කම් සිදු කර ඇත්නම් ඒකාබද්ධ කිරීම අසාර්ථක වනු ඇත.

source: ZeroMQ Server Status
si_lk: ZeroMQ සේවාදායක තත්ත්වය

source: Reply time
si_lk: පිළිතුරු කාලය

source: Start time
si_lk: ආරම්භක වේලාව

source: Events processed
si_lk: සිදුවීම් සකසන ලදී

source: Messages processed
si_lk: පණිවිඩ සකසන ලදී

source: The ZeroMQ server is unreachable.
si_lk: ZeroMQ සේවාදායකයට ළඟා විය නොහැක.

source: Cancel prompt
si_lk: විමසුම අවලංගු කරන්න

source: Add Proposal
si_lk: යෝජනාව එකතු කරන්න

source: Propose
si_lk: යෝජනා කරන්න

source: Is a malware sample
si_lk: අනිෂ්ට මෘදුකාංග සාම්පලයකි

source: Type
si_lk: ටයිප් කරන්න

source: Warning: You are about to share data that is of a sensitive nature (Attribution / targeting data). Make sure that you are authorised to share this.
si_lk: අවවාදයයි: ඔබ සංවේදී ස්වභාවයේ දත්ත බෙදා ගැනීමට සූදානම් වේ (ආරෝපණය / ඉලක්ක දත්ත). මෙය බෙදා ගැනීමට ඔබට අවසර ඇති බව සහතික කර ගන්න.

source: My Org's Events
si_lk: මගේ සංවිධානයේ සිදුවීම්

source: All Events
si_lk: සියලුම සිදුවීම්

source: Proposal by
si_lk: විසින් යෝජනාව

source: Change requested
si_lk: වෙනස් කිරීම ඉල්ලා ඇත

source: Event creator
si_lk: සිදුවීම් නිර්මාතෘ

source: Proposed value
si_lk: යෝජිත අගය

source: Are you sure you want to propose to delete Attribute #%s?
si_lk: ඔබට Attribute #%sමකා දැමීමට යෝජනා කිරීමට අවශ්‍ය බව විශ්වාසද?

source: Propose to delete attribute
si_lk: ගුණාංගය මකා දැමීමට යෝජනා කරන්න

source: Proposal Deletion
si_lk: යෝජනාව මකා දැමීම

source: Are you sure you want to delete Proposal #%s?
si_lk: ඔබට යෝජනා #%sමැකීමට අවශ්‍ය බව විශ්වාසද?

source: Delete proposal
si_lk: යෝජනාව මකන්න

source: New Sharing Group
si_lk: නව බෙදාගැනීමේ කණ්ඩායම

source: General
si_lk: ජනරාල්

source: General tab
si_lk: සාමාන්ය ටැබ්

source: Organisations tab
si_lk: සංවිධාන පටිත්ත

source: MISP Instances
si_lk: MISP අවස්ථා

source: MISP instances tab
si_lk: MISP අවස්ථා පටිත්ත

source: Summary and Save
si_lk: සාරාංශය සහ සුරකින්න

source: Sharing group summary
si_lk: කණ්ඩායම් සාරාංශය බෙදා ගැනීම

source: Example: Multinational sharing group
si_lk: උදාහරණය: බහුජාතික බෙදාගැනීමේ කණ්ඩායම

source: Releasable to
si_lk: වෙත මුදා හැරිය හැක

source: Example: Community1, Organisation1, Organisation2
si_lk: උදාහරණය: Community1, Organisation1, Organisation2

source: A description of the sharing group.
si_lk: බෙදාගැනීමේ කණ්ඩායම පිළිබඳ විස්තරයක්.

source: Active sharing groups can be selected by users of the local instance when creating events. Generally, sharing groups received through synchronisation will have this disabled until manually enabled.
si_lk: සිදුවීම් නිර්මාණය කිරීමේදී දේශීය අවස්ථාව භාවිතා කරන්නන් විසින් සක්‍රීය බෙදාගැනීමේ කණ්ඩායම් තෝරාගත හැක. සාමාන්‍යයෙන්, සමමුහුර්තකරණය හරහා ලැබෙන කණ්ඩායම් බෙදාගැනීම අතින් සක්‍රීය වන තෙක් මෙය අක්‍රිය කර ඇත.

source: Make the sharing group selectable (active)
si_lk: බෙදාගැනීමේ කණ්ඩායම තෝරාගත හැකි කරන්න (ක්‍රියාකාරී)

source: Next page
si_lk: ඊළඟ පිටුව

source: Add local organisation(s) to the sharing group
si_lk: බෙදාගැනීමේ කණ්ඩායමට ප්‍රාදේශීය සංවිධානය(ය) එක් කරන්න

source: Add local organisation
si_lk: දේශීය සංවිධානය එකතු කරන්න

source: Add remote organisations to the sharing group
si_lk: බෙදාගැනීමේ කණ්ඩායමට දුරස්ථ සංවිධාන එක් කරන්න

source: Add remote organisation
si_lk: දුරස්ථ සංවිධානය එකතු කරන්න

source: Extend
si_lk: දිගු කරන්න

source: Previous page
si_lk: පෙර පිටුව

source: Enable roaming mode for this sharing group. Roaming mode will allow the sharing group to be passed to any instance where the remote recipient is contained in the organisation list. It is preferred to list the recipient instances instead.
si_lk: මෙම බෙදාගැනීමේ කණ්ඩායම සඳහා රෝමිං මාදිලිය සබල කරන්න. රෝමිං මාදිලිය මඟින් බෙදාගැනීමේ කණ්ඩායමට දුරස්ථ ලබන්නා සංවිධාන ලැයිස්තුවේ අඩංගු ඕනෑම අවස්ථාවකට යැවීමට ඉඩ සලසයි. ඒ වෙනුවට ලබන්නන්ගේ අවස්ථා ලැයිස්තුගත කිරීම වඩාත් සුදුසුය.

source: <b>Enable roaming mode</b> for this sharing group (pass the event to any connected instance where the sync connection is tied to an organisation contained in the SG organisation list).
si_lk: <b>මෙම බෙදාගැනීමේ කණ්ඩායම සඳහා රෝමිං මාදිලිය</b> සක්‍රීය කරන්න (SG සංවිධාන ලැයිස්තුවේ අඩංගු සංවිධානයකට සමමුහුර්ත සම්බන්ධතාවය බැඳී ඇති ඕනෑම සම්බන්ධිත අවස්ථාවකට සිදුවීම මාරු කරන්න).

source: Add instance
si_lk: උදාහරණයක් එකතු කරන්න

source: <span class="bold">General: </span>You are about to create the <span id="summarytitle" class="red bold"></span> sharing group, which is intended to be releasable to <span id="summaryreleasable" class="red bold"></span>.
si_lk: <span class="bold">සාමාන්‍ය: </span>ඔබ <span id="summarytitle" class="red bold"></span> බෙදාගැනීමේ කණ්ඩායම නිර්මාණය කිරීමට සූදානම් වන අතර එය <span id="summaryreleasable" class="red bold"></span>වෙත මුදා හැරීමට අදහස් කෙරේ.

source: Local organisations: </span>It will be visible to <span id="summarylocal" class="red bold"></span>, from which <span id="summarylocalextend" class="red bold"></span> can extend the sharing group.
si_lk: ප්‍රාදේශීය සංවිධාන: </span>එය <span id="summarylocal" class="red bold"></span>ට දෘශ්‍යමාන වනු ඇත, එයින් <span id="summarylocalextend" class="red bold"></span> ට බෙදාගැනීමේ කණ්ඩායම දීර්ඝ කළ හැක.

source: External organisations: </span>It will also be visible to <span id="summaryexternal" class="red bold"></span>, out of which <span id="summaryexternalextend" class="red bold"></span> can extend the sharing group.
si_lk: බාහිර සංවිධාන: </span>එය <span id="summaryexternal" class="red bold"></span>ට ද දෘශ්‍යමාන වනු ඇත, එයින් <span id="summaryexternalextend" class="red bold"></span> ට බෙදාගැනීමේ කණ්ඩායම දීර්ඝ කළ හැක.

source: <span class="bold">Synchronisation: </span>Furthermore, events are automatically pushed to: <span id="summaryservers" class="red bold"></span>
si_lk: <span class="bold">සමමුහුර්තකරණය: </span>තවද, සිදුවීම් ස්වයංක්‍රීයව තල්ලු කරනු ලබන්නේ: <span id="summaryservers" class="red bold"></span>

source: You can edit this information by going back to one of the previous pages, or if you agree with the above mentioned information, click Submit to create the Sharing group.
si_lk: ඔබට පෙර පිටු වලින් එකකට ආපසු යාමෙන් මෙම තොරතුරු සංස්කරණය කළ හැකිය, නැතහොත් ඉහත සඳහන් තොරතුරු සමඟ ඔබ එකඟ වන්නේ නම්, බෙදාගැනීමේ කණ්ඩායම සෑදීමට ඉදිරිපත් කරන්න ක්ලික් කරන්න.

source: Submit and create sharing group
si_lk: ඉදිරිපත් කර බෙදාගැනීමේ කණ්ඩායමක් සාදන්න

source: Local instance
si_lk: දේශීය උදාහරණය

source: <span class="bold">General: </span>You are about to create the <span id="summarytitle" class="red bold"></span> sharing group, which is intended to be releasable to <span id="summaryreleasable" class="red bold"></span>. </p> <p id="localText"><span class="bold">Local organisations: </span>It will be visible to <span id="summarylocal" class="red bold"></span>, from which <span id="summarylocalextend" class="red bold"></span> can extend the sharing group. </p> <p id="externalText"><span class="bold">External organisations: </span>It will also be visible to <span id="summaryexternal" class="red bold"></span>, out of which <span id="summaryexternalextend" class="red bold"></span> can extend the sharing group.
si_lk: <span class="bold">සාමාන්‍ය: </span>ඔබ <span id="summarytitle" class="red bold"></span> බෙදාගැනීමේ කණ්ඩායම නිර්මාණය කිරීමට සූදානම් වන අතර එය <span id="summaryreleasable" class="red bold"></span>වෙත මුදා හැරීමට අදහස් කෙරේ. </p> <p id="localText"><span class="bold">ප්‍රාදේශීය සංවිධාන: </span>එය <span id="summarylocal" class="red bold"></span>ට දෘශ්‍යමාන වනු ඇත, එයින් <span id="summarylocalextend" class="red bold"></span> හට බෙදාගැනීමේ කණ්ඩායම දීර්ඝ කළ හැක. </p> <p id="externalText"><span class="bold">බාහිර සංවිධාන: </span>එය <span id="summaryexternal" class="red bold"></span>ට ද දෘශ්‍යමාන වනු ඇත, එයින් <span id="summaryexternalextend" class="red bold"></span> ට බෙදා ගැනීමේ කණ්ඩායම දීර්ඝ කළ හැකිය.

source: Synchronisation: </span>Furthermore, events are automatically pushed to: <span id="summaryservers" class="red bold"></span>
si_lk: සමමුහුර්තකරණය: </span>තවද, සිදුවීම් ස්වයංක්‍රීයව තල්ලු කරනු ලබන්නේ: <span id="summaryservers" class="red bold"></span>

source: Active Sharing Groups
si_lk: ක්රියාකාරී බෙදාගැනීමේ කණ්ඩායම්

source: Passive Sharing Groups
si_lk: නිෂ්ක්‍රීය බෙදාගැනීමේ කණ්ඩායම්

source: Creator
si_lk: නිර්මාතෘ

source: Org count
si_lk: ආයතන ගණන

source: Organisations:
si_lk: ආයතන:

source: Distribution List
si_lk: බෙදා හැරීම ලැයිස්තුව

source: Are you sure you want to delete the sharing group?
si_lk: ඔබට බෙදාගැනීමේ කණ්ඩායම මැකීමට අවශ්‍ය බව විශ්වාසද?

source: Delete Sharing Group
si_lk: බෙදාගැනීමේ කණ්ඩායම මකන්න

source: Sharing Group %s
si_lk: බෙදාගැනීමේ කණ්ඩායම %s

source: Synced by
si_lk: විසින් සමමුහුර්ත කර ඇත

source: Is local
si_lk: දේශීය වේ

source: Can extend
si_lk: දිගු කළ හැකිය

source: Instances
si_lk: අවස්ථා

source: Quick Search
si_lk: ඉක්මන් සෙවුම

source: Host
si_lk: සත්කාරක

source: Port
si_lk: වරාය

source: Skip Proxy
si_lk: ප්‍රොක්සි මඟ හරින්න

source: Skip SSL
si_lk: SSL මඟ හරින්න

source: Restricted to
si_lk: වෙත සීමා කර ඇත

source: SightingDB index
si_lk: SightingDB දර්ශකය

source: SightingDB is an alternate sighting database that MISP interconnects with. Configure connections to sighting databases below.
si_lk: SightingDB යනු MISP අන්තර් සම්බන්ධිත විකල්ප දර්ශන දත්ත ගබඩාවකි. පහත දත්ත සමුදායන් බැලීම සඳහා සම්බන්ධතා වින්‍යාස කරන්න.

source: Are you sure you want to remove the connection to this SightingDB?
si_lk: ඔබට මෙම SightingDB වෙත සම්බන්ධතාවය ඉවත් කිරීමට අවශ්‍ය බව විශ්වාසද?

source: honeypot, IDS sensor id, SIEM,…
si_lk: honeypot, IDS සංවේදක id, SIEM,…

source: Sighting date
si_lk: බැලීමේ දිනය

source: Sighting details
si_lk: බැලීමේ විස්තර

source: Graph
si_lk: ප්‍රස්තාරය

source: My org
si_lk: මගේ ආයතනය

source: Delete sighting
si_lk: දර්ශනය මකන්න

source: Attribute ID
si_lk: ගුණාංග හැඳුනුම්පත

source: Add Sighting
si_lk: දර්ශනය එකතු කරන්න

source: Add%s sighting (%s)?
si_lk: %s පෙනීම (%s) එක් කරන්නද?

source: false-positive
si_lk: ව්යාජ-ධනාත්මක

source: Remove Sighting
si_lk: පෙනීම ඉවත් කරන්න

source: Remove sighting (%s)?
si_lk: පෙනීම ඉවත් කරන්න (%s)?

source: Remove sighting
si_lk: පෙනීම ඉවත් කරන්න

source: Edit Tag Collection
si_lk: ටැග් එකතුව සංස්කරණය කරන්න

source: Visible to all orgs
si_lk: සියලුම ආයතන සඳහා දෘශ්‍යමාන වේ

source: Paste tag collection data
si_lk: ටැග් එකතු කිරීමේ දත්ත අලවන්න

source: Paste a MISP tag collection JSON below to add tag collections.
si_lk: ටැග් එකතු කිරීම් එක් කිරීමට පහත MISP ටැග් එකතුවක් JSON අලවන්න.

source: Tag collection JSON
si_lk: JSON ටැග් එකතුව

source: Restrict tagging to org
si_lk: org වෙත ටැග් කිරීම සීමා කරන්න

source: Restrict tagging to user
si_lk: පරිශීලකයාට ටැග් කිරීම සීමා කරන්න

source: Enforce this tag to be used as local only
si_lk: මෙම ටැගය දේශීය ලෙස පමණක් භාවිත කිරීමට බලාත්මක කරන්න

source: Simple
si_lk: සරල

source: Advanced
si_lk: උසස්

source: Exportable
si_lk: අපනයනය කළ හැකි

source: Hidden
si_lk: සැඟවී ඇත

source: Restricted to org
si_lk: සංවිධානයට සීමා කර ඇත

source: Restricted to user
si_lk: පරිශීලකයාට සීමා කර ඇත

source: Taxonomy
si_lk: වර්ගීකරණය

source: Tagged events
si_lk: ටැග් කළ සිදුවීම්

source: Tagged attributes
si_lk: ටැග් කළ ගුණාංග

source: Favourite
si_lk: ප්රියතම

source: View graph
si_lk: ප්රස්තාරය බලන්න

source: Are you sure you want to delete the Tag?
si_lk: ඔබට ටැගය මැකීමට අවශ්‍ය බව විශ්වාසද?

source: Delete tag
si_lk: ටැගය මකන්න

source: Here you can schedule pre-defined tasks that will be executed every x hours. You can alter the date and time of the next scheduled execution and the frequency at which it will be repeated (expressed in hours). If you set the frequency to 0 then the task will not be repeated. To change and of the above mentioned settings just click on the appropriate field and hit update all when you are done editing the scheduled tasks.
si_lk: මෙහිදී ඔබට සෑම x පැයකට වරක් ක්‍රියාත්මක වන පූර්ව-නිර්චිත කාර්යයන් උපලේඛනගත කළ හැක. ඔබට මීළඟ කාලසටහන්ගත ක්‍රියාත්මක කිරීමේ දිනය සහ වේලාව සහ එය පුනරාවර්තනය වන සංඛ්‍යාතය (පැය වලින් ප්‍රකාශිත) වෙනස් කළ හැක. ඔබ සංඛ්‍යාතය 0 ලෙස සකසන්නේ නම්, කාර්යය නැවත සිදු නොවේ. ඉහත සඳහන් කළ සැකසුම් වෙනස් කිරීමට සහ අදාළ ක්ෂේත්‍රය මත ක්ලික් කර ඔබ නියමිත කාර්යයන් සංස්කරණය කර අවසන් වූ පසු යාවත්කාලීන සියල්ල ඔබන්න.

source: Warning: Scheduled tasks come with a lot of caveats and little in regards of customisations / granularity. You can instead simply create cron jobs out of the console commands as described here:
si_lk: අවවාදයයි: උපලේඛනගත කාර්යයන් බොහෝ අනතුරු ඇඟවීම් සහ අභිරුචිකරණයන් / කැටිති සම්බන්ධයෙන් සුළු වශයෙන් පැමිණේ. ඒ වෙනුවට ඔබට මෙහි විස්තර කර ඇති පරිදි කොන්සෝල විධාන වලින් ක්‍රෝන් රැකියා නිර්මාණය කළ හැකිය:

source: Frequency (h)
si_lk: සංඛ්‍යාතය (h)

source: Set frequency timer for scheduled task
si_lk: නියමිත කාර්යය සඳහා සංඛ්‍යාත ටයිමරය සකසන්න

source: Set scheduled time for task
si_lk: කාර්යය සඳහා නියමිත වේලාව සකසන්න

source: Update all
si_lk: සියල්ල යාවත්කාලීන කරන්න

source: Confirm creation of Taxonomy Tag
si_lk: වර්ගීකරණ ටැගය නිර්මාණය කිරීම තහවුරු කරන්න

source: Confirm enabling Taxonomy Tag
si_lk: Taxonomy Tag සබල කිරීම තහවුරු කරන්න

source: Tag `%s` will be %s.
si_lk: ටැගය ` %s%sවනු ඇත.

source: created
si_lk: නිර්මාණය කළා

source: Confirm disabling Taxonomy Tag
si_lk: Taxonomy Tag අක්‍රිය කිරීම තහවුරු කරන්න

source: Tag `%s` will be disabled.
si_lk: ටැගය `%sඅක්‍රිය වනු ඇත.

source: Active Tags
si_lk: ක්රියාකාරී ටැග්

source: enable all
si_lk: සියල්ල සක්රිය කරන්න

source: Enable all tags
si_lk: සියලුම ටැග් සබල කරන්න

source: Are you sure you want to enable every tag associated to this taxonomy?
si_lk: ඔබට මෙම වර්ගීකරණයට සම්බන්ධ සෑම ටැගයක්ම සබල කිරීමට අවශ්‍ය බව විශ්වාසද?

source: Are you sure you want to enable this taxonomy library?
si_lk: ඔබට මෙම වර්ගීකරණ පුස්තකාලය සබල කිරීමට අවශ්‍ය බව විශ්වාසද?

source: Are you sure you want to disable this taxonomy library?
si_lk: ඔබට මෙම වර්ගීකරණ පුස්තකාලය අබල කිරීමට අවශ්‍ය බව විශ්වාසද?

source: Delete taxonomy
si_lk: වර්ගීකරණය මකන්න

source: View taxonomy
si_lk: වර්ගීකරණය බලන්න

source: Disable taxonomy
si_lk: වර්ගීකරණය අක්‍රීය කරන්න

source: Enable taxonomy
si_lk: වර්ගීකරණය සබල කරන්න

source: Taxonomy Tags
si_lk: වර්ගීකරණ ටැග්

source: Taxonomy Deletion
si_lk: වර්ගීකරණය මකා දැමීම

source: Are you sure you want to delete Taxonomy #%s?<br /> Associated tags will not be removed. You can reload the taxonomy at any time by updating your taxonomies.
si_lk: ඔබට වර්ගීකරණය #%sමැකීමට අවශ්‍ය බව විශ්වාසද?<br /> ආශ්‍රිත ටැග් ඉවත් නොකෙරේ. ඔබේ වර්ගීකරණය යාවත්කාලීන කිරීමෙන් ඔබට ඕනෑම වේලාවක වර්ගීකරණය නැවත පූරණය කළ හැක.

source: Create Tags
si_lk: ටැග් සාදන්න

source: Are you sure you want to create / update all selected tags?
si_lk: තෝරාගත් සියලුම ටැග් සෑදීමට / යාවත්කාලීන කිරීමට ඔබට අවශ්‍ය බව ඔබට විශ්වාසද?

source: Create / update all selected taxonomy entries as tags
si_lk: තෝරාගත් සියලුම වර්ගීකරණ ඇතුළත් කිරීම් ටැග් ලෙස සාදන්න / යාවත්කාලීන කරන්න

source: Create / update all taxonomy entries as tags
si_lk: සියලුම වර්ගීකරණ ඇතුළත් කිරීම් ටැග් ලෙස සාදන්න / යාවත්කාලීන කරන්න

source: Hide Tags
si_lk: ටැග් සඟවන්න

source: Are you sure you want to hide all selected tags?
si_lk: ඔබට තෝරාගත් සියලුම ටැග් සැඟවීමට අවශ්‍ය බව විශ්වාසද?

source: Hide all selected tags
si_lk: තෝරාගත් සියලුම ටැග් සඟවන්න

source: Unhide Tags
si_lk: ටැග් සඟවන්න

source: Are you sure you want to unhide all selected tags?
si_lk: ඔබට තෝරාගත් සියලුම ටැග් සැඟවීමට අවශ්‍ය බව විශ්වාසද?
