Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: Enabling this setting will require users to submit their current password on any edits to their profile (including a triggered password change). For administrators, the confirmation will be required when changing the profile of any user. Could potentially mitigate an attacker trying to change a compromised user's password in order to establish persistance, however, enabling this feature will be highly annoying to users.
si_lk: මෙම සැකසුම සක්‍රීය කිරීම මඟින් පරිශීලකයින්ට ඔවුන්ගේ පැතිකඩෙහි (ප්‍රේරණය කරන ලද මුරපද වෙනස් කිරීමක් ඇතුළුව) ඕනෑම සංස්කරණයක් සඳහා ඔවුන්ගේ වත්මන් මුරපදය ඉදිරිපත් කිරීමට අවශ්‍ය වනු ඇත. පරිපාලකයින් සඳහා, ඕනෑම පරිශීලකයෙකුගේ පැතිකඩ වෙනස් කිරීමේදී තහවුරු කිරීම අවශ්ය වනු ඇත. ස්ථීරභාවය තහවුරු කර ගැනීම සඳහා අවදානමට ලක් වූ පරිශීලක මුරපදයක් වෙනස් කිරීමට උත්සාහ කරන ප්‍රහාරකයෙකු අවම කර ගත හැකිය, කෙසේ වෙතත්, මෙම විශේෂාංගය සක්‍රීය කිරීම පරිශීලකයින්ට බෙහෙවින් කරදරකාරී වනු ඇත.

source: Enabling this setting will sanitise the contents of an attribute on a soft delete
si_lk: මෙම සැකසුම සබල කිරීම මෘදු මකාදැමීමකදී උපලක්ෂණයක අන්තර්ගතය පිරිසිදු කරයි

source: Enabling this setting will block the organisation index from being visible to anyone besides site administrators on the current instance. Keep in mind that users can still see organisations that produce data via events, proposals, event history log entries, etc.
si_lk: මෙම සැකසුම සක්‍රීය කිරීමෙන් ආයතන දර්ශකය වත්මන් අවස්ථාවෙහි අඩවි පරිපාලකයන්ට හැර වෙනත් කිසිවකුට දෘශ්‍යමාන වීම අවහිර කරනු ඇත. සිදුවීම්, යෝජනා, සිදුවීම් ඉතිහාස ලොග් ඇතුළත් කිරීම් ආදිය හරහා දත්ත නිපදවන ආයතන පරිශීලකයින්ට තවමත් දැකිය හැකි බව මතක තබා ගන්න.

source: Enabling this setting will block the organisation list from being visible in sharing group besides user with sharing group permission.
si_lk: මෙම සැකසුම සක්‍රිය කිරීමෙන් කණ්ඩායම් අවසරය බෙදාගැනීමේ පරිශීලකයාට අමතරව බෙදාගැනීමේ කණ්ඩායම තුළ දෘශ්‍යමාන වීම සංවිධාන ලැයිස්තුව අවහිර කරනු ඇත.

source: Disabling this setting will allow the creation/modification of local feeds (as opposed to network feeds). Enabling this setting will restrict feed sources to be network based only. When disabled, keep in mind that a malicious site administrator could get access to any arbitrary file on the system that the apache user has access to. Make sure that proper safe-guards are in place. This setting can only be modified via the CLI.
si_lk: මෙම සැකසුම අක්‍රිය කිරීමෙන් ප්‍රාදේශීය සංග්‍රහ (ජාල සංග්‍රහවලට ප්‍රතිවිරුද්ධව) සෑදීමට/වෙනස් කිරීමට ඉඩ දෙනු ඇත. මෙම සැකසුම සබල කිරීමෙන් පෝෂක මූලාශ්‍ර ජාල පදනම් වීම පමණක් සීමා කරනු ඇත. අබල කළ විට, apache පරිශීලකයාට ප්‍රවේශය ඇති පද්ධතියේ ඇති ඕනෑම අත්තනෝමතික ගොනුවකට අනිෂ්ට අඩවි පරිපාලකයෙකුට ප්‍රවේශ විය හැකි බව මතක තබා ගන්න. නිසි ආරක්‍ෂාව ඇති බවට වග බලා ගන්න. මෙම සැකසුම වෙනස් කළ හැක්කේ CLI හරහා පමණි.

source: Allows passing the API key via the named url parameter "apikey" - highly recommended not to enable this, but if you have some dodgy legacy tools that cannot pass the authorization header it can work as a workaround. Again, only use this as a last resort.
si_lk: නම් කරන ලද url පරාමිතිය "apikey" හරහා API යතුර යැවීමට ඉඩ දෙයි - මෙය සක්‍රීය නොකිරීමට බෙහෙවින් නිර්දේශ කර ඇත, නමුත් ඔබට අවසර ශීර්ෂය පසු කළ නොහැකි සමහර ඩොජි ලෙගසි මෙවලම් තිබේ නම් එය විසඳුමක් ලෙස ක්‍රියා කළ හැක. නැවතත්, මෙය අවසාන විසඳුම ලෙස පමණක් භාවිතා කරන්න.

source: You have enabled the passing of API keys via URL parameters. This is highly recommended against, do you really want to reveal APIkeys in your logs?...
si_lk: ඔබ URL පරාමිති හරහා API යතුරු යැවීම සබල කර ඇත. මෙය බෙහෙවින් නිර්දේශිතයි, ඔබට ඇත්තටම ඔබගේ ලොග වල APIkeys හෙළි කිරීමට අවශ්‍යද?...

source: Allow cross-origin requests to this instance, matching origins given in Security.cors_origins. Set to false to totally disable
si_lk: Security.cors_origins හි ලබා දී ඇති සම්භවයට ගැළපෙන මෙම අවස්ථාවට හරස් ප්‍රභව ඉල්ලීම්වලට ඉඩ දෙන්න. සම්පුර්ණයෙන්ම අබල කිරීමට අසත්‍ය ලෙස සකසන්න

source: Set the origins from which MISP will allow cross-origin requests. Useful for external integration. Comma seperate if you need more than one.
si_lk: MISP හරස් ප්‍රභවය ඉල්ලීම්වලට ඉඩ දෙන මූලාරම්භය සකසන්න. බාහිර ඒකාබද්ධ කිරීම සඳහා ප්රයෝජනවත් වේ. ඔබට එකකට වඩා අවශ්‍ය නම් කොමාව වෙන් කරන්න.

source: Enable this setting to create verbose logs of synced event data for debugging reasons. Logs are saved in your MISP directory's app/files/scripts/tmp/ directory.
si_lk: නිදොස් කිරීමේ හේතූන් සඳහා සමමුහුර්ත වූ සිදුවීම් දත්තවල වාචික ලඝු-සටහන් සෑදීමට මෙම සැකසීම සබල කරන්න. ලොග ඔබගේ MISP බහලුමේ යෙදුම/ගොනු/scripts/tmp/ බහලුම තුල සුරැකේ.

source: Enables the functionality to monitor users - thereby enabling all logging functionalities for a single user. This functionality is intrusive and potentially heavy on the system - use it with care.
si_lk: පරිශීලකයන් නිරීක්ෂණය කිරීමට ක්‍රියාකාරීත්වය සක්‍රීය කරයි - එමගින් තනි පරිශීලකයෙකු සඳහා සියලුම ලොග් කිරීමේ ක්‍රියාකාරකම් සක්‍රීය කරයි. මෙම ක්‍රියාකාරීත්වය ආක්‍රමණශීලී වන අතර පද්ධතියට බර විය හැකිය - එය ප්‍රවේශමෙන් භාවිතා කරන්න.

source: When enabled, logged in username will be included in X-Username HTTP response header. This is useful for request logging on webserver/proxy side.
si_lk: සබල කළ විට, පුරනය වී ඇති පරිශීලක නාමය X-පරිශීලක නාමය HTTP ප්‍රතිචාර ශීර්ෂයට ඇතුළත් වේ. මෙය webserver/proxy පැත්තෙන් ඉල්ලීම් ලොග් වීම සඳහා ප්‍රයෝජනවත් වේ.

source: Encryption key used to store sensitive data (like authkeys) in database encrypted. If empty, data are stored unecrypted. Required PHP 7.1 or newer.
si_lk: සංකේතනය කරන ලද දත්ත සමුදාය තුළ සංවේදී දත්ත (authkeys වැනි) ගබඩා කිරීමට භාවිතා කරන සංකේතාංකන යතුර. හිස් නම්, දත්ත සංකේතනය නොකර ගබඩා කෙරේ. අවශ්‍ය PHP 7.1 හෝ ඊට වැඩි.

source: Encryption key must be at least 32 chars long.
si_lk: සංකේතාංකන යතුර අවම වශයෙන් අක්ෂර 32 ක් දිග විය යුතුය.

source: The number of tries a user can try to login and fail before the bruteforce protection kicks in.
si_lk: බෲට්ෆෝර්ස් ආරක්ෂණය ආරම්භ වීමට පෙර පරිශීලකයෙකුට පුරනය වීමට උත්සාහ කළ හැකි උත්සාහයන් ගණන අසාර්ථක වේ.

source: The duration (in seconds) of how long the user will be locked out when the allowed number of login attempts are exhausted.
si_lk: අවසර ලත් පුරනය වීමේ උත්සාහයන් ගණන අවසන් වූ විට පරිශීලකයා කොපමණ කාලයක් අගුලු දමා තිබේද යන්නෙහි කාලසීමාව (තත්පර කිහිපයකින්).

source: Set to true to automatically regenerate sessions after x number of requests. This might lead to the user getting de-authenticated and is frustrating in general, so only enable it if you really need to regenerate sessions. (Not recommended)
si_lk: ඉල්ලීම් x ගණනකට පසු සැසි ස්වයංක්‍රීයව ප්‍රතිජනනය කිරීමට සත්‍ය ලෙස සකසන්න. මෙය පරිශීලකයා සත්‍යාපනය කිරීමට හේතු විය හැකි අතර පොදුවේ කලකිරීමට පත් කරයි, එබැවින් ඔබට සැසි නැවත උත්පාදනය කිරීමට අවශ්‍ය නම් පමණක් එය සබල කරන්න. (නිර්දේශිත නොවේ)

source: Set to true to check for the user agent string in each request. This can lead to occasional logouts (not recommended).
si_lk: සෑම ඉල්ලීමකම පරිශීලක නියෝජිත තන්තුව පරීක්ෂා කිරීමට සත්‍ය ලෙස සකසන්න. මෙය ඉඳහිට ඉවත් වීමට හේතු විය හැක (නිර්දේශ නොකෙරේ).

source: The session type used by MISP. The default setting is php, which will use the session settings configured in php.ini for the session data (supported options: php, database). The recommended option is php and setting your PHP up to use redis sessions via your php.ini. Just add 'session.save_handler = redis' and "session.save_path = 'tcp://localhost:6379'" (replace the latter with your redis connection) to
si_lk: MISP විසින් භාවිතා කරන සැසි වර්ගය. පෙරනිමි සැකසුම php වේ, එය සැසි දත්ත සඳහා php.ini හි වින්‍යාස කර ඇති සැසි සැකසුම් භාවිතා කරනු ඇත (සහාය දක්වන විකල්ප: php, දත්ත සමුදාය). නිර්දේශිත විකල්පය php වන අතර ඔබේ php.ini හරහා redis සැසි භාවිතා කිරීමට ඔබේ PHP සැකසීම. 'session.save_handler = redis' සහ "session.save_path = 'tcp://localhost:6379'" (දෙවැන්න ඔබේ redis සම්බන්ධතාවය සමඟ ප්‍රතිස්ථාපනය කරන්න) එකතු කරන්න.

source: The timeout duration of sessions (in MINUTES). 0 does not mean infinite for the PHP session handler, instead sessions will invalidate immediately.
si_lk: සැසිවල කල් ඉකුත් වීමේ කාලය (මිනිත්තු වලින්). 0 යනු PHP සැසි හසුරුවන්නා සඳහා අනන්ත නොවේ, ඒ වෙනුවට සැසි වහාම අවලංගු වේ.

source: The expiration of the cookie (in MINUTES). The session timeout gets refreshed frequently, however the cookies do not. Generally it is recommended to have a much higher cookie_timeout than timeout.
si_lk: කුකියේ කල් ඉකුත්වීම (මිනිත්තු වලින්). සැසි කල් ඉකුත්වීම නිතර නැවුම් වේ, කෙසේ වෙතත් කුකීස් එසේ නොවේ. සාමාන්‍යයෙන් කල් ඉකුත්වීමට වඩා වැඩි කුකී_කාලයක් තිබීම නිර්දේශ කෙරේ.

source: The default policy action for the values added to the RPZ.
si_lk: RPZ වෙත එක් කළ අගයන් සඳහා පෙරනිමි ප්‍රතිපත්ති ක්‍රියාව.

source: The default walled garden used by the RPZ export if the Local-Data policy setting is picked for the export.
si_lk: අපනයනය සඳහා දේශීය-දත්ත ප්‍රතිපත්ති සැකසුම තෝරා ගන්නේ නම්, RPZ අපනයනය විසින් භාවිතා කරන පෙරනිමි බිත්ති සහිත උද්‍යානය.

source: The serial in the SOA portion of the zone file. (numeric, best practice is yyyymmddrr where rr is the two digit sub-revision of the file. $date will automatically get converted to the current yyyymmdd, so $date00 is a valid setting). Setting it to $time will give you an unixtime-based serial (good then you need more than 99 revisions per day).
si_lk: කලාප ගොනුවේ SOA කොටසෙහි ඇති අනුක්‍රමික. (සංඛ්‍යාත්මක, හොඳම භාවිතය yyyymmddrr වන අතර rr යනු ගොනුවේ ඉලක්කම් දෙකේ උප-සංශෝධනය වේ. $date ස්වයංක්‍රීයව වත්මන් yyyymmdd වෙත පරිවර්තනය වනු ඇත, එබැවින් $date00 වලංගු සැකසුමකි). එය $time ලෙස සැකසීමෙන් ඔබට unixtime-පාදක අනුක්‍රමික (හොඳයි එවිට ඔබට දිනකට සංශෝධන 99කට වඩා අවශ්‍ය වේ).

source: The refresh specified in the SOA portion of the zone file. (in seconds, or shorthand duration such as 15m)
si_lk: කලාප ගොනුවේ SOA කොටසෙහි දක්වා ඇති නැවුම් කිරීම. (තත්පර වලින්, හෝ කෙටිකතා කාල සීමාව 15m වැනි)

source: The retry specified in the SOA portion of the zone file. (in seconds, or shorthand duration such as 15m)
si_lk: කලාප ගොනුවේ SOA කොටසෙහි සඳහන් කර ඇති නැවත උත්සාහය. (තත්පර වලින්, හෝ කෙටිකතා කාල සීමාව 15m වැනි)

source: The expiry specified in the SOA portion of the zone file. (in seconds, or shorthand duration such as 15m)
si_lk: කලාප ගොනුවේ SOA කොටසෙහි නිශ්චිතව දක්වා ඇති කල් ඉකුත්වීම. (තත්පර වලින්, හෝ කෙටිකතා කාල සීමාව 15m වැනි)

source: The minimum TTL specified in the SOA portion of the zone file. (in seconds, or shorthand duration such as 15m)
si_lk: කලාප ගොනුවේ SOA කොටසෙහි සඳහන් කර ඇති අවම TTL. (තත්පර වලින්, හෝ කෙටිකතා කාල සීමාව 15m වැනි)

source: The TTL of the zone file. (in seconds, or shorthand duration such as 15m)
si_lk: කලාප ගොනුවේ TTL. (තත්පර වලින්, හෝ කෙටිකතා කාල සීමාව 15m වැනි)

source: Nameserver
si_lk: නාම සේවාදායකය

source: Alternate nameserver
si_lk: විකල්ප නාම සේවාදායකය

source: The e-mail address specified in the SOA portion of the zone file.
si_lk: කලාප ගොනුවේ SOA කොටසෙහි නිශ්චිතව දක්වා ඇති විද්‍යුත් තැපැල් ලිපිනය.

source: Enables or disables the Kafka pub feature of MISP. Make sure that you install the requirements for the plugin to work. Refer to the installation instructions for more information.
si_lk: MISP හි Kafka pub විශේෂාංගය සබල කරයි හෝ අබල කරයි. ඔබ ප්ලගිනය ක්‍රියා කිරීමට අවශ්‍යතා ස්ථාපනය කර ඇති බවට වග බලා ගන්න. වැඩි විස්තර සඳහා ස්ථාපන උපදෙස් බලන්න.

source: A comma separated list of Kafka bootstrap brokers
si_lk: කෆ්කා බූට්ස්ට්‍රැප් තැරැව්කරුවන්ගේ කොමාවෙන් වෙන් කළ ලැයිස්තුවක්

source: A path to an ini file with configuration options to be passed to rdkafka. Section headers in the ini file will be ignored.
si_lk: rdkafka වෙත ලබා දිය යුතු වින්‍යාස විකල්ප සහිත ini ගොනුවකට මාර්ගයක්. ini ගොනුවේ අංශ ශීර්ෂ නොසලකා හරිනු ඇත.

source: Enable this setting to include the base64 encoded payloads of malware-samples/attachments in the output.
si_lk: ප්‍රතිදානය තුළ අනිෂ්ට මෘදුකාංග-සාම්පල/ඇමිණුම්වල මූලික64 කේතනය කළ ගෙවුම් පැටවීම් ඇතුළත් කිරීමට මෙම සැකසුම සබල කරන්න.

source: Enables or disables the publishing of any event creations/edits/deletions.
si_lk: ඕනෑම සිදුවීම් නිර්මාණ/සංස්කරණ/මකාදැමීම් ප්‍රකාශනය සක්‍රීය හෝ අක්‍රීය කරයි.

source: Topic for publishing event creations/edits/deletions.
si_lk: සිදුවීම් නිර්මාණ/සංස්කරණ/මකාදැමීම් ප්‍රකාශනය සඳහා මාතෘකාව.

source: If enabled it will publish to Kafka the event at the time that the event gets published in MISP. Event actions (creation or edit) will not be published to Kafka.
si_lk: සක්‍රීය කර ඇත්නම්, එය MISP හි සිදුවීම ප්‍රකාශයට පත් කරන අවස්ථාවේදී එය Kafka වෙත ප්‍රකාශනය කරනු ඇත. සිදුවීම් ක්‍රියා (නිර්මාණය හෝ සංස්කරණය) Kafka වෙත ප්‍රකාශනය නොකෙරේ.

source: Topic for publishing event information on publish.
si_lk: ප්‍රකාශනයේ සිදුවීම් තොරතුරු ප්‍රකාශනය සඳහා මාතෘකාව.

source: Enables or disables the publishing of any object creations/edits/deletions.
si_lk: ඕනෑම වස්තු නිර්මාණයක්/සංස්කරණයක්/මැකීමක් ප්‍රකාශනය කිරීම සබල කරයි හෝ අක්‍රීය කරයි.

source: Topic for publishing object creations/edits/deletions.
si_lk: වස්තු නිර්මාණ/සංස්කරණ/මකාදැමීම් ප්‍රකාශනය සඳහා මාතෘකාව.

source: Enables or disables the publishing of any object reference creations/deletions.
si_lk: ඕනෑම වස්තුවක් යොමු නිර්මාණ/මකාදැමීම් ප්‍රකාශනය සක්‍රීය හෝ අක්‍රීය කරයි.

source: Topic for publishing object reference creations/deletions.
si_lk: වස්තු යොමු නිර්මාණ/මකාදැමීම් ප්‍රකාශනය සඳහා මාතෘකාව.

source: Enables or disables the publishing of any attribute creations/edits/soft deletions.
si_lk: ඕනෑම උපලක්ෂණ නිර්මාණ/සංස්කරණ/මෘදු මකාදැමීම් ප්‍රකාශනය සක්‍රීය හෝ අබල කරයි.

source: Topic for publishing attribute creations/edits/soft deletions.
si_lk: ගුණාංග නිර්මාණ/සංස්කරණ/මෘදු මකාදැමීම් ප්‍රකාශනය සඳහා මාතෘකාව.

source: Enables or disables the publishing of any proposal creations/edits/deletions.
si_lk: ඕනෑම යෝජනා නිර්මාණ/සංස්කරණ/මකාදැමීම් ප්‍රකාශනය සක්‍රීය හෝ අක්‍රීය කරයි.

source: Topic for publishing proposal creations/edits/deletions.
si_lk: යෝජනා නිර්මාණ/සංස්කරණ/මකාදැමීම් ප්‍රකාශනය සඳහා මාතෘකාව.

source: Enables or disables the publishing of any tag creations/edits/deletions as well as tags being attached to / detached from various MISP elements.
si_lk: විවිධ MISP මූලද්‍රව්‍ය වෙත අමුණා ඇති / වෙන් කර ඇති ඕනෑම ටැග් නිර්මාණ/සංස්කරණ/මකාදැමීම් මෙන්ම ටැග් ප්‍රකාශනය කිරීම සබල කරයි හෝ අබල කරයි.

source: Topic for publishing tag creations/edits/deletions as well as tags being attached to / detached from various MISP elements.
si_lk: ටැග් නිර්මාණ/සංස්කරණ/මකාදැමීම් මෙන්ම විවිධ MISP මූලද්‍රව්‍ය වෙත ඇමිණෙන / වෙන් කරන ලද ටැග් ප්‍රකාශනය සඳහා මාතෘකාව.

source: Enables or disables the publishing of new sightings.
si_lk: නව දර්ශන පළ කිරීම සබල කරයි හෝ අබල කරයි.

source: Topic for publishing sightings.
si_lk: දර්ශන ප්‍රකාශනය සඳහා මාතෘකාව.

source: Enables or disables the publishing of new/modified users.
si_lk: නව/වෙනස් කළ පරිශීලකයන්ගේ ප්‍රකාශනය සක්‍රීය හෝ අක්‍රීය කරයි.

source: Topic for publishing new/modified users.
si_lk: නව/වෙනස් කළ පරිශීලකයන් ප්‍රකාශනය සඳහා මාතෘකාව.

source: Enables or disables the publishing of new/modified organisations.
si_lk: නව/වෙනස් කළ සංවිධාන ප්‍රකාශනය සක්‍රීය හෝ අක්‍රීය කරයි.

source: Topic for publishing new/modified organisations.
si_lk: නව/වෙනස් කළ සංවිධාන ප්‍රකාශනය සඳහා මාතෘකාව.

source: Enables or disables the publishing of log entries. Keep in mind, this can get pretty verbose depending on your logging settings.
si_lk: ලඝු සටහන් ප්‍රකාශනය සක්‍රීය හෝ අක්‍රීය කරයි. මතක තබා ගන්න, මෙය ඔබගේ ලොග් සැකසුම් මත පදනම්ව ඉතා වාචික විය හැක.

source: Topic for publishing log entries.
si_lk: ලඝු සටහන් ප්‍රකාශනය සඳහා මාතෘකාව.

source: Enables or disables the pub/sub feature of MISP. Make sure that you install the requirements for the plugin to work. Refer to the installation instructions for more information.
si_lk: MISP හි පබ්/උප විශේෂාංගය සබල කරයි හෝ අබල කරයි. ඔබ ප්ලගිනය ක්‍රියා කිරීමට අවශ්‍යතා ස්ථාපනය කර ඇති බවට වග බලා ගන්න. වැඩි විස්තර සඳහා ස්ථාපන උපදෙස් බලන්න.

source: The host that the pub/sub feature will use.
si_lk: පබ්/උප විශේෂාංගය භාවිතා කරන සත්කාරක.

source: The port that the pub/sub feature will use.
si_lk: පබ්/උප විශේෂාංගය භාවිතා කරන වරාය.

source: The username that client need to use to connect to ZeroMQ.
si_lk: ZeroMQ වෙත සම්බන්ධ වීමට සේවාදායකයා භාවිතා කිරීමට අවශ්‍ය පරිශීලක නාමය.

source: The password that client need to use to connect to ZeroMQ.
si_lk: ZeroMQ වෙත සම්බන්ධ වීමට සේවාදායකයා භාවිතා කිරීමට අවශ්‍ය මුරපදය.

source: Location of the Redis db used by MISP and the Python PUB script to queue data to be published.
si_lk: ප්‍රකාශනය කිරීමට දත්ත පෝලිම් කිරීමට MISP සහ Python PUB ස්ක්‍රිප්ට් භාවිතා කරන Redis db හි පිහිටීම.

source: The port that Redis is listening on.
si_lk: රෙඩිස් සවන් දෙන වරාය.

source: The password, if set for Redis.
si_lk: මුරපදය, Redis සඳහා සකසා ඇත්නම්.

source: The database to be used for queuing messages for the pub/sub functionality.
si_lk: පබ්/උප ක්‍රියාකාරීත්වය සඳහා පණිවිඩ පෝලිම් කිරීම සඳහා භාවිත කළ යුතු දත්ත සමුදාය.

source: The namespace to be used for queuing messages for the pub/sub functionality.
si_lk: පබ්/උප ක්‍රියාකාරීත්වය සඳහා පණිවිඩ පෝලිම් තැබීම සඳහා භාවිත කළ යුතු නාම අවකාශය.

source: Enables or disables the publishing of new sightings to the ZMQ pubsub feed.
si_lk: ZMQ පබ්සබ් සංග්‍රහයට නව දර්ශන ප්‍රකාශනය සබල කරයි හෝ අබල කරයි.

source: Enables or disables the publishing of new/modified users to the ZMQ pubsub feed.
si_lk: ZMQ පබ්සබ් සංග්‍රහයට නව/වෙනස් කළ පරිශීලකයන් ප්‍රකාශනය කිරීම සබල කරයි හෝ අබල කරයි.

source: Enables or disables the publishing of new/modified organisations to the ZMQ pubsub feed.
si_lk: ZMQ පබ්සබ් සංග්‍රහයට නව/වෙනස් කළ සංවිධාන ප්‍රකාශනය සක්‍රීය හෝ අක්‍රීය කරයි.

source: Enables or disables the publishing of log entries to the ZMQ pubsub feed. Keep in mind, this can get pretty verbose depending on your logging settings.
si_lk: ZMQ පබ්සබ් සංග්‍රහයට ලඝු සටහන් ප්‍රකාශනය සක්‍රීය හෝ අක්‍රීය කරයි. මතක තබා ගන්න, මෙය ඔබගේ ලොග් සැකසුම් මත පදනම්ව ඉතා වාචික විය හැක.

source: Enables or disables the publishing of new/modified warninglist to the ZMQ pubsub feed.
si_lk: ZMQ පබ්සබ් සංග්‍රහයට නව/වෙනස් කළ අනතුරු ඇඟවීමේ ලැයිස්තුවක් ප්‍රකාශනය කිරීම සබල කරයි හෝ අබල කරයි.

source: Enabled logging to an ElasticSearch instance
si_lk: ඉලාස්ටික් සෙවුම් අවස්ථාවක් වෙත ලොග් වීම සබල කර ඇත

source: The URL(s) at which to access ElasticSearch - comma separate if you want to have more than one.
si_lk: ElasticSearch වෙත ප්‍රවේශ විය යුතු URL(ය) - ඔබට එකකට වඩා තිබීමට අවශ්‍ය නම් කොමාව වෙන් කරන්න.

source: The index in which to place logs
si_lk: ලඝු-සටහන් තැබිය යුතු දර්ශකය

source: Enables or disables uploading of malware samples to S3 rather than to disk (WARNING: Get permission from amazon first!)
si_lk: අනිෂ්ට මෘදුකාංග සාම්පල තැටියට නොව S3 වෙත උඩුගත කිරීම සබල කරයි හෝ අබල කරයි (අවවාදයයි: පළමුව amazon වෙතින් අවසර ලබා ගන්න!)

source: Use external AWS compatible system such as MinIO
si_lk: MinIO වැනි බාහිර AWS අනුකූල පද්ධතිය භාවිතා කරන්න

source: AWS TLS CA, set to empty to use CURL internal trusted certificates or path for custom trusted CA
si_lk: AWS TLS CA, CURL අභ්‍යන්තර විශ්වාසනීය සහතික හෝ අභිරුචි විශ්වාස කළ CA සඳහා මාර්ගය භාවිත කිරීමට හිස් ලෙස සකසා ඇත

source: Validate CA
si_lk: CA වලංගු කරන්න

source: Uses external AWS compatible endpoint such as MinIO
si_lk: MinIO වැනි බාහිර AWS අනුකූල අන්ත ලක්ෂ්‍යය භාවිතා කරයි

source: Bucket name to upload to, please make sure that the bucket exists. We will not create the bucket for you
si_lk: බාල්දියේ නම උඩුගත කිරීමට, කරුණාකර බාල්දිය පවතින බව සහතික කර ගන්න. අපි ඔබ වෙනුවෙන් බාල්දිය නිර්මාණය නොකරමු

source: Region in which your S3 bucket resides
si_lk: ඔබේ S3 බාල්දිය වාසය කරන කලාපය

source: AWS key to use when uploading samples (WARNING: It' highly recommended that you use EC2 IAM roles if at all possible)
si_lk: සාම්පල උඩුගත කිරීමේදී භාවිතා කිරීමට AWS යතුර (අවවාදයයි: හැකිනම් EC2 IAM භූමිකාවන් භාවිතා කිරීම ඉතා නිර්දේශිතයි)

source: AWS secret key to use when uploading samples
si_lk: සාම්පල උඩුගත කිරීමේදී භාවිතා කිරීමට AWS රහස් යතුර

source: This setting defines who will have access to seeing the reported sightings. The default setting is the event owner organisation alone (in addition to everyone seeing their own contribution) with the other options being Sighting reporters (meaning the event owner and any organisation that provided sighting data about the event) and Everyone (meaning anyone that has access to seeing the event / attribute).
si_lk: මෙම සැකසුම මගින් වාර්තා කරන ලද දර්ශන නැරඹීමට ප්‍රවේශය ඇත්තේ කාටද යන්න නිර්වචනය කරයි. පෙරනිමි සැකසුම යනු සිදුවීම් හිමිකරු සංවිධානය පමණක් (සියලු දෙනාටම ඔවුන්ගේම දායකත්වය දකිනවාට අමතරව) අනෙකුත් විකල්පයන් වන්නේ Sighting වාර්තාකරුවන් (සිදුවීම් හිමිකරු සහ සිදුවීම පිළිබඳ දත්ත ලබා දුන් ඕනෑම සංවිධානයක්) සහ සියලු දෙනා (ප්‍රවේශය ඇති ඕනෑම අයෙකු අදහස් වේ) සිදුවීම / ගුණාංගය දැකීමට).

source: Event Owner Organisation
si_lk: සිදුවීම් හිමිකරු සංවිධානය

source: Sighting reporters
si_lk: වාර්තාකරුවන් දකිනවා

source: Everyone
si_lk: හැමෝම

source: Event Owner + host org sightings
si_lk: සිදුවීම් හිමිකරු + සත්කාරක ආයතන බැලීම්

source: Enabling the anonymisation of sightings will simply aggregate all sightings instead of showing the organisations that have reported a sighting. Users will be able to tell the number of sightings their organisation has submitted and the number of sightings for other organisations
si_lk: දර්ශන නිර්නාමික කිරීම සබල කිරීම, දර්ශනයක් වාර්තා කර ඇති සංවිධාන පෙන්වීම වෙනුවට සියලු දර්ශන එකතු කරයි. පරිශීලකයින්ට ඔවුන්ගේ සංවිධානය ඉදිරිපත් කර ඇති දර්ශන ගණන සහ වෙනත් සංවිධාන සඳහා දර්ශන ගණන පැවසීමට හැකි වනු ඇත.

source: When pushing sightings to another server, report all sightings from this instance as this organisation. This effectively hides all sightings from this instance behind a single organisation to the outside world. Sightings pulled from this instance follow the Sightings_policy above.
si_lk: දර්ශන වෙනත් සේවාදායකයකට තල්ලු කරන විට, මෙම අවස්ථාවෙහි ඇති සියලුම දර්ශන මෙම සංවිධානය ලෙස වාර්තා කරන්න. මෙය එක් සංවිධානයක් පිටුපසින් බාහිර ලෝකයට මෙම අවස්ථාවෙන් සියලු දර්ශන ඵලදායී ලෙස සඟවයි. මෙම අවස්ථාවෙන් ලබා ගත් දර්ශන ඉහත Sightings_ප්‍රතිපත්තිය අනුගමනය කරයි.

source: Set the range in which sightings will be taken into account when generating graphs. For example a sighting with a sighted_date of 7 years ago might not be relevant anymore. Setting given in number of days, default is 365 days
si_lk: ප්‍රස්ථාර ජනනය කිරීමේදී දර්ශන සැලකිල්ලට ගත යුතු පරාසය සකසන්න. උදාහරණයක් ලෙස වසර 7කට පෙර දුටු_දිනයක් සහිත දර්ශනයක් තවදුරටත් අදාළ නොවිය හැකිය. සැකසීම දින ගණනින් ලබා දී ඇත, පෙරනිමිය දින 365 කි

source: Enable SightingDB integration.
si_lk: SightingDB ඒකාබද්ධ කිරීම සබල කරන්න.

source: Enable this functionality if you would like to handle the authentication via an external tool and authenticate with MISP using a custom header.
si_lk: ඔබ බාහිර මෙවලමක් හරහා සත්‍යාපනය හැසිරවීමට සහ අභිරුචි ශීර්ෂයක් භාවිතයෙන් MISP සමඟ සත්‍යාපනය කිරීමට කැමති නම් මෙම ක්‍රියාකාරීත්වය සක්‍රීය කරන්න.

source: Set the header that MISP should look for here. If left empty it will default to the Authorization header.
si_lk: MISP විසින් සෙවිය යුතු ශීර්ෂය මෙහි සකසන්න. හිස්ව තැබුවහොත් එය අවසර ශීර්ෂයට පෙරනිමි වේ.

source: Use a header namespace for the auth header - default setting is enabled
si_lk: සත්‍යාපන ශීර්ෂය සඳහා ශීර්ෂ නාම අවකාශයක් භාවිතා කරන්න - පෙරනිමි සැකසුම සක්‍රීය කර ඇත

source: The default header namespace for the auth header - default setting is HTTP_
si_lk: සත්‍යාපන ශීර්ෂය සඳහා පෙරනිමි ශීර්ෂ නාම අවකාශය - පෙරනිමි සැකසුම HTTP_ වේ

source: If this setting is enabled then the only way to authenticate will be using the custom header. Alternatively, you can run in mixed mode that will log users in via the header if found, otherwise users will be redirected to the normal login page.
si_lk: මෙම සැකසුම සබල කර ඇත්නම්, සත්‍යාපනය කිරීමට ඇති එකම මාර්ගය අභිරුචි ශීර්ෂය භාවිතා කිරීමයි. විකල්පයක් ලෙස, ඔබට මිශ්‍ර ප්‍රකාරයේදී ධාවනය කළ හැකි අතර එමඟින් පරිශීලකයින් හමු වුවහොත් ශීර්ෂය හරහා ලොග් වනු ඇත, එසේ නොමැතිනම් පරිශීලකයින් සාමාන්‍ය පිවිසුම් පිටුවට හරවා යවනු ලැබේ.

source: If you are using an external tool to authenticate with MISP and would like to only allow the tool's url as a valid point of entry then set this field.
si_lk: ඔබ MISP සමඟ සත්‍යාපනය කිරීමට බාහිර මෙවලමක් භාවිතා කරන්නේ නම් සහ වලංගු ඇතුල්වීමේ ලක්ෂ්‍යයක් ලෙස මෙවලමෙහි url පමණක් ඉඩ දීමට කැමති නම් මෙම ක්ෂේත්‍රය සකසන්න.
