Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: If you know the attribute ID of a malware-sample or an attachment, you can download it with the following syntax
si_lk: අනිෂ්ට මෘදුකාංග නියැදියක හෝ ඇමුණුමක ගුණාංග හැඳුනුම්පත ඔබ දන්නේ නම්, ඔබට එය පහත වාක්‍ය ඛණ්ඩය සමඟින් බාගත හැකිය

source: Download malware sample by hash
si_lk: හැෂ් මගින් අනිෂ්ට මෘදුකාංග සාම්පල බාගන්න

source: You can also download samples by knowing its MD5 hash. Simply pass the hash along as a JSON/XML object or in the URL (with the URL having overruling the passed objects) to receive a JSON/XML object back with the zipped sample base64 encoded along with some contextual information.
si_lk: එහි MD5 හැෂ් දැන ගැනීමෙන් ඔබට සාම්පල බාගත කළ හැකිය. JSON/XML වස්තුවක් සමඟින් JSON/XML වස්තුවක් ලෙස හෝ URL එකෙහි (URL මඟින් සම්මත කරන ලද වස්තු අභිබවා යන) JSON/XML වස්තුවක් නැවත ලබා ගැනීම සඳහා යම් සන්දර්භීය තොරතුරු සමඟින් සිප් කරන ලද නියැදි base64 සමඟින් හෑෂ් යවන්න.

source: You can also use this API to get all samples from events that contain the passed hash. For this functionality, just pass the "allSamples" flag along. Note that if you are getting all samples from matching events, you can use all supported hash types (%s) for the lookup.</p>
si_lk: සම්මත වූ හැෂ් අඩංගු සිදුවීම් වලින් සියලුම සාම්පල ලබා ගැනීමට ඔබට මෙම API භාවිතා කළ හැක. මෙම ක්‍රියාකාරීත්වය සඳහා, "allSamples" ධජය දිගේ යවන්න. ඔබ ගැලපෙන සිදුවීම් වලින් සියලුම සාම්පල ලබා ගන්නේ නම්, ඔබට සෙවීම සඳහා සහය දක්වන සියලුම හැෂ් වර්ග (%s) භාවිතා කළ හැකි බව සලකන්න.</p>

source: You can also get all the samples from an event with a given event ID, by passing along the eventID parameter. Make sure that either an event ID or a hash is passed along, otherwise an error message will be returned. Also, if no hash is set, the allSamples flag will get set automatically.
si_lk: EventID පරාමිතිය ඔස්සේ ගමන් කිරීමෙන් ඔබට ලබා දී ඇති සිදුවීම් හැඳුනුම්පතක් සහිත සිදුවීමකින් සියලුම සාම්පල ලබා ගත හැක. සිදුවීම් හැඳුනුම්පතක් හෝ හැෂ් එකක් ගමන් කර ඇති බවට වග බලා ගන්න, එසේ නොමැතිනම් දෝෂ පණිවිඩයක් ආපසු එනු ඇත. එසේම, හැෂ් කිසිවක් සකසා නොමැති නම්, සියලු සාම්පල ධජය ස්වයංක්‍රීයව සැකසෙනු ඇත.

source: POST message payload (XML)
si_lk: POST පණිවිඩ ගෙවීම (XML)

source: POST message payload (json)
si_lk: POST පණිවිඩ ගෙවීම (json)

source: A quick description of all the parameters in the passed object
si_lk: සම්මත වස්තුවේ සියලු පරාමිතීන් පිළිබඳ ඉක්මන් විස්තරයක්

source: A hash in MD5 format. If allSamples is set, this can be any one of the following: %s
si_lk: MD5 ආකෘතියෙන් හැෂ් එකක්. allSamples සකසා ඇත්නම්, මෙය පහත සඳහන් ඕනෑම එකක් විය හැක: %s

source: If set, it will return all samples from events that have a match for the hash provided above.
si_lk: සකසා ඇත්නම්, එය ඉහත සපයා ඇති හැෂ් සඳහා ගැළපීමක් ඇති සිදුවීම්වලින් සියලුම සාම්පල ආපසු ලබා දෙනු ඇත.

source: If set, it will only fetch data from the given event ID.
si_lk: සකසා ඇත්නම්, එය ලබා දී ඇති සිදුවීම් ID වෙතින් පමණක් දත්ත ලබා ගනී.

source: Upload malware samples using the "Upload Sample" API
si_lk: "Upload Sample" API භාවිතයෙන් අනිෂ්ට මෘදුකාංග සාම්පල උඩුගත කරන්න

source: This API will allow you to populate an event that you have modify rights to with malware samples (and all related hashes). Alternatively, if you do not supply an event ID, it will create a new event for you.
si_lk: මෙම API ඔබට අනිෂ්ට මෘදුකාංග සාම්පල (සහ අදාළ සියලු හැෂ්) සමඟ වෙනස් කිරීමේ අයිතිය ඇති සිදුවීමක් පුරවා ගැනීමට ඔබට ඉඩ සලසයි. විකල්පයක් ලෙස, ඔබ සිදුවීම් හැඳුනුම්පතක් සපයන්නේ නැතිනම්, එය ඔබ වෙනුවෙන් නව සිදුවීමක් නිර්මාණය කරයි.

source: The files have to be base64 encoded and POSTed as explained below. All samples will be zipped and password protected (with the password being "infected"). The hashes of the original file will be captured as additional attributes.
si_lk: ගොනු මූලික 64 කේතනය කර පහත විස්තර කර ඇති පරිදි POST කළ යුතුය. සියලුම සාම්පල සිප් කර මුරපදය ආරක්ෂා කරනු ඇත (මුරපද "ආසාදනය" සමඟ). මුල් ගොනුවේ හෑෂ් අමතර ගුණාංග ලෙස ග්‍රහණය කරනු ලැබේ.

source: The event ID is optional. MISP will accept either a JSON or an XML object posted to the above URL.
si_lk: සිදුවීම් හැඳුනුම්පත විකල්පමය වේ. MISP ඉහත URL වෙත පළ කර ඇති JSON හෝ XML වස්තුවක් පිළිගනී.

source: The general structure of the expected objects is as follows
si_lk: අපේක්ෂිත වස්තූන්හි පොදු ව්යුහය පහත පරිදි වේ

source: The following optional parameters are expected
si_lk: පහත විකල්ප පරාමිතීන් අපේක්ෂා කෙරේ

source: The Event's ID is optional. It can be either supplied via the URL or the POSTed object, but the URL has priority if both are provided. Not supplying an event ID will cause MISP to create a single new event for all of the POSTed malware samples. You can define the default settings for the event, otherwise a set of default settings will be used.
si_lk: සිදුවීමේ හැඳුනුම්පත විකල්පමය වේ. එය URL හෝ POST කරන ලද වස්තුව හරහා සැපයිය හැක, නමුත් දෙකම සපයා ඇත්නම් URL එකට ප්‍රමුඛතාවයක් ඇත. සිදුවීම් හැඳුනුම්පතක් ලබා නොදීම MISP විසින් සියලුම පළ කරන ලද අනිෂ්ට මෘදුකාංග සාම්පල සඳහා තනි සිදුවීමක් නිර්මාණය කිරීමට හේතු වේ. ඔබට සිදුවීම සඳහා පෙරනිමි සැකසුම් නිර්වචනය කළ හැකිය, එසේ නොමැතිනම් පෙරනිමි සැකසුම් කට්ටලයක් භාවිතා කරනු ඇත.

source: The distribution setting used for the attributes and for the newly created event, if relevant. [0-3]
si_lk: අදාළ නම්, උපලක්ෂණ සඳහා සහ අලුතින් සාදන ලද සිදුවීම සඳහා බෙදා හැරීමේ සැකසුම භාවිතා වේ. [0-3]

source: You can flag all attributes created during the transaction to be marked as "to_ids" or not.
si_lk: "to_ids" ලෙස සලකුණු කිරීමට හෝ නොකිරීමට ගනුදෙනුව අතරතුර සාදන ලද සියලුම උපලක්ෂණ ඔබට සලකුණු කළ හැක.

source: The category that will be assigned to the uploaded samples. Valid options are: Payload delivery, Artefacts dropped, Payload Installation, External Analysis.
si_lk: උඩුගත කරන ලද සාම්පලවලට පවරනු ලබන කාණ්ඩය. වලංගු විකල්ප වනුයේ: පැටවීම බෙදාහැරීම, කෞතුක වස්තු අතහැර දැමීම, ගෙවීම් ස්ථාපනය කිරීම, බාහිර විශ්ලේෂණය.

source: Used to populate the event info field if no event ID supplied. Alternatively, if not set, MISP will simply generate a message showing that it's a malware sample collection generated on the given day.
si_lk: සිදුවීම් හැඳුනුම්පතක් සපයා නොමැති නම් සිදුවීම් තොරතුරු ක්ෂේත්‍රය ජනනය කිරීමට භාවිතා කරයි. විකල්පයක් ලෙස, සකසා නොමැති නම්, MISP විසින් එය ලබා දුන් දිනයේ ජනනය කරන ලද අනිෂ්ට මෘදුකාංග සාම්පල එකතුවක් බව පෙන්වන පණිවිඩයක් ජනනය කරයි.

source: The analysis level of the newly created event, if applicable. [0-2]
si_lk: අදාළ නම්, අලුතින් සාදන ලද සිදුවීමේ විශ්ලේෂණ මට්ටම. [0-2]

source: The threat level ID of the newly created event, if applicable. [0-3]
si_lk: අදාළ නම්, අලුතින් සාදන ලද සිදුවීමේ තර්ජන මට්ටමේ ID. [0-3]

source: This will populate the comment field of any attribute created using this API.
si_lk: මෙය මෙම API භාවිතයෙන් සාදන ලද ඕනෑම උපලක්ෂණයක අදහස් ක්ෂේත්‍රය පුරවයි.

source: Add or remove tags from events
si_lk: සිදුවීම් වලින් ටැග් එක් කරන්න හෝ ඉවත් කරන්න

source: You can add or remove an existing tag from an event in the following way
si_lk: ඔබට පහත ආකාරයෙන් සිදුවීමකින් පවතින ටැගයක් එක් කිරීමට හෝ ඉවත් කිරීමට හැකිය

source: Just POST a json object in the following format (to the appropriate API depending on whether you want to add or delete a tag from an event)
si_lk: පහත ආකෘතියෙන් json වස්තුවක් පළ කරන්න (ඔබට සිදුවීමකින් ටැගයක් එක් කිරීමට හෝ මැකීමට අවශ්‍යද යන්න මත පදනම්ව සුදුසු API වෙත)

source: Where "tag" is the ID of the tag. You can also use the name of the tag the following way
si_lk: "ටැග්" යනු ටැගයේ හැඳුනුම වේ. ඔබට ටැග් එකේ නම පහත ආකාරයට භාවිතා කළ හැක

source: Proposals and the API
si_lk: යෝජනා සහ API

source: You can interact with the proposals via the API directly since version 2.3.148
si_lk: 2.3.148 අනුවාදයේ සිට ඔබට සෘජුවම API හරහා යෝජනා සමඟ අන්තර් ක්‍රියා කළ හැක

source: Explanation
si_lk: පැහැදිලි කිරීම

source: Expected Payload
si_lk: අපේක්ෂිත ගෙවීම

source: Response
si_lk: ප්රතිචාරය

source: View a proposal
si_lk: යෝජනාවක් බලන්න

source: ShadowAttribute object
si_lk: ShadowAttribute වස්තුව

source: View all proposal of my org's events
si_lk: මගේ සංවිධානයේ සිදුවීම්වල සියලුම යෝජනා බලන්න

source: ShadowAttribute objects
si_lk: ShadowAttribute වස්තු

source: View all proposals of an event
si_lk: සිදුවීමක සියලුම යෝජනා බලන්න

source: Propose a new attribute to an event
si_lk: සිදුවීමකට නව ගුණාංගයක් යෝජනා කරන්න

source: Propose an edit to an attribute
si_lk: ගුණාංගයකට සංස්කරණයක් යෝජනා කරන්න

source: Accept a proposal
si_lk: යෝජනාවක් පිළිගන්න

source: Discard a proposal
si_lk: යෝජනාවක් ඉවතලන්න

source: When posting a shadow attribute object, use the following formats
si_lk: සෙවනැලි ගුණාංග වස්තුවක් පළ කිරීමේදී, පහත ආකෘති භාවිතා කරන්න

source: None of the above fields are mandatory, but at least one of them has to be provided.
si_lk: ඉහත ක්ෂේත්‍ර කිසිවක් අනිවාර්ය නොවේ, නමුත් අවම වශයෙන් ඒවායින් එකක්වත් සැපයිය යුතුය.

source: Filtering event metadata
si_lk: සිදුවීම් පාරදත්ත පෙරීම

source: As described in the REST section, it is possible to retrieve a list of events along with their metadata by sending a GET request to the /events API. However, this API in particular is a bit more versatile. You can pass search parameters along to search among the events on various fields and retrieve a list of matching events (along with their metadata). Use the following URL
si_lk: REST කොටසේ විස්තර කර ඇති පරිදි, /events API වෙත GET ඉල්ලීමක් යැවීමෙන් ඒවායේ පාර-දත්ත සමඟ සිදුවීම් ලැයිස්තුවක් ලබා ගත හැක. කෙසේ වෙතත්, විශේෂයෙන් මෙම API ටිකක් බහුකාර්ය වේ. විවිධ ක්ෂේත්‍රවල සිදුවීම් අතර සෙවීමට සහ ගැළපෙන සිදුවීම් ලැයිස්තුවක් (ඒවායේ පාර-දත්ත සමඟ) ලබා ගැනීමට ඔබට සෙවුම් පරාමිති පසුකර යා හැක. පහත URL එක භාවිතා කරන්න

source: POST a JSON object with the desired lookup fields and values to receive a JSON back.<br /> An example for a valid lookup
si_lk: JSON ආපසු ලබා ගැනීමට අවශ්‍ය සෙවුම් ක්ෂේත්‍ර සහ අගයන් සහිත JSON වස්තුවක් පළ කරන්න.<br /> වලංගු සෙවීමක් සඳහා උදාහරණයක්

source: The above would return any event that is published, not restricted to your organisation only that has the term "Locky" in its event description. You can use exclamation marks to negate a value wherever appropriate.
si_lk: ඉහතින් ප්‍රකාශනය කරන ඕනෑම සිදුවීමක් ආපසු ලබා දෙනු ඇත, ඔබේ සංවිධානයට පමණක් සීමා නොවී එහි සිදුවීම් විස්තරයේ "ලොකී" යන යෙදුම ඇත. සුදුසු ඕනෑම තැනක අගයක් නිෂේධනය කිරීමට ඔබට විශ්මයාර්ථ ලකුණු භාවිතා කළ හැක.

source: The list of valid parameters
si_lk: වලංගු පරාමිති ලැයිස්තුව

source: Filters on published or unpublished events [0,1] - negatable
si_lk: ප්‍රකාශිත හෝ ප්‍රකාශයට පත් නොකළ සිදුවීම් මත පෙරහන් [0,1] - නිෂේධනය කළ හැකිය

source: Filters on strings found in the event info - negatable
si_lk: සිද්ධි තොරතුරුවල හමු වූ තන්තු මත පෙරහන් - නිෂේධනීය

source: Filters on attached tag names - negatable
si_lk: අමුණා ඇති ටැග් නම්වල පෙරහන් - නිෂේධාත්මකයි

source: Filters on specific event IDs - negatable
si_lk: විශේෂිත සිදුවීම් හැඳුනුම්පත්වල පෙරහන් - නිෂේධනය කළ හැකිය

source: Filters on a given event threat level [1,2,3,4] - negatable
si_lk: දී ඇති සිදුවීම් තර්ජන මට්ටමේ පෙරහන් [1,2,3,4] - නිෂේධනය කළ හැකිය

source: Filters on the distribution level [0,1,2,3] - negatable
si_lk: බෙදාහැරීමේ මට්ටමේ පෙරහන් [0,1,2,3] - නිෂේධනය කළ හැකිය

source: Filters on the given analysis phase of the event [0,1,2] - negatable
si_lk: සිද්ධියේ [0,1,2] ලබා දී ඇති විශ්ලේෂණ අදියර මත පෙරහන් - නිෂේධනය කළ හැකිය

source: Filters on a contained attribute value - negatable
si_lk: අඩංගු ගුණාංග අගයක් මත පෙරහන් - නිෂේධනීය

source: Filters on the creator organisation - negatable
si_lk: නිර්මාපක සංවිධානයේ පෙරහන් - නිෂේධාත්මකයි

source: Filters on the creator user's email address (admin only) - negatable
si_lk: නිර්මාපක පරිශීලකයාගේ ඊමේල් ලිපිනයේ පෙරහන් (පරිපාලක පමණක්) - නිෂේධනය කළ හැකිය

source: Filters on the date, anything newer than the given date in YYYY-MM-DD format is taken - non-negatable
si_lk: දිනයේ පෙරහන්, YYYY-MM-DD ආකෘතියෙන් ලබා දී ඇති දිනයට වඩා අලුත් ඕනෑම දෙයක් ගනු ලැබේ - නිෂේධනය කළ නොහැක

source: Filters on the date, anything older than the given date in YYYY-MM-DD format is taken - non-negatable
si_lk: දිනයේ පෙරහන්, YYYY-MM-DD ආකෘතියෙන් ලබා දී ඇති දිනයට වඩා පැරණි ඕනෑම දෙයක් ගනු ලැබේ - නිෂේධාත්මක නොවේ

source: The freetext import tool is also exposed to the API.
si_lk: නිදහස් පෙළ ආනයන මෙවලම ද API වෙත නිරාවරණය වේ.

source: Simply POST the contents to be parsed and either directly create attributes out of them or simply return the parsing results.
si_lk: විග්‍රහ කිරීමට අවශ්‍ය අන්තර්ගතය සරලව POST කර ඒවායින් සෘජුවම උපලක්ෂණ සාදන්න හෝ විග්‍රහ කිරීමේ ප්‍රතිඵල ලබා දෙන්න.

source: Use the boolean (0/1) adhere_to_warninglists and return_meta_attributes url parameters to filter out values tripping over a warninglist and to decide whether to save the attributes parsed or simply return them as meta attributes.
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තුවක් හරහා වැටෙන අගයන් පෙරීමට සහ විග්‍රහ කළ ගුණාංග සුරැකීමට හෝ ඒවා මෙටා ගුණාංග ලෙස ආපසු ලබා දීමට තීරණය කිරීමට boolean (0/1) adhere_to_warninglists සහ return_meta_attributes url පරාමිති භාවිතා කරන්න.

source: The contents of the POST body should be the text to be parsed.
si_lk: POST සිරුරේ අන්තර්ගතය විග්‍රහ කළ යුතු පෙළ විය යුතුය.

source: Administering the background workers via the API.
si_lk: API හරහා පසුබිම් සේවකයින් පරිපාලනය කිරීම.

source: You can start/stop and view the bacground workers via the API.
si_lk: ඔබට API හරහා පසුබිම් සේවකයින් ආරම්භ කිරීමට/නැවැත්වීමට සහ බැලීමට හැකිය.

source: Add worker
si_lk: සේවකයා එකතු කරන්න

source: Stop worker
si_lk: සේවකයා නවත්වන්න

source: Get worker info
si_lk: සේවක තොරතුරු ලබා ගන්න

source: Contact organization reporting event %s
si_lk: සම්බන්ධතා සංවිධාන වාර්තා කිරීමේ සිද්ධිය %s

source: You are about to contact the organization %s that reported event %s.<br> Feel free to add a custom message that will be sent to the reporting organization.<br> Your email address and details about the event will be added automagically to the message.
si_lk: ඔබ සිද්ධිය %sවාර්තා කළ %s සංවිධානය සම්බන්ධ කර ගැනීමට සූදානම් වේ.<br> වාර්තාකරණ සංවිධානයට යවනු ලබන අභිරුචි පණිවිඩයක් එක් කිරීමට නිදහස් වන්න.<br> ඔබගේ විද්‍යුත් තැපැල් ලිපිනය සහ සිදුවීම පිළිබඳ විස්තර පණිවිඩයට ස්වයංක්‍රීයව එක් කෙරේ.

source: Submit only to the person that created the event
si_lk: සිදුවීම නිර්මාණය කළ පුද්ගලයාට පමණක් ඉදිරිපත් කරන්න

source: Export functionality is designed to automatically generate signatures for intrusion detection systems. To enable signature generation for a given attribute, Signature field of this attribute must be set to Yes. Note that not all attribute types are applicable for signature generation, currently we only support NIDS signature generation for IP, domains, host names, user agents etc., and hash list generation for MD5/SHA1 values of file artifacts. Support for more attribute types is planned.
si_lk: අපනයන ක්‍රියාකාරිත්වය සැලසුම් කර ඇත්තේ ආක්‍රමණය හඳුනාගැනීමේ පද්ධති සඳහා ස්වයංක්‍රීයව අත්සන් උත්පාදනය කිරීමටය. දී ඇති උපලක්ෂණයක් සඳහා අත්සන උත්පාදනය සක්‍රීය කිරීමට, මෙම ගුණාංගයේ අත්සන ක්ෂේත්‍රය ඔව් ලෙස සැකසිය යුතුය. අත්සන උත්පාදනය සඳහා සියලුම උපලක්ෂණ වර්ග අදාළ නොවන බව සලකන්න, දැනට අපි සහාය දක්වන්නේ IP, වසම්, ධාරක නාම, පරිශීලක නියෝජිතයන් ආදිය සඳහා NIDS අත්සන් උත්පාදනයට සහ ගොනු පුරාවස්තුවල MD5/SHA1 අගයන් සඳහා හැෂ් ලැයිස්තු උත්පාදනයට පමණි. තවත් ගුණාංග වර්ග සඳහා සහාය සැලසුම් කර ඇත.

source: Simply click on any of the following buttons to download the appropriate data.
si_lk: සුදුසු දත්ත බාගත කිරීම සඳහා පහත ඕනෑම බොත්තමක් මත ක්ලික් කරන්න.

source: Last Update
si_lk: අවසාන යාවත්කාලීන කිරීම

source: Outdated
si_lk: යල් පැන ගිය

source: Filesize
si_lk: ගොනු ප්රමාණය

source: Progress
si_lk: ප්රගතිය

source: Attachments are enabled on this instance
si_lk: මෙම අවස්ථාවෙහි ඇමුණුම් සබල කර ඇත

source: Attachments are disabled on this instance
si_lk: මෙම අවස්ථාවේදී ඇමුණුම් අබල කර ඇත

source: Loading…
si_lk: …පූරණය වේ

source: Queued
si_lk: පෝලිමේ

source: Completed
si_lk: සම්පූර්ණ කළා

source: Generate
si_lk: උත්පාදනය කරන්න

source: Warning, the background worker is not responding!
si_lk: අවවාදයයි, පසුබිම් සේවකයා ප්‍රතිචාර නොදක්වයි!

source: 0 seconds ago
si_lk: තත්පර 0 කට පෙර

source: Download all as XML
si_lk: සියල්ල XML ලෙස බාගන්න

source: Click this to download all events and attributes that you have access to (except file attachments) in a custom XML format.
si_lk: අභිරුචි XML ආකෘතියකින් (ගොනු ඇමුණුම් හැර) ඔබට ප්‍රවේශය ඇති සියලුම සිදුවීම් සහ ගුණාංග බාගත කිරීමට මෙය ක්ලික් කරන්න.

source: Download all signatures as CSV
si_lk: සියලුම අත්සන් CSV ලෙස බාගන්න

source: Download all as CSV
si_lk: සියල්ල CSV ලෙස බාගන්න

source: Download Suricata signatures
si_lk: Suricata අත්සන් බාගන්න

source: Download Snort signatures
si_lk: Snort අත්සන් බාගන්න

source: Click these to download all network related attributes that you have access to under the Suricata or Snort rule format. Only <em>published</em> events and attributes marked as <em>IDS Signature</em> are exported. Administration is able to maintain a whitelist containing host, domain name and IP numbers to exclude from the NIDS export.
si_lk: Suricata හෝ රීති ආකෘතිය යටතේ ඔබට ප්‍රවේශය ඇති සියලුම ජාල ආශ්‍රිත උපලක්ෂණ බාගැනීමට මේවා ක්ලික් කරන්න. <em>IDS අත්සන</em> ලෙස සලකුණු කර ඇති සිදුවීම්</em> සහ ගුණාංග <em>ක් පමණක් අපනයනය කෙරේ. NIDS අපනයනයෙන් බැහැර කිරීම සඳහා සත්කාරක, වසම් නාම සහ IP අංක අඩංගු සුදු ලැයිස්තුවක් පවත්වා ගැනීමට පරිපාලනයට හැකි වේ.

source: Download Bro signatures
si_lk: බ්‍රෝ අත්සන් බාගන්න

source: Click these to download all network related attributes that you have access to under the Bro rule format. Only <em>published</em> events and attributes marked as <em>IDS Signature</em> are exported. Administration is able to maintain a whitelist containing host, domain name and IP numbers to exclude from the NIDS export.
si_lk: බ්‍රෝ රීති ආකෘතිය යටතේ ඔබට ඇති සියලුම ජාල සම්බන්ධ උපලක්ෂණ බාගැනීමට මේවා ක්ලික් කරන්න. <em>IDS අත්සන</em> ලෙස සලකුණු කර ඇති සිදුවීම්</em> සහ ගුණාංග <em>ක් පමණක් අපනයනය කෙරේ. NIDS අපනයනයෙන් බැහැර කිරීම සඳහා සත්කාරක, වසම් නාම සහ IP අංක අඩංගු සුදු ලැයිස්තුවක් පවත්වා ගැනීමට පරිපාලනයට හැකි වේ.

source: Download RPZ Zone File
si_lk: RPZ කලාප ගොනුව බාගන්න

source: Download all MD5 hashes
si_lk: සියලුම MD5 හැෂ් බාගන්න

source: Download all SHA1 hashes
si_lk: සියලුම SHA1 හැෂ් බාගන්න

source: Click on one of these two buttons to download all MD5 or SHA1 checksums contained in file-related attributes. This list can be used to feed forensic software when searching for susipicious files. Only <em>published</em> events and attributes marked as <em>IDS Signature</em> are exported.
si_lk: ගොනු ආශ්‍රිත ගුණාංගවල අඩංගු සියලුම MD5 හෝ SHA1 චෙක්සම් බාගැනීමට මෙම බොත්තම් දෙකෙන් එකක් ක්ලික් කරන්න. සැක සහිත ගොනු සොයන විට අධිකරණ වෛද්‍ය මෘදුකාංග පෝෂණය කිරීමට මෙම ලැයිස්තුව ක් භාවිතා කළ හැක. IDS <em>අත්සන</em> ලෙස සලකුණු කර ඇති ප්‍රකාශිත සිදුවීම්</em> ක් සහ ගුණාංග <em> පමණක් අපනයනය කෙරේ.

source: Click on one of these buttons to download all the attributes with the matching type. This list can be used to feed forensic software when searching for susipicious files. Only <em>published</em> events and attributes marked as <em>IDS Signature</em> are exported.
si_lk: ගැලපෙන වර්ගය සමඟ සියලු ගුණාංග බාගත කිරීමට මෙම බොත්තම් වලින් එකක් මත ක්ලික් කරන්න. සැක සහිත ගොනු සෙවීමේදී අධිකරණ වෛද්‍ය මෘදුකාංගය පෝෂණය කිරීමට මෙම ලැයිස්තුව භාවිතා කළ හැක. ප්‍රකාශිත සිදුවීම්</em> ක් සහ IDS අත්සන <em>ක් ලෙස සලකුණු කර ඇති ගුණාංග <em></em> පමණක් අපනයනය කෙරේ.

source: Filter Event Index
si_lk: පෙරහන් සිදුවීම් දර්ශකය

source: OR
si_lk: හෝ

source: NOT
si_lk: නැහැ

source: Any
si_lk: කිසියම්

source: Medium
si_lk: මධ්යම

source: Undefined
si_lk: නිර්වචනය නොකළ

source: Initial
si_lk: ආරම්භක

source: Ongoing
si_lk: සිදුවෙමින් පවතී

source: Delete filter
si_lk: පෙරහන මකන්න

source: No filters set - add filter terms above.
si_lk: පෙරහන් සකසා නැත - ඉහත පෙරහන් නියමයන් එක් කරන්න.

source: Save this URL if you would like to use the same filter settings again
si_lk: ඔබ නැවත එම පෙරහන් සැකසුම් භාවිතා කිරීමට කැමති නම් මෙම URL එක සුරකින්න

source: Apply
si_lk: අයදුම් කරන්න

source: "No"
si_lk: "නැත"

source: Freetext Import Tool
si_lk: නිදහස් පෙළ ආනයන මෙවලම

source: Paste a list of IOCs into the field below for automatic detection.
si_lk: ස්වයංක්‍රීය හඳුනාගැනීම සඳහා පහත ක්ෂේත්‍රයට IOC ලැයිස්තුවක් අලවන්න.

source: Matched event
si_lk: ගැලපෙන සිදුවීම

source: No matching events found.
si_lk: ගැළපෙන සිදුවීම් කිසිවක් හමු නොවීය.

source: This will still allow you to store the UUID. It will extend the assigned event as soon as it is created/becomes visible.
si_lk: මෙය තවමත් ඔබට UUID ගබඩා කිරීමට ඉඩ සලසයි. එය පවරන ලද සිදුවීම නිර්මාණය වූ/දෘෂ්‍යමාන වූ වහාම එය දිගු කරයි.

source: Info
si_lk: තොරතුරු

source: File upload
si_lk: ගොනුව උඩුගත

source: Paste Input
si_lk: ආදානය අලවන්න

source: Input File
si_lk: ආදාන ගොනුව

source: Events
si_lk: සිදුවීම්

source: Attribute count
si_lk: ගුණාංග ගණන

source: Proposals
si_lk: යෝජනා

source: Posts
si_lk: තනතුරු

source: Report count
si_lk: වාර්තා ගණන

source: Modify filters
si_lk: පෙරහන් වෙනස් කරන්න

source: Delete selected events
si_lk: තෝරාගත් සිදුවීම් මකන්න

source: My events only
si_lk: මගේ සිදුවීම් පමණි

source: My Events
si_lk: මගේ සිදුවීම්

source: My organisation's events only
si_lk: මගේ සංවිධානයේ සිදුවීම් පමණි

source: Org Events
si_lk: සංවිධානයේ සිදුවීම්

source: Choose columns to show
si_lk: පෙන්වීමට තීරු තෝරන්න

source: Automation functionality is designed to automatically generate signatures for intrusion detection systems. To enable signature generation for a given attribute, Signature field of this attribute must be set to Yes. Note that not all attribute types are applicable for signature generation, currently we only support NIDS signature generation for IP, domains, host names, user agents etc., and hash list generation for MD5/SHA1 values of file artefacts. Support for more attribute types is planned. To to make this functionality available for automated tools an authentication key is used. This makes it easier for your tools to access the data without further form-based-authentication.
si_lk: ස්වයංක්‍රීය ක්‍රියාකාරිත්වය සැලසුම් කර ඇත්තේ ආක්‍රමණය හඳුනාගැනීමේ පද්ධති සඳහා ස්වයංක්‍රීයව අත්සන් උත්පාදනය කිරීම සඳහා ය. දී ඇති උපලක්ෂණයක් සඳහා අත්සන උත්පාදනය සක්‍රීය කිරීමට, මෙම ගුණාංගයේ අත්සන ක්ෂේත්‍රය ඔව් ලෙස සැකසිය යුතුය. අත්සන උත්පාදනය සඳහා සියලුම උපලක්ෂණ වර්ග අදාළ නොවන බව සලකන්න, දැනට අපි සහාය දක්වන්නේ IP, වසම්, ධාරක නාම, පරිශීලක නියෝජිතයන් යනාදිය සඳහා NIDS අත්සන් උත්පාදනයට සහ ගොනු කෞතුක භාණ්ඩවල MD5/SHA1 අගයන් සඳහා හැෂ් ලැයිස්තු උත්පාදනයට පමණි. තවත් ගුණාංග වර්ග සඳහා සහාය සැලසුම් කර ඇත. ස්වයංක්‍රීය මෙවලම් සඳහා මෙම ක්‍රියාකාරීත්වය ලබා දීමට සත්‍යාපන යතුරක් භාවිතා කෙරේ. මෙමගින් ඔබගේ මෙවලම් වලට තවදුරටත් පෝරමය පදනම් වූ සත්‍යාපනයකින් තොරව දත්ත වෙත ප්‍රවේශ වීම පහසු කරයි.

source: Make sure you keep that key secret as it gives access to the entire database !
si_lk: එය සම්පූර්ණ දත්ත සමුදායට ප්‍රවේශය ලබා දෙන බැවින් ඔබ එම යතුර රහස තබා ගැනීමට වග බලා ගන්න!

source: Your current key is: <code>%s</code>. You can %s this key.
si_lk: ඔබගේ වත්මන් යතුර: <code>%s</code>. ඔබට මෙම යතුර %s කළ හැක.

source: Since version 2.2 the usage of the authentication key in the URL is deprecated. Instead, pass the auth key in an Authorization header in the request. The legacy option of having the auth key in the URL is temporarily still supported but not recommended.
si_lk: 2.2 අනුවාදයේ සිට URL හි සත්‍යාපන යතුර භාවිතය අත්හරිනු ලැබේ. ඒ වෙනුවට, ඉල්ලීමේ බලය පැවරීමේ ශීර්ෂයක auth යතුර යවන්න. URL හි සත්‍යාපන යතුර තිබීමේ ලෙගසි විකල්පය තාවකාලිකව තවමත් සහාය දක්වන නමුත් නිර්දේශ නොකරයි.

source: Please use the use the following header
si_lk: කරුණාකර පහත ශීර්ෂය භාවිතා කරන්න

source: Authorization
si_lk: අවසර දීම

source: XML Export
si_lk: XML අපනයනය

source: An automatic export of all events and attributes <small>(except file attachments)</small> is available under a custom XML format.
si_lk: සියලුම සිදුවීම් සහ ගුණාංග <small>(ගොනු ඇමුණුම් හැර)</small> හි ස්වයංක්‍රීය අපනයනයක් අභිරුචි XML ආකෘතියක් යටතේ ලබා ගත හැකිය.

source: You can configure your tools to automatically download the following file
si_lk: පහත ගොනුව ස්වයංක්‍රීයව බාගැනීමට ඔබට ඔබගේ මෙවලම් වින්‍යාසගත කළ හැක

source: If you only want to fetch a specific event append the eventid number
si_lk: ඔබට නිශ්චිත සිදුවීමක් පමණක් ලබා ගැනීමට අවශ්‍ය නම්, Eventid අංකය එක් කරන්න
