Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: Are you sure you want to purge all job entries? Job entries are considered as log entries and have no impact on actual job execution.
si_lk: ඔබට සියලු රැකියා ඇතුළත් කිරීම් ඉවත් කිරීමට අවශ්‍ය බව විශ්වාසද? රැකියා ඇතුළත් කිරීම් ලොග් සටහන් ලෙස සලකනු ලබන අතර සැබෑ රැකියා ක්‍රියාත්මක කිරීම කෙරෙහි බලපෑමක් නැත.

source: Completed.
si_lk: සම්පූර්ණ කළා.

source: Show all queues
si_lk: සියලුම පෝලිම් පෙන්වන්න

source: Show default queue
si_lk: පෙරනිමි පෝලිම පෙන්වන්න

source: Prio
si_lk: ප්රියෝ

source: Show prio queue
si_lk: පෙර පෝලිම පෙන්වන්න

source: Show email queue
si_lk: ඊමේල් පෝලිම පෙන්වන්න

source: Cache
si_lk: හැඹිලිය

source: Show cache queue
si_lk: හැඹිලි පෝලිම පෙන්වන්න

source: Date created
si_lk: සාදන ලද දිනය

source: Date modified
si_lk: දිනය වෙනස් කරන ලදී

source: Process ID
si_lk: ක්‍රියාවලි ID

source: Worker
si_lk: කම්කරුවා

source: Job type
si_lk: රැකියා වර්ගය

source: Input
si_lk: ආදානය

source: No worker active
si_lk: සක්‍රීය සේවකයෙක් නැත

source: Running
si_lk: දුවනවා

source: View stacktrace
si_lk: Stacktrace බලන්න

source: Background Job Error Browser
si_lk: පසුබිම් රැකියා දෝෂ බ්‍රව්සරය

source: Click to show stack trace
si_lk: තොග හෝඩුවාවක් පෙන්වීමට ක්ලික් කරන්න

source: Click to hide stack trace
si_lk: තොග හෝඩුවාවක් සැඟවීමට ක්ලික් කරන්න

source: No error data found. Generally job error data is purged from Redis after 24 hours, however, you can still view the errors in the log files in "/app/tmp/logs".
si_lk: දෝෂ දත්ත හමු නොවීය. සාමාන්‍යයෙන් රැකියා දෝෂ දත්ත පැය 24කට පසුව Redis වෙතින් ඉවත් කරනු ලැබේ, කෙසේ වෙතත්, ඔබට තවමත් "/app/tmp/logs" තුළ ලොග් ගොනු වල දෝෂ බැලිය හැක.

source: Results for all log entries
si_lk: සියලුම ලඝු සටහන් සඳහා ප්‍රතිඵල

source: for user
si_lk: පරිශීලක සඳහා

source: of organisation
si_lk: සංවිධානයේ

source: for model
si_lk: ආකෘතිය සඳහා

source: for model ID
si_lk: ආදර්ශ හැඳුනුම්පත සඳහා

source: of type
si_lk: වර්ගයේ

source: with the title
si_lk: මාතෘකාව සමඟ

source: including the change
si_lk: වෙනස් කිරීම ඇතුළුව

source: from IP
si_lk: IP වලින්

source: Stolen attribute validation
si_lk: සොරකම් කළ ගුණාංග වලංගු කිරීම

source: Nothing to see here, move along.
si_lk: මෙහි බැලීමට කිසිවක් නැත, ඉදිරියට යන්න.

source: Attribute (%s) associated to events: %s
si_lk: සිදුවීම් වලට සම්බන්ධ ගුණාංගය (%s): %s

source: Create anonymously
si_lk: නිර්නාමිකව නිර්මාණය කරන්න

source: Created at
si_lk: දී නිර්මාණය කරන ලදී

source: Delete news
si_lk: පුවත් මකන්න

source: Expanded Name
si_lk: පුළුල් කළ නම

source: geographical_area
si_lk: භූගෝලීය_ප්‍රදේශය

source: Geographical Area
si_lk: භූගෝලීය ප්රදේශය

source: Noticelist Deletion
si_lk: දැන්වීම් ලැයිස්තුව මකා දැමීම

source: Are you sure you want to delete Noticelist #%s?
si_lk: Noticelist #%sමැකීමට අවශ්‍ය බව ඔබට විශ්වාසද?

source: Add Object Reference
si_lk: වස්තු යොමු එක් කරන්න

source: Object
si_lk: වස්තුව

source: Target Details
si_lk: ඉලක්ක විස්තර

source: Object reference Deletion
si_lk: වස්තු යොමු මකාදැමීම

source: Are you sure you want to soft delete Object reference #%s?%s
si_lk: ඔබට වස්තු යොමු #%sමෘදු ලෙස මකා දැමීමට අවශ්‍ය බව විශ්වාසද?%s

source: Are you sure you want to hard delete Object reference #%s?%s
si_lk: වස්තු යොමු #%sඅමාරුවෙන් මකා දැමිය යුතු බව ඔබට විශ්වාසද?%s

source: The Attribute will be permanently deleted and unrecoverable. Also, this will prevent the deletion to be propagated to other instances.
si_lk: ගුණාංගය ස්ථිරවම මකා දැමෙනු ඇති අතර ආපසු ලබාගත නොහැක. එසේම, මෙය මකාදැමීම වෙනත් අවස්ථාවන්ට ප්‍රචාරණය වීම වළක්වයි.

source: Object relation
si_lk: වස්තුව සම්බන්ධය

source: Multiple
si_lk: බහු

source: UI-priority
si_lk: UI-ප්රමුඛත්වය

source: Categories
si_lk: වර්ග

source: Sane defaults
si_lk: සාන් පෙරනිමි

source: List of valid Values
si_lk: වලංගු අගයන් ලැයිස්තුව

source: Disable correlation
si_lk: සහසම්බන්ධය අබල කරන්න

source: Object Template index
si_lk: වස්තු සැකිලි දර්ශකය

source: Active
si_lk: ක්රියාකාරී

source: Requirements
si_lk: අවශ්යතා

source: Force update
si_lk: බලහත්කාරයෙන් යාවත්කාලීන කිරීම

source: Are you sure you want to force an update for template # %s?
si_lk: # %sඅච්චුව සඳහා බලහත්කාරයෙන් යාවත්කාලීන කිරීමට අවශ්‍ය බව ඔබට විශ්වාසද?

source: Are you sure you want to delete template # %s?
si_lk: ඔබට # %sඅච්චුව මැකීමට අවශ්‍ය බව විශ්වාසද?

source: Object Template
si_lk: වස්තු සැකිල්ල

source: Object
si_lk: වස්තුව

source: Object Template
si_lk: වස්තු සැකිල්ල

source: Update the template of this object to the newer version:
si_lk: මෙම වස්තුවේ අච්චුව නව අනුවාදයට යාවත්කාලීන කරන්න:

source: Update template to v%s
si_lk: අච්චුව v%sවෙත යාවත්කාලීන කරන්න

source: Meta category
si_lk: මෙටා කාණ්ඩය

source: Warning, issues found with the template
si_lk: අවවාදයයි, අච්චුව සමඟ ගැටලු හමු විය

source: Name :: type
si_lk: නම :: වර්ගය

source: Warning: You are about to share data that is of a classified nature. Make sure that you are authorised to share this.
si_lk: අවවාදයයි: ඔබ වර්ගීකෘත ස්වභාවයක් ඇති දත්ත බෙදා ගැනීමට සූදානම් වේ. මෙය බෙදා ගැනීමට ඔබට අවසර ඇති බව සහතික කර ගන්න.

source: Back
si_lk: ආපසු

source: Current Object state on older template version
si_lk: පැරණි අච්චු අනුවාදයේ වත්මන් වස්තුවේ තත්වය

source: Template version
si_lk: සැකිලි අනුවාදය

source: The original object's template is unkown and some attributes might be lost. Please review carefully
si_lk: මුල් වස්තුවේ අච්චුව නොදන්නා අතර සමහර ගුණාංග නැති විය හැක. කරුණාකර ප්රවේශමෙන් සමාලෝචනය කරන්න

source: Unkown original template
si_lk: නොදන්නා මුල් අච්චුව

source: Categ.
si_lk: වර්ගීකරණය.

source: Can not be merged automatically
si_lk: ස්වයංක්‍රීයව ඒකාබද්ධ කළ නොහැක

source: This attribute type is missing from the new template. It will be lost if not taken care of right now.
si_lk: මෙම උපලක්ෂණ වර්ගය නව අච්චුවෙන් මග හැරී ඇත. දැන්ම බලා නොගත්තොත් නැති වෙනවා.

source: Insert
si_lk: ඇතුල් කරන්න

source: No valid type. This attribute will be lost.
si_lk: වලංගු වර්ගයක් නැත. මෙම ගුණාංගය නැති වී යයි.

source: This attribute can be merged automatically. Injection in the template done.
si_lk: මෙම ගුණාංගය ස්වයංක්‍රීයව ඒකාබද්ධ කළ හැක. අච්චුව තුළ එන්නත් කිරීම සිදු කර ඇත.

source: Attributes to merge
si_lk: ඒකාබද්ධ කිරීම සඳහා ගුණාංග

source: Contextual information and actions
si_lk: සන්දර්භ තොරතුරු සහ ක්රියාවන්

source: Overwrite the current attribute value with this one
si_lk: වත්මන් ගුණාංග අගය මෙය සමඟ උඩින් ලියන්න

source: Original value:
si_lk: මුල් අගය:

source: Can be merged automatically. Injection done.
si_lk: ස්වයංක්රීයව ඒකාබද්ධ කළ හැක. එන්නත් කළා.

source: An instance of this attribute already exists. However, as multiple instances are allowed by this template, the two attributes will be kept.
si_lk: මෙම ගුණාංගයේ උදාහරණයක් දැනටමත් පවතී. කෙසේ වෙතත්, මෙම අච්චුව මඟින් අවස්ථා කිහිපයක් ඉඩ දී ඇති බැවින්, ගුණාංග දෙක තබා ගනු ඇත.

source: Enter value manually
si_lk: අතින් අගය ඇතුලත් කරන්න

source: Name :: Type
si_lk: නම :: වර්ගය

source: Skipped
si_lk: මග හැරිය

source: Attribute(s)
si_lk: ගුණාංග(ය)

source: Dropped Object references
si_lk: අතහැර දැමූ වස්තු යොමු

source: As these Attributes are converted into an Objects, the meaning of the Refences might change. If you whish to preserve the References, you will have to created them after the merge. Take note of them!
si_lk: මෙම ගුණාංග වස්තු බවට පරිවර්තනය කරන විට, යොමුවල අර්ථය වෙනස් විය හැක. ඔබට යොමු සංරක්ෂණය කිරීමට අවශ්‍ය නම්, ඒකාබද්ධ කිරීමෙන් පසුව ඔබට ඒවා නිර්මාණය කිරීමට සිදුවේ. ඒවා සැලකිල්ලට ගන්න!

source: The following References will be dropped after the merge:
si_lk: ඒකාබද්ධ කිරීමෙන් පසු පහත සඳහන් යොමු අත්හරිනු ඇත:

source: Merge above Attributes into an Object
si_lk: ඉහත ගුණාංග වස්තුවකට ඒකාබද්ධ කරන්න

source: Selected Attributes will be %s deleted
si_lk: තෝරාගත් ගුණාංග %s මකා දැමෙනු ඇත

source: Object reconstruction
si_lk: වස්තුව ප්රතිනිර්මාණය කිරීම

source: Due to a bug prior to version 2.4.89, a condition could cause objects to be overwritten on a pull, leading to orphaned object attributes. This script reconstructs the missing objects if any exist.
si_lk: 2.4.89 අනුවාදයට පෙර ඇති දෝෂයක් හේතුවෙන්, යම් කොන්දේසියක් මඟින් වස්තූන් ඇද ගැනීමක් මත නැවත ලිවීමට හේතු විය හැක, එය අනාථ වස්තු ගුණාංග වලට මග පාදයි. මෙම ස්ක්‍රිප්ටය අතුරුදහන් වූ වස්තූන් තිබේ නම් ඒවා ප්‍රතිනිර්මාණය කරයි.

source: Please create a backup of your mysql database before executing the script.
si_lk: ස්ක්‍රිප්ට් ක්‍රියාත්මක කිරීමට පෙර කරුණාකර ඔබගේ mysql දත්ත සමුදායේ උපස්ථයක් සාදන්න.

source: No unmapped data found, everything is working as expected.
si_lk: සිතියම්ගත නොකළ දත්ත හමු නොවීය, බලාපොරොත්තු වූ පරිදි සියල්ල ක්‍රියා කරයි.

source: Unmapped Attributes
si_lk: සිතියම්ගත නොකළ ගුණාංග

source: Keep in mind that some of the unmapped attributes can get reconstructed on a second pass of this script.
si_lk: සිතියම්ගත නොකළ සමහර උපලක්ෂණ මෙම ස්ක්‍රිප්ටයේ දෙවන අවසරය මත ප්‍රතිනිර්මාණය කළ හැකි බව මතක තබා ගන්න.

source: Reconstructable objects
si_lk: නැවත සකස් කළ හැකි වස්තූන්

source: Selected types:
si_lk: තෝරාගත් වර්ග:

source: No matching Object.
si_lk: ගැළපෙන වස්තුවක් නැත.

source: Object name
si_lk: වස්තුවේ නම

source: Compatiblity or Attribute type missing from the selection
si_lk: තේරීමෙන් ගැළපුම හෝ ගුණාංග වර්ගය මඟ හැරී ඇත

source: Compatiblity
si_lk: ගැළපෙන බව

source: This Object is compatible for the merge
si_lk: මෙම වස්තුව ඒකාබද්ධ කිරීම සඳහා අනුකූල වේ

source: This Attribute type cannot be part of this Object template. If you merge the selected Attributes into this object, all Attribute having this type will be ignored.
si_lk: මෙම Attribute වර්ගය මෙම Object අච්චුවේ කොටසක් විය නොහැක. ඔබ තෝරාගත් ගුණාංග මෙම වස්තුවට ඒකාබද්ධ කළහොත්, මෙම වර්ගය ඇති සියලුම ගුණාංග නොසලකා හරිනු ඇත.

source: This Attribute type is missing from the selection. Add it to the selection to be able to merge the selected Attributes into this Object.
si_lk: මෙම ගුණාංග වර්ගය තේරීමෙන් මඟ හැරී ඇත. තෝරාගත් ගුණාංග මෙම වස්තුවට ඒකාබද්ධ කිරීමට හැකි වන පරිදි තේරීමට එය එක් කරන්න.

source: This Attribute type is not allowed to be present multiple time in this Object. Consider only picking one.
si_lk: මෙම Attribute වර්ගය මෙම Object තුළ කිහිප වතාවක්ම පැවතීමට ඉඩ නොදේ. එකක් තෝරා ගැනීම පමණක් සලකා බලන්න.

source: Object pre-save review
si_lk: වස්තුව පෙර සුරැකීමේ සමාලෝචනය

source: Make sure that the below Object reflects your expectation before submitting it.
si_lk: පහත වස්තුව ඉදිරිපත් කිරීමට පෙර ඔබේ අපේක්ෂාව පිළිබිඹු කරන බවට වග බලා ගන්න.

source: To IDS
si_lk: IDS වෙත

source: Create new object
si_lk: නව වස්තුවක් සාදන්න

source: Update object
si_lk: වස්තුව යාවත්කාලීන කරන්න

source: Back to review
si_lk: සමාලෝචනය වෙත ආපසු

source: This event contains similar objects.
si_lk: මෙම සිදුවීම සමාන වස්තූන් අඩංගු වේ.

source: Instead of creating a new object, would you like to merge your new object into one of the following?
si_lk: නව වස්තුවක් නිර්මාණය කරනවා වෙනුවට, ඔබේ නව වස්තුව පහත සඳහන් දේවලින් එකකට ඒකාබද්ධ කිරීමට ඔබ කැමතිද?

source: All similar objects not displayed...
si_lk: සියලුම සමාන වස්තූන් ප්‍රදර්ශනය නොවේ...

source: %s Similar objects found. %s not displayed
si_lk: %s සමාන වස්තූන් හමු විය. %s දර්ශනය නොවේ

source: This attribute will NOT be merged into the similar object as it is conflicting with another attribute.
si_lk: මෙම ගුණාංගය වෙනත් ගුණාංගයක් සමඟ ගැටෙන බැවින් සමාන වස්තුවකට ඒකාබද්ධ නොවේ.

source: Object Deletion
si_lk: වස්තුව මකා දැමීම

source: The Object will be permanently deleted and unrecoverable. Also, this will prevent the deletion to be propagated to other instances.
si_lk: වස්තුව ස්ථිරවම මකා දැමෙනු ඇති අතර ආපසු ලබාගත නොහැක. එසේම, මෙය මකාදැමීම වෙනත් අවස්ථාවන්ට ප්‍රචාරණය වීම වළක්වයි.

source: Are you sure you want to %sdelete Object #%s? %s
si_lk: ඔබට Object%s%sඅවශ්‍ය බව විශ්වාසද? %s

source: Add Object attribute
si_lk: වස්තු ගුණාංගය එක් කරන්න

source: Add Organisation Blocklist Entries
si_lk: සංවිධානයේ වාරණ ලැයිස්තු ඇතුළත් කිරීම් එක් කරන්න

source: Blocklisting an organisation prevents the creation of any event by that organisation on this instance as well as syncing of that organisation's events to this instance. It does not prevent a local user of the blocklisted organisation from logging in and editing or viewing data. <br/>Paste a list of all the organisation UUIDs that you want to add to the blocklist below (one per line).
si_lk: සංවිධානයක් අවහිර කිරීම මෙම අවස්ථාවෙහිදී එම සංවිධානය විසින් කිසියම් සිදුවීමක් නිර්මාණය කිරීම මෙන්ම එම සංවිධානයේ සිදුවීම් මෙම අවස්ථාවට සමමුහුර්ත කිරීම වළක්වයි. එය අවහිර ලැයිස්තුගත සංවිධානයේ දේශීය පරිශීලකයෙකුට පුරනය වීම සහ දත්ත සංස්කරණය කිරීම හෝ බැලීම වලක්වන්නේ නැත. <br/>ඔබට පහත අවහිර ලැයිස්තුවට එක් කිරීමට අවශ්‍ය සියලුම සංවිධාන UUID ලැයිස්තුවක් අලවන්න (පේළියකට එකක්).

source: (Optional) The organisation name that the organisation is associated with
si_lk: (විකල්ප) සංවිධානය සම්බන්ධ වී ඇති සංවිධානයේ නම

source: Edit Organisation Blocklist Entries
si_lk: සංවිධානයේ වාරණ ලැයිස්තු ඇතුළත් කිරීම් සංස්කරණය කරන්න

source: Organisation Blocklists
si_lk: සංවිධානයේ වාරණ ලැයිස්තු

source: %s Organisation
si_lk: %s සංවිධානය

source: Mandatory Fields
si_lk: අනිවාර්ය ක්ෂේත්ර

source: Local organisation
si_lk: දේශීය සංවිධානය

source: Organisation Identifier
si_lk: සංවිධාන හැඳුනුම්කාරකය

source: Brief organisation identifier
si_lk: සංක්ෂිප්ත සංවිධාන හඳුනාගැනීම

source: Paste UUID or click generate
si_lk: UUID අලවන්න හෝ උත්පාදනය ක්ලික් කරන්න

source: Generate UUID
si_lk: UUID ජනනය කරන්න

source: Generate a new UUID for the organisation
si_lk: සංවිධානය සඳහා නව UUID ජනනය කරන්න

source: Optional Fields
si_lk: විකල්ප ක්ෂේත්ර

source: A brief description of the organisation
si_lk: සංවිධානය පිළිබඳ කෙටි විස්තරයක්

source: A description of the organisation that is purely informational.
si_lk: තනිකරම තොරතුරු සපයන සංවිධානය පිළිබඳ විස්තරයක්.

source: Bind user accounts to domains (line separated)
si_lk: පරිශීලක ගිණුම් වසම්වලට බඳින්න (රේඛාවෙන් වෙන් කර ඇත)

source: Enter a (list of) domain name(s) to enforce when creating users.
si_lk: පරිශීලකයන් නිර්මාණය කිරීමේදී බලාත්මක කිරීමට (ලැයිස්තුවේ) වසම් නාමයක් ඇතුළත් කරන්න.

source: Logo (48×48 PNG or SVG)
si_lk: ලාංඡනය (48×48 PNG හෝ SVG)

source: For example "financial".
si_lk: උදාහරණයක් ලෙස "මූල්ය".

source: Type of organisation
si_lk: සංවිධානයේ වර්ගය

source: Freetext description of the org.
si_lk: සංවිධානයේ නිදහස් පෙළ විස්තරය.

source: Contact details
si_lk: ඇමතුම් විස්තර

source: You can add some contact details for the organisation here, if applicable.
si_lk: අදාළ නම්, ඔබට සංවිධානය සඳහා සම්බන්ධතා තොරතුරු කිහිපයක් මෙහි එක් කළ හැක.

source: Local organisations
si_lk: දේශීය සංවිධාන

source: , both local and remote
si_lk: , දේශීය සහ දුරස්ථ යන දෙකම

source: Known remote organisations
si_lk: දන්නා දුරස්ථ සංවිධාන

source: on other instances
si_lk: වෙනත් අවස්ථා වලදී

source: All organisations
si_lk: සියලුම සංවිධාන

source: having a presence on this instance
si_lk: මෙම අවස්ථාවෙහි පෙනී සිටීම

source: Contacts
si_lk: සම්බන්ධතා

source: Added by
si_lk: විසින් එකතු කරන ලදී

source: Users
si_lk: පරිශීලකයන්

source: Restrictions
si_lk: සීමා

source: Are you sure you want to delete the Organisation?
si_lk: ඔබට සංවිධානය මැකීමට අවශ්‍ය බව විශ්වාසද?

source: Local or remote
si_lk: දේශීය හෝ දුරස්ථ

source: Remote
si_lk: දුරස්ථ

source: Domain restrictions
si_lk: වසම් සීමා කිරීම්

source: Last modified
si_lk: අවසන් වරට වෙනස් කරන ලදී

source: Organisation type
si_lk: සංවිධානයේ වර්ගය

source: Contact information
si_lk: සබඳතා තොරතුරු

source: Organisation
si_lk: ආයතනය

source: Members
si_lk: සාමාජිකයින්

source: Select organisations to add
si_lk: එකතු කිරීමට සංවිධාන තෝරන්න

source: Available Organisations
si_lk: පවතින සංවිධාන

source: Added Organisations
si_lk: එකතු කරන ලද සංවිධාන

source: Submit organisations
si_lk: සංවිධාන ඉදිරිපත් කරන්න

source: This will remove the selected organisation and hand over all objects belonging to it to the target organisation. This process is irreversible. Are you sure you want to proceed?
si_lk: මෙය තෝරාගත් සංවිධානය ඉවත් කර එයට අයත් සියලුම වස්තූන් ඉලක්කගත සංවිධානයට භාර දෙනු ඇත. මෙම ක්රියාවලිය ආපසු හැරවිය නොහැකි ය. ඔබට ඉදිරියට යාමට අවශ්‍ය බව විශ්වාසද?

source: Warning: Merging an organisation into another will be transfer all users and data belonging to the organisation to another.
si_lk: අවවාදයයි: සංවිධානයක් තවත් එකකට ඒකාබද්ධ කිරීම මඟින් සංවිධානයට අයත් සියලුම පරිශීලකයන් සහ දත්ත වෙනත් ස්ථානයකට මාරු කරනු ලැබේ.

source: Target Local Organisation
si_lk: ඉලක්කගත ප්‍රාදේශීය සංවිධානය

source: Target External Organisation
si_lk: ඉලක්කගත බාහිර සංවිධානය

source: Organisation to be merged
si_lk: ඒකාබද්ධ කළ යුතු සංවිධානය

source: Organisation to be merged into
si_lk: ඒකාබද්ධ කළ යුතු සංවිධානය

source: Merge
si_lk: ඒකාබද්ධ කරන්න

source: Mark organisation as sharing group extender
si_lk: සංවිධානය බෙදාගැනීමේ කණ්ඩායම් විස්තාරකයක් ලෙස සලකුණු කරන්න

source: Administrative actions
si_lk: පරිපාලන ක්රියා

source: Reset the attribute counts
si_lk: ගුණාංග ගණන් නැවත සකසන්න

source: Events need to have no validation issues
si_lk: සිදුවීම් වලංගු කිරීමේ ගැටළු නොතිබිය යුතුය

source: Recorrelate attributes
si_lk: ගුණාංග නැවත සම්බන්ධ කරන්න

source: Recorrelate proposals
si_lk: යෝජනා නැවත සම්බන්ධ කරන්න

source: Verify GnuPG keys
si_lk: GnuPG යතුරු තහවුරු කරන්න

source: Check whether every user's GnuPG key is usable
si_lk: සෑම පරිශීලකයෙකුගේම GnuPG යතුර භාවිතා කළ හැකිද යන්න පරීක්ෂා කරන්න

source: Verify Certificates
si_lk: සහතික තහවුරු කරන්න

source: Check whether every user's certificate is usable
si_lk: සෑම පරිශීලකයෙකුගේම සහතිකය භාවිතා කළ හැකිදැයි පරීක්ෂා කරන්න

source: Extend Organization length
si_lk: සංවිධානයේ දිග දිගු කරන්න

source: Hotfix 2.3.57: Increase the max length of the organization field when adding a new server connection.
si_lk: Hotfix 2.3.57: නව සේවාදායක සම්බන්ධතාවයක් එක් කරන විට සංවිධාන ක්ෂේත්‍රයේ උපරිම දිග වැඩි කරන්න.

source: Convert log fields to text
si_lk: ලොග් ක්ෂේත්‍ර පෙළ බවට පරිවර්තනය කරන්න

source: Hotfix 2.3.78: Some of the log fields that were varchar(255) ended up truncating the data. This function will change them to "text"
si_lk: Hotfix 2.3.78: varchar(255) වූ සමහර ලොග් ක්ෂේත්‍ර දත්ත කප්පාදු කිරීම අවසන් විය. මෙම කාර්යය ඒවා "පෙළ" ලෙස වෙනස් කරයි

source: Fix duplicate UUIDs
si_lk: අනුපිටපත් UUID නිවැරදි කරන්න

source: Hotfix 2.3.107: it was previously possible to get duplicate attribute UUIDs in the database, this script will remove all duplicates and ensure that duplicates will not be entered into the database in the future.
si_lk: Hotfix 2.3.107: දත්ත සමුදායේ අනුපිටපත් ගුණාංග UUID ලබා ගැනීමට පෙර හැකි විය, මෙම ස්ක්‍රිප්ට් මඟින් සියලුම අනුපිටපත් ඉවත් කර අනාගතයේදී අනුපිටපත් දත්ත ගබඩාවට ඇතුළු නොකරන බව සහතික කරයි.

source: Remove duplicate events (with the same UUID)
si_lk: අනුපිටපත් සිදුවීම් ඉවත් කරන්න (එකම UUID සමඟ)

source: Hotfix 2.3.115: In some rare situations it could occur that a duplicate of an event was created on an instance, with the exact same uuid. This action will remove any such duplicates and make sure that this cannot happen again.
si_lk: Hotfix 2.3.115: සමහර දුර්ලභ අවස්ථාවන්හිදී, යම් සිදුවීමක අනුපිටපතක් හරියටම එම uuid සමඟම නිර්මාණය විය හැකිය. මෙම ක්‍රියාව එවැනි අනුපිටපත් ඉවත් කර මෙය නැවත සිදු නොවන බවට වග බලා ගනී.

source: Prune orphaned attributes
si_lk: අනාථ ගුණාංග කප්පාදු කරන්න

source: In some rare occasions it can happen that you end up with some attributes in your database that do not belong to an event - for example during a race condition between an event insert and a delete. This tool will collect and delete any such orphaned attributes. If you ever run into an issue where you cannot add an attribute with a specific valid value, this is probably the reason.
si_lk: සමහර දුර්ලභ අවස්ථාවන්හිදී, සිදුවීමකට අයත් නොවන සමහර උපලක්ෂණ ඔබගේ දත්ත ගබඩාවේ ඇති වීම සිදුවිය හැක - උදාහරණයක් ලෙස, සිදුවීම් ඇතුලත් කිරීමක් සහ මැකීමක් අතර තරඟයක් අතරතුර. මෙම මෙවලම එවැනි අනාථ ගුණාංග එකතු කර මකනු ඇත. ඔබට නිශ්චිත වලංගු අගයක් සහිත උපලක්ෂණයක් එක් කළ නොහැකි ගැටලුවකට ඔබ කවදා හෝ මුහුණ දෙන්නේ නම්, මෙයට හේතුව විය හැකිය.

source: Clean regex table of potentially malicious entries
si_lk: විභව අනිෂ්ට ඇතුළත් කිරීම් වලින් regex වගුව පිරිසිදු කරන්න

source: Hotfix 2.3.160: Prior to this version it was possible for a user/admin with Regex permission to create a malicious regular expression that could be used to execute arbitrary code. Since this version it is no longer possible to input such expressions, but already existing malicious entries still have to be cleaned using this tool.
si_lk: Hotfix 2.3.160: මෙම අනුවාදයට පෙර Regex අවසරය ඇති පරිශීලකයෙකුට/පරිපාලකයෙකුට අත්තනෝමතික කේතය ක්‍රියාත්මක කිරීමට භාවිතා කළ හැකි අනිෂ්ට නිත්‍ය ප්‍රකාශනයක් නිර්මාණය කිරීමට හැකි විය. මෙම අනුවාදය නිසා තවදුරටත් එවැනි ප්‍රකාශන ඇතුළත් කළ නොහැකි නමුත් දැනටමත් පවතින අනිෂ්ට ඇතුළත් කිරීම් තවමත් මෙම මෙවලම භාවිතයෙන් පිරිසිදු කළ යුතුය.

source: Remove URL type attribute sanitisation
si_lk: URL වර්ගයේ උපලක්ෂණ සනීපාරක්ෂක ඉවත් කරන්න

source: Hotfix 2.3.173: Sanitised URLs can cause issues with the NIDS exports and as of this version attributes will be modified on entry to correct this. To correct existing entries, run this script.
si_lk: Hotfix 2.3.173: සනීපාරක්‍ෂක URL මගින් NIDS නිර්යාත සමඟ ගැටලු ඇති කළ හැකි අතර, මෙම අනුවාදයට අනුව මෙය නිවැරදි කිරීම සඳහා ඇතුළත් වූ විට ගුණාංග වෙනස් කරනු ලැබේ. පවතින ඇතුළත් කිරීම් නිවැරදි කිරීමට, මෙම ස්ක්‍රිප්ට් ධාවනය කරන්න.

source: Index tables
si_lk: දර්ශක වගු

source: This script will create indeces for all of the tables in MISP (other than primary keys)
si_lk: මෙම ස්ක්‍රිප්ට් MISP හි ඇති සියලුම වගු සඳහා indeces සාදනු ඇත (ප්‍රාථමික යතුරු හැර)

source: Fix non-empty sharing group IDs
si_lk: හිස් නොවන බෙදාගැනීමේ කණ්ඩායම් හැඳුනුම්පත් නිවැරදි කරන්න

source: This script will change the sharing_group_id to 0 in all non sharing group setting events and attributes)
si_lk: මෙම ස්ක්‍රිප්ටය සියලු බෙදාගැනීම් නොවන කණ්ඩායම් සැකසීම් සිදුවීම් සහ උපලක්ෂණ තුළ sharing_group_id 0 වෙත වෙනස් කරනු ඇත)

source: Upgrading a 2.3 instance to 2.4
si_lk: 2.3 අවස්ථාවක් 2.4 දක්වා උත්ශ්‍රේණි කිරීම

source: Warning: Running this scripts below can result in the loss of data. Make sure that you back your database up before running them.
si_lk: අවවාදයයි: මෙම ස්ක්‍රිප්ට් පහතින් ධාවනය කිරීම දත්ත නැති වීමට හේතු විය හැක. ඒවා ක්‍රියාත්මක කිරීමට පෙර ඔබේ දත්ත සමුදාය උපස්ථ කිරීමට වග බලා ගන්න.

source: The order for the 2.4 upgrade procedure is
si_lk: 2.4 උත්ශ්‍රේණි කිරීමේ ක්‍රියාපටිපාටිය සඳහා අනුපිළිවෙල වේ

source: %s - run this to migrate the 2.3 data to the 2.4 format
si_lk: %s - 2.3 දත්ත 2.4 ආකෘතියට සංක්‍රමණය කිරීමට මෙය ධාවනය කරන්න

source: Upgrade to 2.4
si_lk: 2.4 දක්වා උත්ශ්‍රේණි කරන්න

source: If it completes successful, run the %s to remove the fields that are specific to 2.3. Make sure that the migration of the data to the 2.4 format was successful (you can check the result in the audit logs). If you have run the 2.4 upgrade script previously but are running into SQL errors on the column 'org', run this script.
si_lk: එය සාර්ථක නම්, 2.3ට විශේෂිත වූ ක්ෂේත්‍ර ඉවත් කිරීමට %s ධාවනය කරන්න. 2.4 ආකෘතියට දත්ත සංක්‍රමණය කිරීම සාර්ථක වූ බවට වග බලා ගන්න (ඔබට විගණන ලඝු-සටහන් වල ප්‍රතිඵලය පරීක්ෂා කළ හැක). ඔබ මීට පෙර 2.4 උත්ශ්‍රේණිගත කිරීමේ ස්ක්‍රිප්ට් ධාවනය කර ඇති නමුත් 'org' තීරුවේ SQL දෝෂ වලට හසුවන්නේ නම්, මෙම ස්ක්‍රිප්ට් ධාවනය කරන්න.

source: 2.3->2.4 clean-up script
si_lk: 2.3->2.4 පිරිසිදු කිරීමේ ස්ක්‍රිප්ට්

source: If the migration of your data from 2.4 is not complete this will lead to the loss of data. Backing your DB up is highly recommended. Are you ready to start removing the obsolete fields?
si_lk: 2.4 වෙතින් ඔබේ දත්ත සංක්‍රමණය කිරීම සම්පූර්ණ නොවේ නම් මෙය දත්ත නැති වීමට හේතු වේ. ඔබගේ DB උපස්ථ කිරීම ඉතා නිර්දේශිතයි. යල් පැන ගිය ක්ෂේත්‍ර ඉවත් කිරීම ආරම්භ කිරීමට ඔබ සූදානම්ද?

source: Quick Start
si_lk: ඉක්මන් ආරම්භය

source: General Layout
si_lk: සාමාන්ය පිරිසැලසුම

source: General Concepts
si_lk: පොදු සංකල්ප

source: User Management and Global actions
si_lk: පරිශීලක කළමනාකරණය සහ ගෝලීය ක්‍රියා

source: Using the system
si_lk: පද්ධතිය භාවිතා කිරීම

source: Settings and Diagnostics
si_lk: සැකසීම් සහ රෝග විනිශ්චය

source: Blocklist
si_lk: අවහිර ලැයිස්තුව

source: User Management
si_lk: පරිශීලක කළමනාකරණය

source: Role Management
si_lk: භූමිකාව කළමනාකරණය

source: Logging
si_lk: ලොග් කිරීම

source: Administrative Tools
si_lk: පරිපාලන මෙවලම්
