Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: If the MISP.user_email_notification_ban setting is set, this setting will control how long no notification by email will be done. Expected format: integer, in minutes
si_lk: MISP.user_email_notification_ban සැකසුම සකසා ඇත්නම්, ඊමේල් මගින් දැනුම්දීමක් සිදු නොකෙරෙන කාලය මෙම සිටුවම පාලනය කරයි. අපේක්ෂිත ආකෘතිය: නිඛිල, මිනිත්තු වලින්

source: If the MISP.user_email_notification_ban setting is set, this setting will control how many notification by email can be send for the timeframe defined in MISP.user_email_notification_ban_time_threshold. Expected format: integer
si_lk: MISP.user_email_notification_ban සැකසුම සකසා ඇත්නම්, MISP.user_email_notification_ban_time_threshold හි අර්ථ දක්වා ඇති කාල රාමුව සඳහා විද්‍යුත් තැපෑලෙන් දැනුම්දීම් කීයක් යැවිය හැකිද යන්න මෙම සැකසීම පාලනය කරයි. අපේක්ෂිත ආකෘතිය: පූර්ණ සංඛ්යාව

source: Set a value to limit the number of email alerts that events can generate per creator organisation (for example, if an organisation pushes out 2000 events in one shot, only alert on the first 20).
si_lk: එක් නිර්මාපක සංවිධානයකට සිදුවීම් උත්පාදනය කළ හැකි විද්‍යුත් තැපැල් ඇඟවීම් ගණන සීමා කිරීමට අගයක් සකසන්න (උදාහරණයක් ලෙස, සංවිධානයක් එක් පහරකින් සිදුවීම් 2000ක් පිටතට තල්ලු කරන්නේ නම්, පළමු 20 ගැන පමණක් ඇඟවීම).

source: Enable this setting to start blocking alert e-mails for old events. The exact timing of what constitutes an old event is defined by MISP.block_old_event_alert_age.
si_lk: පැරණි සිදුවීම් සඳහා අනතුරු ඇඟවීමේ විද්‍යුත් තැපැල් අවහිර කිරීම ආරම්භ කිරීමට මෙම සැකසුම සබල කරන්න. MISP.block_old_event_alert_age මගින් පැරණි සිදුවීමක් යනු කුමක්ද යන්නෙහි නිශ්චිත වේලාව අර්ථ දක්වා ඇත.

source: If the MISP.block_old_event_alert setting is set, this setting will control how old an event can be for it to be alerted on. The "timestamp" field of the event is used. Expected format: integer, in days
si_lk: MISP.block_old_event_alert සැකසුම සකසා ඇත්නම්, මෙම සිටුවම මඟින් සිදුවීමක් අනතුරු ඇඟවීම සඳහා කොපමණ පැරණි විය හැකිද යන්න පාලනය කරයි. සිදුවීමේ "වේලා මුද්දර" ක්ෂේත්‍රය භාවිතා වේ. අපේක්ෂිත ආකෘතිය: පූර්ණ සංඛ්යාව, දින තුළ

source: If the MISP.block_old_event_alert setting is set, this setting will control the threshold for the event.date field, indicating how old an event can be for it to be alerted on. The "date" field of the event is used. Expected format: integer, in days
si_lk: MISP.block_old_event_alert සැකසුම සකසා ඇත්නම්, මෙම සැකසුම event.date ක්ෂේත්‍රය සඳහා වන එළිපත්ත පාලනය කරනු ඇත, එය අනතුරු ඇඟවීමට සිදුවීමක් කොපමණ පැරණි විය හැකිද යන්න දක්වයි. සිදුවීමේ "දිනය" ක්ෂේත්‍රය භාවිතා වේ. අපේක්ෂිත ආකෘතිය: පූර්ණ සංඛ්යාව, දින තුළ

source: Please indicate the temp directory you wish to use for certain functionalities in MISP. By default this is set to /tmp and will be used among others to store certain temporary files extracted from imports during the import process.
si_lk: MISP හි ඇතැම් ක්‍රියාකාරීත්වයන් සඳහා ඔබ භාවිතා කිරීමට බලාපොරොත්තු වන තාවකාලික නාමාවලිය සඳහන් කරන්න. පෙරනිමියෙන් මෙය /tmp ලෙස සකසා ඇති අතර ආනයන ක්‍රියාවලියේදී ආයාත වලින් උපුටා ගන්නා ලද ඇතැම් තාවකාලික ගොනු ගබඩා කිරීමට අනෙකුත් ඒවා අතර භාවිතා කරනු ඇත.

source: If you would like to customise the css, simply drop a css file in the /var/www/MISP/app/webroot/css directory and enter the name here.
si_lk: ඔබට css අභිරුචිකරණය කිරීමට අවශ්‍ය නම්, සරලව css ගොනුවක් /var/www/MISP/app/webroot/css නාමාවලියට දමා එහි නම ඇතුළත් කරන්න.

source: Enable this setting to allow blocking attributes from to_ids sensitive exports if a proposal has been made to it to remove the IDS flag or to remove the attribute altogether. This is a powerful tool to deal with false-positives efficiently.
si_lk: IDS ධජය ඉවත් කිරීමට හෝ උපලක්ෂණ සම්පූර්ණයෙන්ම ඉවත් කිරීමට යෝජනාවක් ඉදිරිපත් කර ඇත්නම් to_ids සංවේදී නිර්යාතවලින් උපලක්ෂණ අවහිර කිරීමට ඉඩ දීමට මෙම සැකසුම සබල කරන්න. ව්‍යාජ ධනාත්මක කරුණු සමඟ කාර්යක්ෂමව කටයුතු කිරීමට මෙය ප්‍රබල මෙවලමකි.

source: Enable this settings if new tags synced / added via incoming events from any source should not be selectable by users by default.
si_lk: කිසියම් මූලාශ්‍රයකින් පැමිණෙන සිදුවීම් හරහා නව ටැග් සමමුහුර්ත කර ඇත්නම් / එකතු කළහොත් පෙරනිමියෙන් පරිශීලකයින්ට තෝරා ගත නොහැකි නම් මෙම සැකසීම් සබල කරන්න.

source: *WARNING* This setting will completely disable the correlation on this instance and remove any existing saved correlations. Enabling this will trigger a full recorrelation of all data which is an extremely long and costly procedure. Only enable this if you know what you're doing.
si_lk: *අවවාදයයි* මෙම සිටුවම මෙම අවස්ථාවෙහි සහසම්බන්ධය සම්පූර්ණයෙන්ම අක්‍රිය කරන අතර පවතින සුරකින ලද සහසම්බන්ධතා ඉවත් කරයි. මෙය සක්‍රීය කිරීම අතිශය දීර්ඝ හා මිල අධික ක්‍රියා පටිපාටියක් වන සියලුම දත්තවල පූර්ණ ප්‍රතිසම්බන්ධයක් ඇති කරයි. ඔබ කරන්නේ කුමක්දැයි ඔබ දන්නේ නම් පමණක් මෙය සබල කරන්න.

source: *WARNING* This setting will give event creators the possibility to disable the correlation of individual events / attributes that they have created.
si_lk: *අවවාදයයි* මෙම සැකසුම සිදුවීම් නිර්මාපකයින්ට ඔවුන් විසින් නිර්මාණය කර ඇති තනි සිදුවීම් / ගුණාංගවල සහසම්බන්ධතාවය අක්‍රිය කිරීමට හැකියාව ලබා දෙනු ඇත.

source: The host running the redis server to be used for generic MISP tasks such as caching. This is not to be confused by the redis server used by the background processing.
si_lk: හැඹිලිගත කිරීම වැනි සාමාන්‍ය MISP කාර්යයන් සඳහා භාවිතා කිරීමට redis සේවාදායකය ධාවනය කරන ධාරකය. පසුබිම් සැකසුම් මගින් භාවිතා කරන redis සේවාදායකය විසින් මෙය ව්‍යාකූල කළ යුතු නොවේ.

source: The port used by the redis server to be used for generic MISP tasks such as caching. This is not to be confused by the redis server used by the background processing.
si_lk: හැඹිලිගත කිරීම වැනි සාමාන්‍ය MISP කාර්යයන් සඳහා භාවිතා කිරීමට redis සේවාදායකය විසින් භාවිතා කරන තොට. පසුබිම් සැකසුම් මගින් භාවිතා කරන redis සේවාදායකය විසින් මෙය ව්‍යාකූල කළ යුතු නොවේ.

source: The database on the redis server to be used for generic MISP tasks. If you run more than one MISP instance, please make sure to use a different database on each instance.
si_lk: සාමාන්‍ය MISP කාර්යයන් සඳහා භාවිතා කිරීමට redis සේවාදායකයේ දත්ත සමුදාය. ඔබ MISP අවස්ථා එකකට වඩා ධාවනය කරන්නේ නම්, කරුණාකර එක් එක් අවස්ථාව සඳහා වෙනස් දත්ත සමුදායක් භාවිතා කිරීමට වග බලා ගන්න.

source: The password on the redis server (if any) to be used for generic MISP tasks.
si_lk: සාමාන්‍ය MISP කාර්යයන් සඳහා භාවිතා කිරීමට redis සේවාදායකයේ මුරපදය (ඇත්නම්).

source: Specify which fields to filter on when you search on the event view. Default values are : "id, uuid, value, comment, type, category, Tag.name"
si_lk: ඔබ සිදුවීම් දසුන මත සොයන විට කුමන ක්ෂේත්‍ර පෙරහන් කළ යුතුද යන්න සඳහන් කරන්න. පෙරනිමි අගයන් වන්නේ : "id, uuid, value, comment, type, category, Tag.name"

source: Set this to false if you would like to disable MISP managing its own worker processes (for example, if you are managing the workers with a systemd unit).
si_lk: ඔබ MISP එහිම සේවක ක්‍රියාවලි කළමනාකරණය අක්‍රිය කිරීමට කැමති නම් මෙය අසත්‍ය ලෙස සකසන්න (උදාහරණයක් ලෙස, ඔබ systemd ඒකකයක් සමඟින් කම්කරුවන් කළමනාකරණය කරන්නේ නම්).

source: Only enable this if you have some tools using MISP with extreme high concurency. General performance will be lower as normal as certain transactional queries are avoided in favour of shorter table locks.
si_lk: ඔබට MISP භාවිතා කරන සමහර මෙවලම් ඉතා ඉහළ සමගාමීතාවයක් තිබේ නම් පමණක් මෙය සබල කරන්න. කෙටි මේස අගුලුවලට පක්ෂව ඇතැම් ගණුදෙණු විමසීම් මඟහරින බැවින් සාමාන්‍ය කාර්ය සාධනය සාමාන්‍ය පරිදි අඩු වනු ඇත.

source: Sets the minimum time before being able to re-trigger an update if the previous one failed. (safe guard to avoid starting the same update multiple time)
si_lk: පෙර එක අසාර්ථක වුවහොත් යාවත්කාලීනයක් නැවත ක්‍රියාරම්භ කිරීමට හැකි වීමට පෙර අවම කාලය සකසයි. (එකම යාවත්කාලීනය කිහිප වතාවක් ආරම්භ කිරීම වැළැක්වීම සඳහා ආරක්ෂිත ආරක්ෂාවක්)

source: This is a performance tweak to change the behaviour of restSearch to use attribute filters solely for blocking. This means that a lookup on the event scope with for example the type field set will be ignored unless it's used to strip unwanted attributes from the results. If left disabled, passing [ip-src, ip-dst] for example will return any event with at least one ip-src or ip-dst attribute. This is generally not considered to be too useful and is a heavy burden on the database.
si_lk: මෙය අවහිර කිරීම සඳහා පමණක් attribute filters භාවිතා කිරීමට restSearch හි හැසිරීම වෙනස් කිරීම සඳහා වූ කාර්ය සාධන වෙනස් කිරීමකි. මෙයින් අදහස් කරන්නේ ප්‍රතිඵලවලින් අනවශ්‍ය උපලක්ෂණ ඉවත් කිරීමට භාවිතා කරන්නේ නම් මිස, උදාහරණයක් ලෙස වර්ග ක්ෂේත්‍ර කට්ටලය සමඟ සිදුවීම් විෂය පථය පිළිබඳ සොයා බැලීමක් නොසලකා හරින බවයි. අබල කර ඇත්නම්, උදාහරණයක් ලෙස [ip-src, ip-dst] පසු කිරීම අවම වශයෙන් එක් ip-src හෝ ip-dst ගුණාංගයක් සහිත ඕනෑම සිදුවීමක් ආපසු ලබා දෙනු ඇත. මෙය සාමාන්‍යයෙන් ඉතා ප්‍රයෝජනවත් යැයි නොසැලකෙන අතර එය දත්ත සමුදායට විශාල බරක් වේ.

source: Name of enrichment module that will be used for attachment malware scanning. This module must return av-signature or sb-signature object.
si_lk: ඇමුණුම් අනිෂ්ට මෘදුකාංග ස්කෑන් කිරීම සඳහා භාවිතා කරනු ලබන සුපෝෂිත මොඩියුලයේ නම. මෙම මොඩියුලය av-අත්සන හෝ sb-අත්සන වස්තුව ආපසු ලබා දිය යුතුය.

source: Send to attachment scan module just file hash. This can be useful if module sends attachment to remote service and you don't want to leak real data.
si_lk: ඇමුණුම් ස්කෑන් මොඩියුලයට යවන්න හුදෙක් ගොනු හැෂ්. මොඩියුලය දුරස්ථ සේවාවට ඇමුණුමක් යවන්නේ නම් සහ ඔබට සැබෑ දත්ත කාන්දු කිරීමට අවශ්‍ය නැතිනම් මෙය ප්‍රයෝජනවත් විය හැක.

source: How long to wait for scan results in seconds.
si_lk: තත්පර කිහිපයකින් ස්කෑන් ප්‍රතිඵල සඳහා කොපමණ කාලයක් බලා සිටිය යුතුද.

source: Enable warning list triggers regardless of the IDS flag value.
si_lk: IDS ධජ අගය නොසලකා අනතුරු ඇඟවීමේ ලැයිස්තු ප්‍රේරක සක්‍රීය කරන්න.

source: Enable storing setting in database.
si_lk: දත්ත සමුදායේ ගබඩා කිරීමේ සැකසුම් සක්රිය කරන්න.

source: Custom right menu URL.
si_lk: අභිරුචි දකුණු මෙනු URL.

source: Custom right menu text (it is possible to use HTML).
si_lk: අභිරුචි දකුණු මෙනු පෙළ (එය HTML භාවිතා කළ හැක).

source: Allows server synchronisation connections to be filtered on Attribute type or Object name. Warning: This feature can potentially cause your synchronisation partners to receive incomplete versions of the events you are propagating on behalf of others. This means that even if they would be receiving the unfiltered version through another instance, your filtered version might be the one they receive on a first-come-first-serve basis.
si_lk: ගුණාංග වර්ගය හෝ වස්තු නාමය මත සේවාදායක සමමුහුර්තකරණ සම්බන්ධතා පෙරීමට ඉඩ දෙන්න. අවවාදයයි: මෙම විශේෂාංගය ඔබගේ සමමුහුර්ත කිරීමේ හවුල්කරුවන්ට ඔබ අන් අය වෙනුවෙන් ප්‍රචාරණය කරන සිදුවීම්වල අසම්පූර්ණ අනුවාද ලබා ගැනීමට හේතු විය හැක. මෙයින් අදහස් කරන්නේ ඔවුන් වෙනත් අවස්ථාවක් හරහා පෙරීම නොකළ අනුවාදය ලබා ගන්නේ නම්, ඔබේ පෙරහන කළ අනුවාදය ඔවුන්ට පළමුවෙන් පැමිණි අයට පළමුව සේවා පදනම මත ලැබෙන එකක් විය හැකි බවයි.

source: The location of the GnuPG executable. If you would like to use a different GnuPG executable than /usr/bin/gpg, you can set it here. If the default is fine, just keep the setting suggested by MISP.
si_lk: GnuPG ක්‍රියාත්මක කළ හැකි ස්ථානය. ඔබ /usr/bin/gpg ට වඩා වෙනස් GnuPG ක්‍රියාත්මක කිරීමට කැමති නම්, ඔබට එය මෙහි සැකසිය හැක. පෙරනිමිය හොඳ නම්, MISP විසින් යෝජනා කරන ලද සැකසුම තබා ගන්න.

source: Allow (false) unencrypted e-mails to be sent to users that don't have a GnuPG key.
si_lk: GnuPG යතුරක් නොමැති පරිශීලකයින්ට (ව්‍යාජ) සංකේතනය නොකළ ඊමේල් යැවීමට ඉඩ දෙන්න.

source: Allow (false) the body of unencrypted e-mails to contain details about the event.
si_lk: සංකේතනය නොකළ විද්‍යුත් තැපෑලෙහි (අසත්‍ය) සිදුවීම පිළිබඳ විස්තර අඩංගු කිරීමට ඉඩ දෙන්න.

source: Enable the signing of GnuPG emails. By default, GnuPG emails are signed
si_lk: GnuPG ඊමේල් අත්සන් කිරීම සබල කරන්න. පෙරනිමියෙන්, GnuPG ඊමේල් අත්සන් කර ඇත

source: The e-mail address that the instance's GnuPG key is tied to.
si_lk: නිදර්ශනයේ GnuPG යතුර බැඳ ඇති විද්‍යුත් තැපැල් ලිපිනය.

source: The password (if it is set) of the GnuPG key of the instance.
si_lk: උදාහරණයේ GnuPG යතුරේ මුරපදය (එය සකසා ඇත්නම්).

source: The location of the GnuPG homedir.
si_lk: GnuPG homedir හි පිහිටීම.

source: When enabled, the subject in signed and encrypted e-mails will not be sent in unencrypted form.
si_lk: සබල කළ විට, අත්සන් කරන ලද සහ සංකේතනය කළ විද්‍යුත් තැපෑලෙහි ඇති විෂය සංකේතනය නොකළ ආකාරයෙන් යවනු නොලැබේ.

source: Enable S/MIME encryption. The encryption posture of the GnuPG.onlyencrypted and GnuPG.bodyonlyencrypted settings are inherited if S/MIME is enabled.
si_lk: S/MIME සංකේතනය සබල කරන්න. S/MIME සබල කර ඇත්නම් GnuPG.onlyencrypted සහ GnuPG.bodyonlyencrypted සැකසුම් වල සංකේතන ඉරියව්ව උරුම වේ.

source: The e-mail address that the instance's S/MIME key is tied to.
si_lk: නිදර්ශනයේ S/MIME යතුර බැඳ ඇති විද්‍යුත් තැපැල් ලිපිනය.

source: The location of the public half of the signing certificate.
si_lk: අත්සන් කිරීමේ සහතිකයේ පොදු භාගයේ පිහිටීම.

source: The location of the private half of the signing certificate.
si_lk: අත්සන් කිරීමේ සහතිකයේ පෞද්ගලික භාගයේ පිහිටීම.

source: The password (if it is set) of the S/MIME key of the instance.
si_lk: උදාහරණයේ S/MIME යතුරේ මුරපදය (එය සකසා ඇත්නම්).

source: The hostname of an HTTP proxy for outgoing sync requests. Leave empty to not use a proxy.
si_lk: පිටතට යන සමමුහුර්ත ඉල්ලීම් සඳහා HTTP ප්‍රොක්සියක සත්කාරක නාමය. ප්‍රොක්සියක් භාවිතා නොකිරීමට හිස්ව තබන්න.

source: The TCP port for the HTTP proxy.
si_lk: HTTP ප්‍රොක්සි සඳහා TCP වරාය.

source: The authentication method for the HTTP proxy. Currently supported are Basic or Digest. Leave empty for no proxy authentication.
si_lk: HTTP ප්‍රොක්සි සඳහා සත්‍යාපන ක්‍රමය. දැනට සහය දක්වන්නේ Basic හෝ Digest වේ. ප්‍රොක්සි සත්‍යාපනය සඳහා හිස්ව තබන්න.

source: The authentication username for the HTTP proxy.
si_lk: HTTP ප්‍රොක්සි සඳහා සත්‍යාපන පරිශීලක නාමය.

source: The authentication password for the HTTP proxy.
si_lk: HTTP ප්‍රොක්සි සඳහා සත්‍යාපන මුරපදය.

source: Disabling this setting will remove all form tampering protection. Do not set this setting pretty much ever. You were warned.
si_lk: මෙම සැකසුම අක්‍රිය කිරීමෙන් සියලු ආකාර විකෘති කිරීමේ ආරක්ෂාව ඉවත් කරනු ඇත. මෙම සැකසුම කිසි විටෙක බොහෝ දුරට සකසන්න එපා. ඔබට අවවාද කළා.

source: Enforce CSP. Content Security Policy (CSP) is an added layer of security that helps to detect and mitigate certain types of attacks, including Cross Site Scripting (XSS) and data injection attacks. When disabled, violations will be just logged.
si_lk: CSP බලාත්මක කරන්න. අන්තර්ගත ආරක්ෂණ ප්‍රතිපත්තිය (CSP) යනු Cross Site Scripting (XSS) සහ දත්ත එන්නත් ප්‍රහාර ඇතුළුව ඇතැම් ප්‍රහාර හඳුනා ගැනීමට සහ අවම කිරීමට උපකාර වන අමතර ආරක්ෂක ස්ථරයකි. අබල කළ විට, උල්ලංඝනය කිරීම් පමණක් ලොග් වනු ඇත.

source: The salt used for the hashed passwords. You cannot reset this from the GUI, only manually from the settings.php file. Keep in mind, this will invalidate all passwords in the database.
si_lk: හැෂ් මුරපද සඳහා භාවිතා කරන ලුණු. ඔබට මෙය GUI වෙතින් නැවත සැකසිය නොහැක, settings.php ගොනුවෙන් අතින් පමණි. මතක තබා ගන්න, මෙය දත්ත සමුදායේ ඇති සියලුම මුරපද අවලංගු කරයි.

source: By default API authentication failures that happen within the same hour for the same key are omitted and a single log entry is generated. This allows administrators to more easily keep track of attackers that try to brute force API authentication, by reducing the noise generated by expired API keys. On the other hand, this makes little sense for internal MISP instances where detecting the misconfiguration of tools becomes more interesting, so if you fall into the latter category, enable this feature.
si_lk: පෙරනිමියෙන් එකම යතුර සඳහා එකම පැයක් ඇතුළත සිදු වන API සත්‍යාපන අසාර්ථකත්වයන් ඉවත් කර තනි ලොග් ප්‍රවේශයක් ජනනය වේ. කල් ඉකුත් වූ API යතුරු මගින් ජනනය වන ඝෝෂාව අඩු කිරීම මගින්, API සත්‍යාපනය බ්‍රට් ෆෝර්ස් කිරීමට උත්සාහ කරන ප්‍රහාරකයින් වඩාත් පහසුවෙන් නිරීක්ෂණය කිරීමට පරිපාලකයින්ට මෙය ඉඩ සලසයි. අනෙක් අතට, මෙවලම්වල වැරදි වින්‍යාසය හඳුනා ගැනීම වඩාත් සිත්ගන්නාසුළු වන අභ්‍යන්තර MISP අවස්ථා සඳහා මෙය එතරම් තේරුමක් නැත, එබැවින් ඔබ දෙවන කාණ්ඩයට වැටෙන්නේ නම්, මෙම විශේෂාංගය සක්‍රීය කරන්න.

source: Advanced authkeys will allow each user to create and manage a set of authkeys for themselves, each with individual expirations and comments. API keys are stored in a hashed state and can no longer be recovered from MISP. Users will be prompted to note down their key when creating a new authkey. You can generate a new set of API keys for all users on demand in the diagnostics page, or by triggering %s.
si_lk: උසස් authkeys විසින් එක් එක් පරිශීලකයාට තමන් සඳහා තනි තනි කල් ඉකුත්වීම් සහ අදහස් සහිතව, තමන් සඳහා Autkey කට්ටලයක් නිර්මාණය කිරීමට සහ කළමනාකරණය කිරීමට ඉඩ ලබා දේ. API යතුරු හැෂ් තත්වයක ගබඩා කර ඇති අතර MISP වෙතින් තවදුරටත් ප්‍රතිසාධනය කළ නොහැක. නව authkey එකක් සෑදීමේදී ඔවුන්ගේ යතුර සටහන් කිරීමට පරිශීලකයින් පොළඹවනු ඇත. ඔබට ඉල්ලුම මත සියලුම පරිශීලකයින් සඳහා API යතුරු කට්ටලයක් රෝග විනිශ්චය පිටුවේ හෝ %sක්‍රියාරම්භ කිරීමෙන් ජනනය කළ හැක.

source: the advanced upgrade
si_lk: උසස් වැඩිදියුණු කිරීම

source: Maximal key lifetime in days. Use can limit that validity even more. Just newly created keys will be affected. When not set, key validity is not limited.
si_lk: දින තුළ උපරිම ප්රධාන ආයු කාලය. භාවිතයෙන් එම වලංගු භාවය තවත් සීමා කළ හැක. අලුතින් සාදන ලද යතුරු පමණක් බලපානු ඇත. සකසා නොමැති විට, ප්රධාන වලංගුභාවය සීමා නොවේ.

source: When enabled, session is kept between API requests.
si_lk: සබල කළ විට, API ඉල්ලීම් අතර සැසිය තබා ඇත.

source: This optionally can be enabled if an external auth provider is used. When set to true, it will disable the default form authentication.
si_lk: බාහිර සත්‍යාපන සැපයුම්කරුවෙකු භාවිතා කරන්නේ නම් මෙය විකල්ප වශයෙන් සක්‍රීය කළ හැක. සත්‍ය ලෙස සකසා ඇති විට, එය පෙරනිමි පෝරම සත්‍යාපනය අක්‍රිය කරයි.

source: Enable this setting if you wish for users to be able to query any arbitrary URL via the rest client. Keep in mind that queries are executed by the MISP server, so internal IPs in your MISP's network may be reachable.
si_lk: පරිශීලකයින්ට ඉතිරි සේවාලාභියා හරහා ඕනෑම අත්තනෝමතික URL එකක් විමසීමට ඔබට අවශ්‍ය නම් මෙම සැකසුම සබල කරන්න. විමසුම් MISP සේවාදායකය මඟින් ක්‍රියාත්මක වන බව මතක තබා ගන්න, එබැවින් ඔබේ MISP ජාලයේ අභ්‍යන්තර IP වෙත ළඟා විය හැකිය.

source: If left empty, the baseurl of your MISP is used. However, in some instances (such as port-forwarded VM installations) this will not work. You can override the baseurl with a url through which your MISP can reach itself (typically https://127.0.0.1 would work).
si_lk: හිස්ව තැබුවහොත්, ඔබේ MISP හි baseurl භාවිතා වේ. කෙසේ වෙතත්, සමහර අවස්ථාවලදී (වරාය-ඉදිරිපත් කළ VM ස්ථාපනයන් වැනි) මෙය ක්‍රියා නොකරයි. ඔබට ඔබගේ MISP වෙත ළඟා විය හැකි url එකක් සමඟින් baseurl අභිබවා යා හැක (සාමාන්‍යයෙන් https://127.0.0.1 ක්‍රියා කරයි).

source: Enable this setting to pass all audit log entries directly to syslog. Keep in mind, this is verbose and will include user, organisation, event data.
si_lk: සියලුම විගණන ලොග් ඇතුළත් කිරීම් කෙලින්ම syslog වෙත යැවීමට මෙම සැකසුම සක්‍රීය කරන්න. මතක තබා ගන්න, මෙය වාචික වන අතර පරිශීලක, සංවිධානය, සිදුවීම් දත්ත ඇතුළත් වේ.

source: Write syslog messages also to standard error output.
si_lk: සම්මත දෝෂ ප්‍රතිදානයට syslog පණිවිඩ ද ලියන්න.

source: Syslog message identifier.
si_lk: Syslog පණිවිඩ හැඳුනුම්කාරකය.

source: If enabled, any authkey will be replaced by asterisks in Audit log.
si_lk: සබල කර ඇත්නම්, ඕනෑම Autkey එකක් විගණන ලොගයේ තරු ලකුණු මගින් ප්‍රතිස්ථාපනය වේ.

source: If enabled, HTTP headers that block browser cache will be send. Static files (like images or JavaScripts) will still be cached, but not generated pages.
si_lk: සබල කර ඇත්නම්, බ්‍රවුසර හැඹිලිය අවහිර කරන HTTP ශීර්ෂ යවනු ලැබේ. ස්ථිතික ගොනු (පින්තූර හෝ JavaScripts වැනි) තවමත් හැඹිලිගත වනු ඇත, නමුත් පිටු ජනනය නොවේ.

source: If enabled, any POST, PUT or AJAX request will be allow just when Sec-Fetch-Site header is not defined or contains "same-origin".
si_lk: සබල කර ඇත්නම්, ඕනෑම POST, PUT හෝ AJAX ඉල්ලීමක් Sec-Fetch-Site ශීර්ෂකය නිර්වචනය කර නොමැති විට හෝ "එකම-සම්භවය" අඩංගු විට පමණක් ඉඩ දෙනු ඇත.

source: If enabled, MISP server will consider all requests as secure. This is usually useful when you run MISP behind reverse proxy that terminates HTTPS.
si_lk: සබල කර ඇත්නම්, MISP සේවාදායකය සියලු ඉල්ලීම් ආරක්ෂිත ලෙස සලකනු ඇත. ඔබ HTTPS අවසන් කරන ප්‍රතිලෝම ප්‍රොක්සි පිටුපස MISP ධාවනය කරන විට මෙය සාමාන්‍යයෙන් ප්‍රයෝජනවත් වේ.

source: Enable two step authentication with a OTP sent by email. Requires e-mailing to be enabled. Warning: You cannot use it in combination with external authentication plugins.
si_lk: විද්‍යුත් තැපෑලෙන් එවන ලද OTP සමඟ පියවර දෙකක සත්‍යාපනය සක්‍රීය කරන්න. විද්‍යුත් තැපෑල සක්‍රීය කිරීම අවශ්‍ය වේ. අවවාදයයි: ඔබට එය බාහිර සත්‍යාපන ප්ලගීන සමඟ ඒකාබද්ධව භාවිතා කළ නොහැක.

source: Define the length of the OTP code sent by email
si_lk: විද්‍යුත් තැපෑලෙන් එවන ලද OTP කේතයේ දිග නිර්වචනය කරන්න

source: Define the validity (in minutes) of the OTP code sent by email
si_lk: විද්‍යුත් තැපෑලෙන් එවන ලද OTP කේතයේ වලංගුභාවය (මිනිත්තු වලින්) නිර්වචනය කරන්න

source: The message sent to the user when a new OTP is requested. Use \n for line-breaks. The following variables will be automatically replaced in the text: $otp = the new OTP generated by MISP, $username = the user's e-mail address, $org the Organisation managing the instance, $misp = the url of this instance, $contact = the e-mail address used to contact the support team (as set in MISP.contact), $ip the IP used to complete the first step of the login and $validity the validity time in minutes.
si_lk: නව OTP එකක් ඉල්ලූ විට පරිශීලකයාට යවන පණිවිඩය. රේඛා බිඳීම් සඳහා \n භාවිතා කරන්න. පහත විචල්‍යයන් පෙළ තුළ ස්වයංක්‍රීයව ප්‍රතිස්ථාපනය වනු ඇත: $otp = MISP මගින් ජනනය කරන ලද නව OTP, $username = පරිශීලකයාගේ විද්‍යුත් තැපැල් ලිපිනය, $org අවස්ථාව කළමනාකරණය කරන සංවිධානය, $misp = මෙම අවස්ථාවෙහි url, $contact = විද්‍යුත් තැපෑල උපකාරක කණ්ඩායම සම්බන්ධ කර ගැනීමට භාවිතා කරන ලිපිනය (MISP.contact හි පිහිටුවා ඇති පරිදි), $ip පුරනය වීමේ පළමු පියවර සම්පූර්ණ කිරීමට භාවිතා කරන IP සහ $validity වලංගු කාලය මිනිත්තු කිහිපයකින්.

source: A comma separated list of emails for which the OTP is disabled. Note that if you remove someone from this list, the OTP will only be asked at next login.
si_lk: OTP අක්‍රිය කර ඇති ඊමේල් කොමාවෙන් වෙන් කළ ලැයිස්තුවක්. ඔබ මෙම ලැයිස්තුවෙන් යමෙකු ඉවත් කළහොත්, OTP විමසනු ලබන්නේ ඊළඟ පිවිසුමේදී පමණක් බව සලකන්න.

source: Enabling this setting will allow users to have access to the pre-auth registration form. This will create an inbox entry for administrators to review.
si_lk: මෙම සැකසුම සක්‍රීය කිරීමෙන් පරිශීලකයින්ට පූර්ව සත්‍යාපනය ලියාපදිංචි කිරීමේ පෝරමයට ප්‍රවේශ වීමට ඉඩ සලසයි. මෙය පරිපාලකයින්ට සමාලෝචනය කිරීමට එන ලිපි ප්‍රවේශයක් සාදනු ඇත.

source: The message sent shown to anyone trying to self-register.
si_lk: ස්වයං-ලියාපදිංචියට උත්සාහ කරන ඕනෑම කෙනෙකුට යවන ලද පණිවිඩය පෙන්වයි.

source: Password length requirement. If it is not set or it is set to 0, then the default value is assumed (12).
si_lk: මුරපද දිග අවශ්‍යතාවය. එය සකසා නොමැති නම් හෝ එය 0 ලෙස සකසා ඇත්නම්, පෙරනිමි අගය උපකල්පනය කරනු ලැබේ (12).

source: Password complexity requirement. Leave it empty for the default setting (3 out of 4, with either a digit or a special char) or enter your own regex. Keep in mind that the length is checked in another key. Default (simple 3 out of 4 or minimum 16 characters): /^((?=.*\d)|(?=.*\W+))(?![\n])(?=.*[A-Z])(?=.*[a-z]).*$|.{16,}/
si_lk: මුරපද සංකීර්ණතා අවශ්‍යතාවය. පෙරනිමි සැකසුම සඳහා එය හිස්ව තබන්න (4න් 3ක්, ඉලක්කමක් හෝ විශේෂ අක්ෂරයක් සමඟ) හෝ ඔබේම regex ඇතුළත් කරන්න. දිග වෙනත් යතුරකින් පරීක්ෂා කර ඇති බව මතක තබා ගන්න. පෙරනිමිය (සරල 4 න් 3 හෝ අවම අක්ෂර 16): /^((?=.*\d)|(?=.*\W+))(?![\n])(?=.*[A-Z])(? =.*[a-z]).*$|.{16,}/
