Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: The name of the authentication method, this is cosmetic only and will be shown on the user creation page and logs.
si_lk: සත්‍යාපන ක්‍රමයේ නම, මෙය රූපලාවන්‍ය සඳහා පමණක් වන අතර පරිශීලක නිර්මාණ පිටුවේ සහ ලොගවල පෙන්වනු ඇත.

source: Disable the logout button for users authenticate with the external auth mechanism.
si_lk: බාහිර සත්‍යාපන යාන්ත්‍රණය සමඟින් සත්‍යාපනය කරන පරිශීලකයින් සඳහා පිටවීමේ බොත්තම අක්‍රීය කරන්න.

source: Enable/disable the enrichment services
si_lk: පොහොසත් කිරීමේ සේවාවන් සබල/අබල කරන්න

source: Set a timeout for the enrichment services
si_lk: පොහොසත් කිරීමේ සේවා සඳහා කාල සීමාවක් සකසන්න

source: Enable/disable the import services
si_lk: ආනයන සේවා සබල/අබල කරන්න

source: Set a timeout for the import services
si_lk: ආනයන සේවා සඳහා කාල සීමාවක් සකසන්න

source: The url used to access the import services. By default, it is accessible at http://127.0.0.1:6666
si_lk: ආනයන සේවා වෙත ප්‍රවේශ වීමට භාවිතා කරන url. පෙරනිමියෙන්, එය http://127.0.0.1:6666 හි ප්‍රවේශ විය හැක

source: The port used to access the import services. By default, it is accessible at 127.0.0.1:6666
si_lk: ආනයන සේවා වෙත ප්‍රවේශ වීමට භාවිතා කරන වරාය. පෙරනිමියෙන්, එය 127.0.0.1:6666 හිදී ප්‍රවේශ විය හැක

source: The url used to access the export services. By default, it is accessible at http://127.0.0.1:6666
si_lk: අපනයන සේවා වෙත ප්‍රවේශ වීමට භාවිතා කරන url. පෙරනිමියෙන්, එය http://127.0.0.1:6666 හි ප්‍රවේශ විය හැක

source: The port used to access the export services. By default, it is accessible at 127.0.0.1:6666
si_lk: අපනයන සේවා වෙත ප්‍රවේශ වීමට භාවිතා කරන වරාය. පෙරනිමියෙන්, එය 127.0.0.1:6666 හිදී ප්‍රවේශ විය හැක

source: Enable/disable the export services
si_lk: අපනයන සේවා සබල/අබල කරන්න

source: Set a timeout for the export services
si_lk: අපනයන සේවා සඳහා කාල සීමාවක් සකසන්න

source: Enable/disable the hover over information retrieved from the enrichment modules
si_lk: පොහොසත් කිරීමේ මොඩියුලවලින් ලබාගත් තොරතුරු මත සැරිසැරීම සබල/අබල කරන්න

source: When enabled, users have to click on the magnifier icon to show the enrichment
si_lk: සක්‍රීය කළ විට, පරිශීලකයන් පොහොසත් කිරීම පෙන්වීමට විශාලන නිරූපකය මත ක්ලික් කළ යුතුය

source: Set a timeout for the hover services
si_lk: hover සේවා සඳහා කාල සීමාවක් සකසන්න

source: The url used to access the enrichment services. By default, it is accessible at http://127.0.0.1:6666
si_lk: පොහොසත් කිරීමේ සේවාවන් වෙත ප්‍රවේශ වීමට භාවිතා කරන url. පෙරනිමියෙන්, එය http://127.0.0.1:6666 හි ප්‍රවේශ විය හැක

source: The port used to access the enrichment services. By default, it is accessible at 127.0.0.1:6666
si_lk: පොහොසත් කිරීමේ සේවාවන් වෙත ප්‍රවේශ වීමට භාවිතා කරන වරාය. පෙරනිමියෙන්, එය 127.0.0.1:6666 හි ප්රවේශ විය හැක

source: The url used to access Cortex. By default, it is accessible at http://cortex-url
si_lk: Cortex වෙත පිවිසීමට භාවිතා කරන url. පෙරනිමියෙන්, එය http://cortex-url හි ප්‍රවේශ විය හැක

source: The port used to access Cortex. By default, this is port 9000
si_lk: Cortex වෙත පිවිසීමට භාවිතා කරන ලද වරාය. පෙරනිමියෙන්, මෙය වරාය 9000 වේ

source: Enable/disable the Cortex services
si_lk: Cortex සේවා සබල/අබල කරන්න

source: Set an authentication key to be passed to Cortex
si_lk: Cortex වෙත යැවීමට සත්‍යාපන යතුරක් සකසන්න

source: Set a timeout for the Cortex services
si_lk: Cortex සේවා සඳහා කාල සීමාවක් සකසන්න

source: Set to false to disable SSL verification. This is not recommended.
si_lk: SSL සත්‍යාපනය අක්‍රිය කිරීමට අසත්‍ය ලෙස සකසන්න. මෙය නිර්දේශ නොකරයි.

source: Set to false if you wish to ignore hostname match errors when validating certificates.
si_lk: සහතික වලංගු කිරීමේදී සත්කාරක නාම ගැලපුම් දෝෂ නොසලකා හැරීමට ඔබට අවශ්‍ය නම් අසත්‍ය ලෙස සකසන්න.

source: Set to true to enable self-signed certificates to be accepted. This requires Cortex_ssl_verify_peer to be enabled.
si_lk: ස්වයං-අත්සන් කළ සහතික පිළිගැනීමට සබල කිරීමට සත්‍ය ලෙස සකසන්න. මෙයට Cortex_ssl_verify_peer සබල කිරීම අවශ්‍ය වේ.

source: Set to the absolute path of the Certificate Authority file that you wish to use for verifying SSL certificates.
si_lk: SSL සහතික සත්‍යාපනය කිරීම සඳහා ඔබ භාවිතා කිරීමට බලාපොරොත්තු වන සහතික අධිකාරී ගොනුවේ නිරපේක්ෂ මාර්ගය සකසන්න.

source: Provide your custom authentication users with an external URL to the authentication system to reset their passwords.
si_lk: ඔබේ අභිරුචි සත්‍යාපන පරිශීලකයින්ට ඔවුන්ගේ මුරපද යළි පිහිටුවීම සඳහා සත්‍යාපන පද්ධතියට බාහිර URL එකක් ලබා දෙන්න.

source: Provide a custom logout URL for your users that will log them out using the authentication system you use.
si_lk: ඔබ භාවිතා කරන සත්‍යාපන පද්ධතිය භාවිතයෙන් ඉවත් වන ඔබේ පරිශීලකයින් සඳහා අභිරුචි පිටවීමේ URL එකක් ලබා දෙන්න.

source: Enable lookups for additional relations via CyCat.
si_lk: CyCat හරහා අමතර සම්බන්ධතා සඳහා සෙවීම් සබල කරන්න.

source: URL to use for CyCat lookups, if enabled.
si_lk: සබල කර ඇත්නම්, CyCat සෙවීම් සඳහා භාවිතා කිරීමට URL.

source: Enables or disables background jobs with Supervisor backend.
si_lk: සුපරීක්ෂක පසුපෙළ සමඟ පසුබිම් රැකියා සක්‍රිය හෝ අක්‍රීය කරයි.

source: The host running the redis server to be used for background jobs.
si_lk: පසුබිම් වැඩ සඳහා භාවිතා කිරීමට redis සේවාදායකය ධාවනය කරන ධාරකය.

source: The port used by the redis server to be used for background jobs.
si_lk: පසුබිම් වැඩ සඳහා භාවිතා කිරීමට redis සේවාදායකය විසින් භාවිතා කරන වරාය.

source: The database on the redis server to be used for background jobs. If you run more than one MISP instance, please make sure to use a different database or redis_namespace on each instance.
si_lk: රෙඩිස් සේවාදායකයේ දත්ත සමුදාය පසුබිම් රැකියා සඳහා භාවිතා කළ යුතුය. ඔබ MISP අවස්ථා එකකට වඩා ධාවනය කරන්නේ නම්, කරුණාකර එක් එක් අවස්ථාව සඳහා වෙනස් දත්ත සමුදායක් හෝ redis_namespace භාවිතා කිරීමට වග බලා ගන්න.

source: The password on the redis server (if any) to be used for background jobs.
si_lk: රෙඩිස් සේවාදායකයේ මුරපදය (ඇත්නම්) පසුබිම් රැකියා සඳහා භාවිතා කළ යුතුය.

source: The namespace to be used for the background jobs related keys.
si_lk: පසුබිම් රැකියා සම්බන්ධ යතුරු සඳහා භාවිත කළ යුතු නාම අවකාශය.

source: The time in seconds the job statuses history will be kept.
si_lk: තත්පර කිහිපයක කාලය රැකියා තත්ව ඉතිහාසය තබා ගනු ඇත.

source: The host where the Supervisor XML-RPC API is running.
si_lk: Supervisor XML-RPC API ධාවනය වන ධාරකය.

source: The port where the Supervisor XML-RPC API is running.
si_lk: Supervisor XML-RPC API ධාවනය වන වරාය.

source: The user of the Supervisor XML-RPC API.
si_lk: Supervisor XML-RPC API හි පරිශීලකයා.

source: The password of the Supervisor XML-RPC API.
si_lk: Supervisor XML-RPC API හි මුරපදය.

source: The debug level of the instance, always use 0 for production instances.
si_lk: නිදසුනෙහි නිදොස් මට්ටම, නිෂ්පාදන අවස්ථා සඳහා සෑම විටම 0 භාවිතා කරන්න.

source: The debug level of the instance for site admins. This feature allows site admins to run debug mode on a live instance without exposing it to other users. The most verbose option of debug and site_admin_debug is used for site admins.
si_lk: අඩවි පරිපාලකයින් සඳහා වන නිදොස් කිරීමේ මට්ටම. මෙම විශේෂාංගය අඩවි පරිපාලකයින්ට වෙනත් පරිශීලකයින්ට එය නිරාවරණය නොකර සජීවී අවස්ථාවකදී නිදොස් කිරීමේ මාදිලිය ධාවනය කිරීමට ඉඩ සලසයි. නිදොස්කරණය සහ site_admin_debug හි වඩාත්ම වාචික විකල්පය අඩවි පරිපාලකයින් සඳහා භාවිතා වේ.

source: Certain administrative tasks are exposed to the API, these help with maintaining and configuring MISP in an automated way / via external tools.
si_lk: සමහර පරිපාලන කාර්යයන් API වෙත නිරාවරණය වේ, මේවා ස්වයංක්‍රීය ආකාරයකින් / බාහිර මෙවලම් හරහා MISP නඩත්තු කිරීමට සහ වින්‍යාස කිරීමට උපකාරී වේ.

source: Administering MISP via the CLI
si_lk: CLI හරහා MISP පරිපාලනය කිරීම

source: If you would like to automate tasks such as caching feeds or pulling from server instances, you can do it using the following command line tools. Simply execute the given commands via the command line / create cron jobs easily out of them.
si_lk: ඔබ හැඹිලි සංග්‍රහයන් හෝ සේවාදායක අවස්ථා වලින් ඉවත් කිරීම වැනි කාර්යයන් ස්වයංක්‍රීය කිරීමට කැමති නම්, ඔබට පහත විධාන රේඛා මෙවලම් භාවිතයෙන් එය කළ හැක. ලබා දී ඇති විධානයන් විධාන රේඛාව හරහා ක්‍රියාත්මක කරන්න / ඒවායින් පහසුවෙන් ක්‍රෝන් රැකියා සාදන්න.

source: Automating certain console tasks
si_lk: සමහර කොන්සෝල කාර්යයන් ස්වයංක්‍රීය කිරීම

source: The events can be managed via the CLI in addition to the UI / API management tools
si_lk: UI / API කළමනාකරණ මෙවලම් වලට අමතරව CLI හරහා සිදුවීම් කළමනාකරණය කළ හැක

source: Managing the events
si_lk: සිදුවීම් කළමනාකරණය කිරීම

source: The background workers can be managed via the CLI in addition to the UI / API management tools
si_lk: UI / API කළමනාකරණ මෙවලම් වලට අමතරව පසුබිම් සේවකයින් CLI හරහා කළමනාකරණය කළ හැක

source: Managing the background workers
si_lk: පසුබිම් සේවකයින් කළමනාකරණය කිරීම

source: Pulling %s event.
si_lk: %s ඉසව්ව අදින්න.

source: Others
si_lk: අන් අය

source: Invalid context.
si_lk: වලංගු නොවන සන්දර්භය.

source: An ID or UUID must be provided if the context is set.
si_lk: සන්දර්භය සකසා ඇත්නම් ID හෝ UUID සැපයිය යුතුය.

source: Could not resolve Sightingdb address.
si_lk: Sightingdb ලිපිනය විසඳීමට නොහැකි විය.

source: Something went wrong. Could not contact the SightingDB server.
si_lk: මොකක්හරි වැරැද්දක් වෙලා. SightingDB සේවාදායකය සම්බන්ධ කර ගැනීමට නොහැකි විය.

source: The SightingDB returned an invalid response.
si_lk: SightingDB අවලංගු ප්‍රතිචාරයක් ලබා දුන්නේය.

source: No response from the SightingDB server.
si_lk: SightingDB සේවාදායකයෙන් ප්‍රතිචාර නැත.

source: Taxonomy `%s` is an exclusive Taxonomy
si_lk: වර්ගීකරණය `%sයනු සුවිශේෂී වර්ගීකරණයකි

source: Predicate `%s` is exclusive
si_lk: පුරෝකථනය `%sසුවිශේෂී වේ

source: Reseting all API keys
si_lk: සියලුම API යතුරු නැවත සකසමින්

source: Reset in progress - %s/%s.
si_lk: යළි පිහිටුවීම සිදු වෙමින් පවතී%s%s.

source: %s authkeys reset, %s could not be reset
si_lk: %s authkeys යළි පිහිටුවයි, %s නැවත සැකසිය නොහැක

source: Dear user, an API key reset has been triggered by an administrator for your user account on %s. Your new API key is: %s Please update your server's sync setup to reflect this change. We apologise for the inconvenience.
si_lk: හිතවත් පරිශීලක, API යතුර යළි පිහිටුවීමක් %sඔබේ පරිශීලක ගිණුම සඳහා පරිපාලකයෙකු විසින් ක්‍රියාත්මක කර ඇත. ඔබගේ නව API යතුර වන්නේ: %s මෙම වෙනස පිළිබිඹු කිරීමට කරුණාකර ඔබගේ සේවාදායකයේ සමමුහුර්ත සැකසුම යාවත්කාලීන කරන්න. අපහසුතාවයට අපි සමාව අයදිමු.

source: Dear user, an API key reset has been triggered by an administrator for your user account on %s. Your new API key can be retrieved by logging in using this sync user's account. Please update your server's sync setup to reflect this change. We apologise for the inconvenience.
si_lk: හිතවත් පරිශීලක, API යතුර යළි පිහිටුවීමක් %sඔබේ පරිශීලක ගිණුම සඳහා පරිපාලකයෙකු විසින් ක්‍රියාත්මක කර ඇත. මෙම සමමුහුර්ත පරිශීලක ගිණුම භාවිතයෙන් පුරනය වීමෙන් ඔබගේ නව API යතුර ලබා ගත හැක. මෙම වෙනස පිළිබිඹු කිරීමට කරුණාකර ඔබගේ සේවාදායකයේ සමමුහුර්ත සැකසුම යාවත්කාලීන කරන්න. අපහසුතාවයට අපි සමාව අයදිමු.

source: API key reset by administrator
si_lk: පරිපාලක විසින් API යතුර යළි පිහිටුවීම

source: User is not banned to sent email notification
si_lk: යවන ලද විද්‍යුත් තැපැල් දැනුම්දීම පරිශීලකයාට තහනම් නොවේ

source: Reason: Could not reach redis to check user email notification ban status.
si_lk: හේතුව: පරිශීලක විද්‍යුත් තැපැල් දැනුම්දීම් තහනම් තත්ත්වය පරීක්ෂා කිරීමට redis වෙත ළඟා විය නොහැකි විය.

source: Reason: User is banned from sending out emails (%s notification tried to be sent). Ban will be lifted in %smin %ssec.
si_lk: හේතුව: පරිශීලකයාට ඊමේල් යැවීම තහනම් කර ඇත (%s දැනුම්දීම් යැවීමට උත්සාහ කර ඇත). තහනම විනාඩි %sතත්පර %sකින් ඉවත් කෙරේ.

source: User email notification ban setting is not enabled
si_lk: පරිශීලක විද්‍යුත් තැපැල් දැනුම්දීම් තහනම් සැකසීම සබල කර නැත

source: Found %s subkey that have expired.
si_lk: කල් ඉකුත් වූ උප යතුර %s ක් හමු විය.

source: Found %s subkey that is sign only.
si_lk: ලකුණක් පමණක් වන උප යතුර %s ක් හමු විය.

source: This endpoint expects both a setting and a value to be set.
si_lk: මෙම අන්ත ලක්ෂ්‍යය සැකසුම සහ අගය යන දෙකම සැකසිය යුතුයැයි අපේක්ෂා කරයි.

source: `%s` is not valid CIDR
si_lk: `%sවලංගු CIDR නොවේ

source: `%s` is not valid regular expression
si_lk: `%s` වලංගු නිත්‍ය ප්‍රකාශනය නොවේ

source: False positive
si_lk: වැරදි ධනාත්මක

source: Known identifier
si_lk: දන්නා හඳුනාගැනීම

source: The implementation of the decaying formula from the paper `An indicator scoring method for MISP platforms`.
si_lk: "MISP වේදිකා සඳහා දර්ශක ලකුණු කිරීමේ ක්‍රමයක්" පත්‍රයෙන් දිරායන සූත්‍රය ක්‍රියාත්මක කිරීම.

source: The implementation of the decaying formula from the paper `An indicator scoring method for MISP platforms` with support of the `Retention` taxonomy which overrides the final score.
si_lk: අවසාන ලකුණු අභිබවා යන 'රඳවා ගැනීමේ' වර්ගීකරණයේ සහය ඇතිව 'MISP වේදිකා සඳහා දර්ශක ලකුණු කිරීමේ ක්‍රමයක්' පත්‍රයෙන් දිරාපත් සූත්‍රය ක්‍රියාත්මක කිරීම.

source: `Retention` taxonomy not available
si_lk: 'රඳවා ගැනීම' වර්ගීකරණය ලබා ගත නොහැක

source: deleted
si_lk: මකා දමන ලදී

source: added
si_lk: එකතු කළා

source: updated
si_lk: යාවත්කාලීන කරන ලදී

source: it has the following dependent items
si_lk: එයට පහත යැපෙන අයිතම ඇත

source: Add Signature Allowedlist
si_lk: අත්සන් අවසර ලැයිස්තුව එක් කරන්න

source: Edit Signature Allowedlist
si_lk: අත්සන අවසර ලත් ලැයිස්තුව සංස්කරණය කරන්න

source: Signature Allowedlist
si_lk: අවසර ලත් අත්සන ලැයිස්තුව

source: Regex entries (in the standard php regex /{regex}/{modifier} format) entered below will restrict matching attributes from being included in the IDS flag sensitive exports (such as NIDS exports).
si_lk: පහත ඇතුලත් කර ඇති Regex ඇතුලත් කිරීම් (සම්මත php regex /{regex}/{modifier} ආකෘතියෙන්) IDS ධජ සංවේදී අපනයන (NIDS නිර්යාත වැනි) තුළ ඇතුළත් කිරීමෙන් ගැළපෙන ගුණාංග සීමා කරනු ඇත.

source: ID
si_lk: හැඳුනුම්පත

source: Are you sure you want to delete the entry?
si_lk: ඔබට ප්‍රවේශය මැකීමට අවශ්‍ය බව විශ්වාසද?

source: Add Attribute
si_lk: Attribute එකතු කරන්න

source: Edit Attribute
si_lk: ගුණාංගය සංස්කරණය කරන්න

source: (choose one)
si_lk: (එකක් තෝරන්න)

source: (choose category first)
si_lk: (පළමුව කාණ්ඩය තෝරන්න)

source: Sharing Group
si_lk: බෙදාගැනීමේ කණ්ඩායම

source: Contextual Comment
si_lk: සන්දර්භාත්මක අදහස් දැක්වීම

source: For Intrusion Detection System
si_lk: ආක්‍රමණය හඳුනාගැනීමේ පද්ධතිය සඳහා

source: Timezone missing, auto-detected as:
si_lk: වේලා කලාපය අස්ථානගත වී ඇත, ස්වයංක්‍රීයව අනාවරණය කරගත්තේ:

source: The following value will be submitted instead:
si_lk: ඒ වෙනුවට පහත අගය ඉදිරිපත් කරනු ලැබේ:

source: Value is not a valid datetime. Expected format YYYY-MM-DDTHH:mm:ssZ
si_lk: අගය වලංගු දින වේලාවක් නොවේ. අපේක්ෂිත ආකෘතිය YYYY-MM-DDTHH:mm:ssZ

source: Add Attachment(s)
si_lk: ඇමුණුම් (ය) එක් කරන්න

source: Category
si_lk: වර්ගය

source: Distribution
si_lk: බෙදා හැරීම

source: Is a malware sample (encrypt and hash)
si_lk: අනිෂ්ට මෘදුකාංග සාම්පලයක් (සංකේතනය සහ හැෂ්)

source: Advanced extraction is not installed
si_lk: උසස් නිස්සාරණය ස්ථාපනය කර නැත

source: Advanced extraction
si_lk: උසස් නිස්සාරණය

source: Upload
si_lk: උඩුගත කරන්න

source: Import ThreatConnect CSV file
si_lk: ThreatConnect CSV ගොනුව ආයාත කරන්න

source: Alternate Search Results
si_lk: විකල්ප සෙවුම් ප්‍රතිඵල

source: This is a list of events that match the given search criteria sorted according to the percentage of matched attributes that are marked as IDS signatures (blue = IDS matches, red = non IDS matches).
si_lk: මෙය IDS අත්සන් (නිල් = IDS ගැලපීම්, රතු = IDS නොවන ගැළපීම්) ලෙස ලකුණු කර ඇති ගැළපෙන උපලක්ෂණ ප්‍රතිශතයට අනුව අනුපිළිවෙලට සකසන ලද සෙවුම් නිර්ණායකවලට ගැළපෙන සිදුවීම් ලැයිස්තුවකි.

source: Org
si_lk: සංවිධානය

source: Event date
si_lk: සිදුවීම් දිනය

source: Event graph
si_lk: සිදුවීම් ප්රස්ථාරය

source: Matches
si_lk: තරග

source: Attribute Count
si_lk: ගුණාංග ගණන

source: Choose a category and a type, then paste a list of IOCs that match the selection into the field below. This will delete all of the attributes not found in the new inserted list, whilst creating the attributes that are in the new list but don't exist as attributes. Found matches will be left untouched.
si_lk: ප්‍රවර්ගයක් සහ වර්ගයක් තෝරන්න, පසුව තේරීමට ගැලපෙන IOC ලැයිස්තුවක් පහත ක්ෂේත්‍රයට අලවන්න. මෙය නව ලැයිස්තුවේ ඇති නමුත් උපලක්ෂණ ලෙස නොපවතින ගුණාංග නිර්මාණය කරන අතරම, නව ඇතුළත් කළ ලැයිස්තුවේ නොමැති සියලුම ගුණාංග මකා දමයි. සොයාගත් ගැලපීම් නොදැමෙනු ඇත.

source: (first choose category)
si_lk: (පළමු කාණ්ඩය තෝරන්න)

source: Mark all new attributes as to IDS
si_lk: සියලුම නව ගුණාංග IDS ලෙස සලකුණු කරන්න

source: Values
si_lk: වටිනාකම්

source: Warning: You are about to share data that is of a classified nature (Attribution / targeting data). Make sure that you are authorised to share this.
si_lk: අවවාදයයි: ඔබ වර්ගීකෘත ස්වභාවයක් ඇති දත්ත බෙදා ගැනීමට සූදානම් වේ (ආරෝපණය / ඉලක්ක දත්ත). මෙය බෙදා ගැනීමට ඔබට අවසර ඇති බව සහතික කර ගන්න.

source: Replace attributes
si_lk: ගුණාංග ආදේශ කරන්න

source: Replaceattributes
si_lk: ආදේශන ගුණාංග

source: Submit
si_lk: ඉදිරිපත් කරන්න

source: Cancel
si_lk: අවලංගු කරන්න

source: Failed Composites
si_lk: අසාර්ථක සංයුක්ත

source: No Failed Composites
si_lk: අසාර්ථක සංයුක්ත නොමැත

source: Attributes
si_lk: ගුණාංග

source: Event
si_lk: සිදුවීම

source: Category
si_lk: වර්ගය

source: Value
si_lk: වටිනාකම

source: Galaxies
si_lk: මන්දාකිණි

source: Comment
si_lk: අදහස් දක්වන්න

source: Correlate
si_lk: සහසම්බන්ධ කරන්න

source: Related Events
si_lk: අදාළ සිදුවීම්

source: Feed hits
si_lk: සංග්‍රහ පහර

source: Sightings
si_lk: දසුන්

source: Activity
si_lk: ක්රියාකාරිත්වය

source: Propose deletion
si_lk: මකාදැමීමට යෝජනා කරන්න

source: Propose enrichment
si_lk: පොහොසත් කිරීම යෝජනා කරන්න

source: Propose enrichment through Cortex
si_lk: Cortex හරහා පොහොසත් කිරීම යෝජනා කරන්න

source: Add enrichment
si_lk: පොහොසත් කිරීම එකතු කරන්න

source: Add enrichment via Cortex
si_lk: Cortex හරහා පොහොසත් කිරීම එකතු කරන්න

source: Soft delete attribute
si_lk: මෘදු මකා දැමීමේ ගුණාංගය

source: Permanently delete attribute
si_lk: ගුණාංගය ස්ථිරවම මකන්න

source: Listing invalid attribute validations
si_lk: වලංගු නොවන ගුණාංග වලංගු කිරීම් ලැයිස්තුගත කිරීම

source: Validation errors for attribute:
si_lk: ගුණාංග සඳහා වලංගු කිරීමේ දෝෂ:

source: Value found:
si_lk: සොයාගත් අගය:

source: Error
si_lk: දෝෂයකි

source: [Attribute details]
si_lk: [ගුණාංග විස්තර]

source: Search Attribute
si_lk: සෙවුම් ගුණාංගය

source: You can search for attributes based on contained expression within the value, event ID, submitting organisation, category and type. <br />For the value, event ID and organisation, you can enter several search terms by entering each term as a new line. To exclude things from a result, use the NOT operator (!) in front of the term.
si_lk: වටිනාකම, සිදුවීම් හැඳුනුම, ඉදිරිපත් කරන සංවිධානය, වර්ගය සහ වර්ගය තුළ අඩංගු ප්‍රකාශනය මත පදනම්ව ඔබට ගුණාංග සෙවිය හැක. <br />අගය, සිදුවීම් හැඳුනුම්පත සහ සංවිධානය සඳහා, ඔබට එක් එක් පදය නව පේළියක් ලෙස ඇතුළත් කිරීමෙන් සෙවුම් පද කිහිපයක් ඇතුළත් කළ හැකිය. ප්‍රතිඵලයකින් දේවල් බැහැර කිරීමට, පදය ඉදිරියෙන් NOT ක්‍රියාකරු (!) භාවිතා කරන්න.

source: For string searches (such as searching for an expression, tags, etc) - lookups are simple string matches. If you want a substring match encapsulate the lookup string between "%" characters.
si_lk: තන්තු සෙවීම් සඳහා (ප්‍රකාශනයක් සෙවීම, ටැග්, ආදිය) - සෙවීම් සරල තන්තු ගැලපීම් වේ. ඔබට උපස්ථර ගැලපීමක් අවශ්‍ය නම් "%" අක්ෂර අතර සෙවුම් තන්තුව කොටු කරන්න.

source: Containing the following expressions
si_lk: පහත ප්‍රකාශන අඩංගු වේ

source: Having tag or being an attribute of an event having the tag
si_lk: ටැගය තිබීම හෝ ටැගය ඇති සිදුවීමක ගුණාංගයක් වීම

source: Being attributes of the following event IDs, event UUIDs or attribute UUIDs
si_lk: පහත සිදුවීම් IDs, Event UUIDs හෝ attribute UUID වල ගුණාංග වීම

source: From the following organisation(s)
si_lk: පහත සංවිධාන(ය) වෙතින්

source: Only find IOCs flagged as to IDS
si_lk: IDS ලෙස සලකුණු කර ඇති IOC පමණක් සොයා ගන්න

source: First seen and Last seen
si_lk: මුලින්ම දැක්කා සහ අන්තිමට දැක්කා

source: Attributes not having first seen or last seen set might not appear in the search
si_lk: මුලින්ම දැක නැති හෝ අවසන් වරට දැක නැති ගුණාංග සෙවුමේ දිස් නොවිය හැක

source: Attribute Deletion
si_lk: ගුණාංග මකා දැමීම

source: Are you sure you want to hard-delete Attribute #%s? The Attribute will be permanently deleted and unrecoverable. Also, this will prevent the deletion to be propagated to other instances.
si_lk: ඔබට Attribute #%sඅමාරුවෙන් මකා දැමීමට අවශ්‍ය බව විශ්වාසද? ගුණාංගය ස්ථිරවම මකා දැමෙනු ඇති අතර ආපසු ලබාගත නොහැක. එසේම, මෙය මකාදැමීම වෙනත් අවස්ථාවන්ට ප්‍රචාරණය වීම වළක්වයි.

source: Are you sure you want to soft-delete Attribute #%s? The Attribute will only be soft deleted, meaning that it is not completely purged. Click on Include deleted attributes and delete the soft deleted attribute if you want to permanently remove it.
si_lk: ඔබට Attribute #%sමෘදු ලෙස මකා දැමීමට අවශ්‍ය බව විශ්වාසද? Attribute මෘදු ලෙස මකා දැමෙනු ඇත, එයින් අදහස් වන්නේ එය සම්පූර්ණයෙන්ම පිරිසිදු කර නැති බවයි. ඔබට එය ස්ථිරවම ඉවත් කිරීමට අවශ්‍ය නම් Include Deleted attributes මත ක්ලික් කර මෘදු මකා දැමූ ගුණාංගය මකන්න.

source: Accept change
si_lk: වෙනස පිළිගන්න

source: Discard change
si_lk: වෙනස් කිරීම ඉවතලන්න

source: Do not alter current settings
si_lk: වත්මන් සැකසුම් වෙනස් නොකරන්න

source: Create proposals
si_lk: යෝජනා සාදන්න

source: Correlations
si_lk: සහසම්බන්ධතා

source: Enable correlations
si_lk: සහසම්බන්ධතා සබල කරන්න

source: Disable correlations
si_lk: සහසම්බන්ධතා අබල කරන්න

source: Leave this field empty to leave the comment field of the selected attributes unaltered.
si_lk: තෝරාගත් උපලක්ෂණවල අදහස් ක්ෂේත්‍රය වෙනස් නොකර තැබීමට මෙම ක්ෂේත්‍රය හිස්ව තබන්න.

source: Tags to <b>remove</b>
si_lk: ටැග් <b>ඉවත් කරන්න</b>

source: Tags to <b>add</b>
si_lk: ටැග් <b>ට</b>එකතු කරන්න

source: Clusters to <b>remove</b>
si_lk: පොකුරු <b>සිට ඉවත් කිරීම</b>

source: Clusters to <b>add</b>
si_lk: පොකුරු <b>ට</b>එකතු කරන්න

source: Toggle IDS flag %s
si_lk: IDS ධජය %s ටොගල් කරන්න

source: on
si_lk: මත

source: off
si_lk: අක්රිය

source: Set the IDS flag for this attribute.
si_lk: මෙම ගුණාංගය සඳහා IDS ධජය සකසන්න.

source: Unset the IDS flag for this attribute.
si_lk: මෙම ගුණාංගය සඳහා IDS ධජය නොසකසන්න.

source: Toggle IDS flag for attribute
si_lk: ගුණාංගය සඳහා IDS ධජය ටොගල් කරන්න

source: Attribute Restoration
si_lk: ගුණාංග ප්රතිෂ්ඨාපනය

source: Are you sure you want to undelete Attribute #%s?
si_lk: ඔබට Attribute #%sඉවත් කිරීමට අවශ්‍ය බව විශ්වාසද?

source: Choose the format that you wish to download the search results in
si_lk: ඔබ සෙවුම් ප්‍රතිඵල බාගත කිරීමට බලාපොරොත්තු වන ආකෘතිය තෝරන්න

source: Export as %s
si_lk: %sලෙස අපනයනය කරන්න

source: Error: %s
si_lk: දෝෂය: %s

source: Empty results
si_lk: හිස් ප්රතිඵල

source: Object: %s
si_lk: වස්තුව: %s

source: Remove %s tag %s from %s %s?
si_lk: %s ටැග් %s %s %sන් ඉවත් කරන්නද?

source: Remove
si_lk: ඉවත් කරන්න

source: Toggle Correlation %s
si_lk: සහසම්බන්ධය ටොගල් කරන්න %s

source: Re-enable the correlation for this attribute.
si_lk: මෙම ගුණාංගය සඳහා සහසම්බන්ධය නැවත සබල කරන්න.

source: This will remove all correlations that already exist for this attribute and prevents any attributes to be related as long as this setting is disabled. Make sure you understand the downsides of disabling correlations.
si_lk: මෙම ගුණාංගය සඳහා දැනටමත් පවතින සියලුම සහසම්බන්ධතා මෙය ඉවත් කරනු ඇති අතර මෙම සැකසුම අබල කර ඇති තාක් කල් කිසිදු උපලක්ෂණයක් සම්බන්ධ වීම වළක්වයි. සහසම්බන්ධතා අක්‍රිය කිරීමේ අවාසි ඔබ තේරුම් ගෙන ඇති බවට වග බලා ගන්න.

source: Toggle correlation for attribute
si_lk: උපලක්ෂණ සඳහා සහසම්බන්ධය ටොගල් කරන්න

source: Filter
si_lk: පෙරහන

source: Clear filtering rules
si_lk: පෙරීමේ නීති පැහැදිලි කරන්න

source: Clear
si_lk: පැහැදිලිව

source: previous
si_lk: කලින්

source: next
si_lk: ඊළඟ

source: Model
si_lk: ආකෘතිය

source: Title
si_lk: ශීර්ෂය

source: Change
si_lk: වෙනස් කරන්න

source: SYSTEM
si_lk: පද්ධතියක්

source: <i>Deleted user #%s</i>
si_lk: <i>මකා දැමූ පරිශීලක #%s</i>

source: Action done by CLI or background job
si_lk: CLI හෝ පසුබිම් කාර්යය මගින් සිදු කරන ලද ක්‍රියාව

source: by auth key #%s
si_lk: auth යතුර #%sමගින්

source: Action done trough API
si_lk: API හරහා කරන ලද ක්‍රියාව
