Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: Use the export features here to quickly download data in various formats
si_lk: විවිධ ආකෘතිවලින් දත්ත ඉක්මනින් බාගත කිරීමට මෙහි ඇති අපනයන විශේෂාංග භාවිත කරන්න

source: If the background jobs are enabled, you'll be redirected to a different version of the export page. Here you will see a table with all of the major export formats and the current status of the cached export files. Keep in mind that these are generated on an organisation by organisation basis, so even though others have generated newer export caches your organisation may have an outdated cache. You can simply issue a generate command (by clicking the "Generate" button) on the desired export type and the background workers will start fetching and assembling your cache. A progress bar will show the progress of the export process.
si_lk: පසුබිම් රැකියා සබල කර ඇත්නම්, ඔබව අපනයන පිටුවේ වෙනත් අනුවාදයකට හරවා යවනු ලැබේ. මෙහිදී ඔබට සියලුම ප්‍රධාන අපනයන ආකෘති සහ හැඹිලිගත අපනයන ගොනු වල වත්මන් තත්ත්වය සහිත වගුවක් පෙනෙනු ඇත. මේවා සංවිධානාත්මක පදනමක් මත ජනනය වන බව මතක තබා ගන්න, එබැවින් වෙනත් අය විසින් නව අපනයන හැඹිලි උත්පාදනය කර ඇතත් ඔබේ ආයතනයට යල් පැන ගිය හැඹිලියක් තිබිය හැක. ඔබට අවශ්‍ය අපනයන වර්ගය මත ජනන විධානයක් ("උත්පාදනය" බොත්තම ක්ලික් කිරීමෙන්) නිකුත් කළ හැකි අතර පසුබිම් සේවකයින් ඔබගේ හැඹිලිය ලබා ගැනීම සහ එකලස් කිරීම ආරම්භ කරනු ඇත. ප්‍රගති තීරුවක් අපනයන ක්‍රියාවලියේ ප්‍රගතිය පෙන්වයි.

source: Once done, you can click "Download" to download the freshly generated cache file. If the cache is already up to date from before, then you don't have to regenerate the cache, just click on the "download" button.
si_lk: අවසන් වූ පසු, ඔබට අලුතින් ජනනය කරන ලද හැඹිලි ගොනුව බාගැනීමට "බාගන්න" ක්ලික් කළ හැක. හැඹිලිය පෙර සිට යාවත්කාලීන නම්, ඔබට හැඹිලිය නැවත උත්පාදනය කිරීමට අවශ්‍ය නැත, "බාගැනීම්" බොත්තම ක්ලික් කරන්න.

source: You may have noticed that the TEXT export only has a generate button - this is because TEXT exports are made up of a lot of types of exports, all of which get generated together. To download any of these files, just click on any of the attribute types at the bottom of the table.
si_lk: TEXT අපනයනයේ ඇත්තේ උත්පාදන බොත්තමක් පමණක් බව ඔබ දැක ඇති - මෙයට හේතුව TEXT අපනයනය නිර්යාත වර්ග රාශියකින් සමන්විත වන අතර ඒ සියල්ල එක්ව උත්පාදනය වේ. මෙම ඕනෑම ගොනුවක් බාගත කිරීම සඳහා, වගුවේ පතුලේ ඇති ඕනෑම ගුණාංග වර්ගයක් මත ක්ලික් කරන්න.

source: A quick description of each of the fields in the table
si_lk: වගුවේ ඇති එක් එක් ක්ෂේත්‍රය පිළිබඳ ඉක්මන් විස්තරයක්

source: The type of the export (such as XML, Suricata, MD5, etc.).
si_lk: අපනයනයේ වර්ගය (XML, Suricata, MD5, ආදිය).

source: The generation date of the current cache for the given export type.
si_lk: ලබා දී ඇති අපනයන වර්ගය සඳහා වත්මන් හැඹිලියේ උත්පාදන දිනය.

source: A description of the export format.
si_lk: අපනයන ආකෘතිය පිළිබඳ විස්තරයක්.

source: This compares the cache generation date to the last timestamp when an event was updated and lets you know whether the cache is outdated or not.
si_lk: මෙය හැඹිලි උත්පාදන දිනය සිදුවීමක් යාවත්කාලීන වූ අවසන් කාල මුද්‍රාවට සංසන්දනය කරන අතර හැඹිලිය යල් පැන ගියද නැද්ද යන්න ඔබට දන්වයි.

source: Shows the progress of the last initiated generation process.
si_lk: අවසන් වරට ආරම්භ කරන ලද උත්පාදන ක්‍රියාවලියේ ප්‍රගතිය පෙන්වයි.

source: Download or Generate the given cache with these buttons.
si_lk: මෙම බොත්තම් සමඟ ලබා දී ඇති හැඹිලිය බාගන්න හෝ උත්පාදනය කරන්න.

source: Exporting search results and individual events
si_lk: සෙවුම් ප්‍රතිඵල සහ තනි සිදුවීම් අපනයනය කිරීම

source: Apart from the options offered by the export pages, it's also possible to export all events involved in a search attribute result table, by using the "Download results as XML" button on the left menu bar.
si_lk: අපනයන පිටු මගින් පිරිනමනු ලබන විකල්පයන්ට අමතරව, වම් මෙනු තීරුවේ ඇති "ප්‍රතිඵල XML ලෙස බාගන්න" බොත්තම භාවිතයෙන් සෙවුම් ගුණාංග ප්‍රතිඵල වගුවකට සම්බන්ධ සියලුම සිදුවීම් අපනයනය කිරීමටද හැකිය.

source: Download a .xml from all the events that are shown through an attribute in the search results.
si_lk: සෙවුම් ප්‍රතිඵලවල උපලක්ෂණයක් හරහා පෙන්වන සියලුම සිදුවීම් වලින් .xml බාගන්න.

source: Each event's view has its own export feature, both as an XML export and as a .ioc file. To reach these features, just navigate to an event and use the appropriate buttons on the right side.
si_lk: එක් එක් සිදුවීමක දර්ශනය XML අපනයනයක් ලෙස සහ .ioc ගොනුවක් ලෙස, එහිම අපනයන විශේෂාංගයක් ඇත. මෙම විශේෂාංග වෙත ළඟා වීමට, සිදුවීමක් වෙත සංචාලනය කර දකුණු පස ඇති සුදුසු බොත්තම් භාවිතා කරන්න.

source: Download a .xml or a .ioc of the event.
si_lk: සිදුවීමේ .xml හෝ .ioc බාගන්න.

source: Connecting to other instances
si_lk: වෙනත් අවස්ථා වලට සම්බන්ධ වීම

source: Apart from being a self contained repository of attacks/malware, one of the main features of MISP is its ability to connect to other instances and share (parts of) its information. The following options allow you to set up and maintain such connections.
si_lk: ප්‍රහාර/අනිෂ්ට මෘදුකාංග වල ස්වයං අන්තර්ගත ගබඩාවක් වීමට අමතරව, MISP හි එක් ප්‍රධාන ලක්ෂණයක් වන්නේ වෙනත් අවස්ථාවන්ට සම්බන්ධ වීමට සහ එහි තොරතුරු (කොටස්) බෙදා ගැනීමට ඇති හැකියාවයි. පහත දැක්වෙන විකල්පයන් ඔබට එවැනි සම්බන්ධතා සැකසීමට සහ නඩත්තු කිරීමට ඉඩ සලසයි.

source: Setting up a connection to another server
si_lk: වෙනත් සේවාදායකයකට සම්බන්ධතාවයක් සැකසීම

source: In order to share data with a remote server via pushes and pulls, you need to request a valid authentication key from the hosting organisation of the remote instance. When clicking on List Servers and then on New Server, a form comes up that needs to be filled out in order for your instance to connect to it. The following fields need to be filled out
si_lk: තල්ලු කිරීම් සහ ඇදීම් හරහා දුරස්ථ සේවාදායකයක් සමඟ දත්ත බෙදා ගැනීම සඳහා, ඔබ දුරස්ථ අවස්ථාවෙහි සත්කාරක සංවිධානයෙන් වලංගු සත්‍යාපන යතුරක් ඉල්ලා සිටිය යුතුය. List Servers මත ක්ලික් කර පසුව New Server මත ක්ලික් කරන විට, ඔබේ උදාහරණය එයට සම්බන්ධ වීම සඳහා පිරවිය යුතු පෝරමයක් එයි. පහත ක්ෂේත්‍ර පිරවිය යුතුය

source: Add server
si_lk: සේවාදායකය එක් කරන්න

source: Make sure that you enter the authentication key that you have been given by the hosting organisation of the remote instance, instead of the one you have gotten from this one.
si_lk: ඔබ මෙයින් ලබා ගත් එක වෙනුවට, දුරස්ථ අවස්ථාවෙහි සත්කාරක සංවිධානය විසින් ඔබට ලබා දී ඇති සත්‍යාපන යතුර ඇතුළත් කිරීමට වග බලා ගන්න.

source: Base URL
si_lk: මූලික URL

source: The URL of the remote server.
si_lk: දුරස්ථ සේවාදායකයේ URL.

source: The organisation that runs the remote server. It is very impoportant that this setting is filled out exactly as the organisation name set up in the bootstrap file of the remote instance.
si_lk: දුරස්ථ සේවාදායකය ධාවනය කරන සංවිධානය. මෙම සැකසුම දුරස්ථ අවස්ථාවෙහි bootstrap ගොනුවේ පිහිටුවා ඇති සංවිධානයේ නම ලෙසම පුරවා තිබීම ඉතා වැදගත් වේ.

source: The authentication key that you have received from the hosting organisation of the remote instance.
si_lk: දුරස්ථ අවස්ථාවෙහි සත්කාරක සංවිධානයෙන් ඔබට ලැබී ඇති සත්‍යාපන යතුර.

source: This check-box controls whether your server is allowed to push to the remote instance.
si_lk: මෙම පිරික්සුම් කොටුව ඔබගේ සේවාදායකයට දුරස්ථ අවස්ථාවට තල්ලු කිරීමට අවසර තිබේද යන්න පාලනය කරයි.

source: This check-box controls whether your server can request to pull all data from the remote instance.
si_lk: මෙම පිරික්සුම් පෙට්ටිය ඔබගේ සේවාදායකයට සියලු දත්ත දුරස්ථ අවස්ථාවෙන් ලබා ගැනීමට ඉල්ලා සිටිය හැකිද යන්න පාලනය කරයි.

source: Unpublish event (Push only)
si_lk: සිදුවීම ප්‍රකාශයට පත් නොකරන්න (තල්ලු කිරීම පමණි)

source: This check-box controls to unpublish new event (working with Push events).
si_lk: මෙම පිරික්සුම් පෙට්ටිය නව සිදුවීමක් ප්‍රකාශයට පත් නොකිරීමට පාලනය කරයි (Push සිදුවීම් සමඟ වැඩ කිරීම).

source: Publish without email (Pull only)
si_lk: විද්‍යුත් තැපෑලෙන් තොරව ප්‍රකාශ කරන්න (අදින්න පමණි)

source: This check-box controls whether your server is allowed to publish event without email (working with Pull events).
si_lk: ඔබගේ සේවාදායකයට විද්‍යුත් තැපෑලකින් තොරව සිදුවීමක් ප්‍රකාශ කිරීමට අවසර තිබේද යන්න මෙම පිරික්සුම් පෙට්ටිය පාලනය කරයි (පුල් සිදුවීම් සමඟ වැඩ කිරීම).

source: Self Signed
si_lk: ස්වයං අත්සන්

source: Ticking this checkbox will allow syncing with instances using self-signed certificates.
si_lk: මෙම පිරික්සුම් කොටුව සලකුණු කිරීමෙන් ස්වයං අත්සන් කළ සහතික භාවිතයෙන් අවස්ථා සමඟ සමමුහුර්ත කිරීමට ඉඩ ලබා දේ.

source: Certificate File
si_lk: සහතික ගොනුව

source: If the instance that you want to connect to has their entire own certificate chain, you can use this to import a .pem file with it and override CakePHP's standard root CA file.
si_lk: ඔබට සම්බන්ධ වීමට අවශ්‍ය අවස්ථාවට ඔවුන්ගේම සම්පූර්ණ සහතික දාමය තිබේ නම්, ඔබට එය සමඟ .pem ගොනුවක් ආයාත කිරීමට සහ CakePHP හි සම්මත මූල CA ගොනුව අභිබවා යාමට මෙය භාවිතා කළ හැක.

source: If you are an administrator</b>, trying to allow another instance to connect to your own, it is vital that two rules are followed when setting up a synchronisation account
si_lk: ඔබ පරිපාලකයෙක් නම්</b>, වෙනත් අවස්ථාවක් ඔබගේම වෙත සම්බන්ධ වීමට ඉඩ දීමට උත්සාහ කරයි නම්, සමමුහුර්ත කිරීමේ ගිණුමක් පිහිටුවීමේදී නීති දෙකක් අනුගමනය කිරීම ඉතා වැදගත් වේ.

source: The synchronisation user has to have the sync permission and full read/write/publish privileges turned on
si_lk: සමමුහුර්ත පරිශීලකයාට සමමුහුර්ත කිරීමේ අවසරය සහ සම්පූර්ණ කියවීම්/ලිවීම/ප්‍රකාශන වරප්‍රසාද ක්‍රියාත්මක කර තිබිය යුතුය.

source: Both the sync user and the organisation setting in your instance's Config/bootstrap.php file have to match the organisation identifier of the hosting organisation.
si_lk: සමමුහුර්ත පරිශීලකයා සහ ඔබේ උදාහරණයේ config/bootstrap.php ගොනුවේ සංවිධාන සැකසීම යන දෙකම සත්කාරක සංවිධානයේ ආයතනික හැඳුනුම්කාරකය සමඟ ගැළපිය යුතුය.

source: Browsing the currently set up server connections and interacting with them
si_lk: දැනට පිහිටුවා ඇති සේවාදායක සම්බන්ධතා පිරික්සීම සහ ඒවා සමඟ අන්තර් ක්‍රියා කිරීම

source: If you ever need to change the data about the linked servers or remove any connections, you have the following options to view and manipulate the server connections, when clicking on List Servers: (you will be able to see a list of all servers that your server connects to, including the base address, the organisation running the server the last pushed and pulled event IDs and the control buttons.).
si_lk: ඔබට කවදා හෝ සම්බන්ධිත සේවාදායකයන් පිළිබඳ දත්ත වෙනස් කිරීමට හෝ කිසියම් සම්බන්ධතාවක් ඉවත් කිරීමට අවශ්‍ය නම්, ලැයිස්තු සේවාදායකයන් මත ක්ලික් කරන විට, ඔබට සේවාදායක සම්බන්ධතා බැලීමට සහ හැසිරවීමට පහත විකල්ප තිබේ: (ඔබගේ සියලුම සේවාදායකයන්ගේ ලැයිස්තුවක් ඔබට දැකගත හැකි වනු ඇත. සර්වරය මූලික ලිපිනය ඇතුළුව, සේවාදායකය ක්‍රියාත්මක වන සංවිධානයට අවසන් වරට තල්ලු කර ඇද දැමූ සිදුවීම් හැඳුනුම්පත් සහ පාලන බොත්තම් ඇතුළත් වේ.).

source: Apart from editing / deleting the link to the remote server, you can issue a push all or pull all command from here.
si_lk: දුරස්ථ සේවාදායකය වෙත සබැඳිය සංස්කරණය කිරීම / මකා දැමීම හැරුණු විට, ඔබට මෙතැනින් තල්ලු කිරීම හෝ සියලු විධානය ලබා දීම කළ හැකිය.

source: Editing the connection to the
si_lk: වෙත සම්බන්ධතාවය සංස්කරණය කිරීම

source: By clicking edit a view, <a href=#new_server>that is identical to the new instance view</a>, is loaded, with all the current information of the instance pre-entered.
si_lk: දර්ශනයක් සංස්කරණය කරන්න ක්ලික් කිරීමෙන්, නව අවස්ථා දසුන</a>ට සමාන වන <a href=#new_server>, පූර්ව-ඇතුල් කළ අවස්ථාවෙහි සියලුම වත්මන් තොරතුරු සමඟ පූරණය වේ.

source: Deleting the connection to the instance
si_lk: අවස්ථාවට සම්බන්ධය මකා දැමීම

source: Clicking the delete button will delete the link to the instance.
si_lk: මකන්න බොත්තම ක්ලික් කිරීමෙන් එම අවස්ථාවට සබැඳිය මකා දමයි.

source: Push all
si_lk: සියල්ල තල්ලු කරන්න

source: By clicking this button, all events that are eligible to be pushed on the instance you are on will start to be pushed to the remote instance. Events and attributes that exist on the far end will be updated.
si_lk: මෙම බොත්තම ක්ලික් කිරීමෙන්, ඔබ සිටින අවස්ථාවට තල්ලු කිරීමට සුදුසුකම් ඇති සියලුම සිදුවීම් දුරස්ථ අවස්ථාවට තල්ලු වීමට පටන් ගනී. අන්තයේ පවතින සිදුවීම් සහ ගුණාංග යාවත්කාලීන කරනු ලැබේ.

source: By clicking this button, all events that are set to be pull-able or full access on the remote server will be copied to this instance. Existing events will not be updated.
si_lk: මෙම බොත්තම ක්ලික් කිරීමෙන්, දුරස්ථ සේවාදායකයේ අදින්නට හැකි හෝ සම්පූර්ණ ප්‍රවේශය ලෙස සකසා ඇති සියලුම සිදුවීම් මෙම අවස්ථාවට පිටපත් කරනු ලැබේ. පවතින සිදුවීම් යාවත්කාලීන නොවනු ඇත.

source: The platform is also <a href="http://en.wikipedia.org/wiki/Representational_state_transfer">RESTfull</a>, so this means that you can use structured format (XML or JSON) to access Events data.
si_lk: වේදිකාව ද <a href="http://en.wikipedia.org/wiki/Representational_state_transfer">RESTfull</a>වේ, එබැවින් මෙයින් අදහස් කරන්නේ ඔබට සිදුවීම් දත්ත වෙත ප්‍රවේශ වීමට ව්‍යුහගත ආකෘතිය (XML හෝ JSON) භාවිතා කළ හැකි බවයි.

source: Requests
si_lk: ඉල්ලීම්

source: Use any HTTP compliant library to perform requests.
si_lk: ඉල්ලීම් ඉටු කිරීමට ඕනෑම HTTP අනුකූල පුස්තකාලයක් භාවිතා කරන්න.

source: You can choose which format you would like to use as input/output for the REST calls by specifying the Accept and Content-Type headers.
si_lk: ඔබට පිළිගැනීම සහ අන්තර්ගත වර්ගයේ ශීර්ෂයන් සඳහන් කිරීම මගින් REST ඇමතුම් සඳහා ආදාන/ප්‍රතිදානය ලෙස භාවිතා කිරීමට කැමති ආකෘතිය තෝරාගත හැක.

source: The following headers are required if you wish to recieve / push XML data
si_lk: ඔබට XML දත්ත ලබා ගැනීමට / තල්ලු කිරීමට අවශ්‍ය නම් පහත ශීර්ෂයන් අවශ්‍ය වේ

source: The following headers are required if you wish to receive / push JSON data
si_lk: ඔබට JSON දත්ත ලබා ගැනීමට / තල්ලු කිරීමට අවශ්‍ය නම් පහත ශීර්ෂයන් අවශ්‍ය වේ

source: The following table shows the relation of the request type and the resulting action
si_lk: පහත වගුවේ දැක්වෙන්නේ ඉල්ලීම් වර්ගය සහ එහි ප්‍රතිඵලය වන ක්‍රියාවෙහි සම්බන්ධතාවයයි

source: HTTP format
si_lk: HTTP ආකෘතිය

source: Controller action invoked
si_lk: පාලක ක්‍රියාව ඉල්ලා ඇත

source: (1) Warning, there's a limit on the number of results when you call <code>index</code>.
si_lk: (1) අවවාදයයි, ඔබ <code>දර්ශකය</code>ඇමතූ විට ප්‍රතිඵල ගණනට සීමාවක් ඇත.

source: (2) Attachments are included using base64 encoding below the <code>data</code> tag.
si_lk: (2) ඇමුණුම් <code>දත්ත</code> ටැගයට පහළින් base64 කේතනය භාවිතයෙන් ඇතුළත් කර ඇත.

source: Example - Get single Event
si_lk: උදාහරණය - තනි සිදුවීමක් ලබා ගන්න

source: In this example we fetch the details of a single Event (and thus also his Attributes).
si_lk: මෙම උදාහරණයේදී අපි තනි සිදුවීමක විස්තර ලබා ගනිමු (එසේම ඔහුගේ ගුණාංග ද).

source: The request should be
si_lk: ඉල්ලීම විය යුතුය

source: And with the HTTP Headers
si_lk: සහ HTTP ශීර්ෂයන් සමඟ

source: The response you're going to get is the following data
si_lk: ඔබ ලබා ගැනීමට යන ප්‍රතිචාරය පහත දත්ත වේ

source: Code monkey doing code monkey stuff
si_lk: කෝඩ් වඳුරා කෝඩ් වඳුරා කරන දේවල්

source: Artifacts dropped
si_lk: කෞතුක වස්තු පහත වැටී ඇත

source: This is an Attribute
si_lk: මේක Attribute එකක්

source: Some_attribute
si_lk: සමහර_ගුණාංග

source: Example - Add new Event
si_lk: උදාහරණය - නව සිදුවීමක් එක් කරන්න

source: In this example we want to add a single Event.<br/> The request should be
si_lk: මෙම උදාහරණයේදී අපට තනි Event එකක් එකතු කිරීමට අවශ්‍යයි.<br/> ඉල්ලීම විය යුතුය

source: And the request body
si_lk: සහ ඉල්ලීම් ශරීරය

source: Something concise
si_lk: සංක්ෂිප්ත දෙයක්

source: The response from requesting an invalid page
si_lk: අවලංගු පිටුවක් ඉල්ලීමෙන් ලැබෙන ප්‍රතිචාරය

source: Thread Subject
si_lk: නූල් විෂය

source: In response to
si_lk: ඊට ප්‍රතිචාර වශයෙන්

source: Contents
si_lk: අන්තර්ගතය

source: Add Import Regexp
si_lk: ආයාත Regexp එකතු කරන්න

source: Types to be affected by the filter (Setting 'all' will override the other settings)
si_lk: පෙරහන මගින් බලපෑමට ලක්විය යුතු වර්ග ('සියල්ල' සැකසීම අනෙකුත් සැකසුම් අභිබවා යයි)

source: Edit Import Regexp
si_lk: ආයාත Regexp සංස්කරණය කරන්න

source: Replacement
si_lk: ආදේශ කිරීම

source: Restrict to site admins
si_lk: අඩවි පරිපාලකයින්ට සීමා කරන්න

source: Memory limit (%s)
si_lk: මතක සීමාව (%s)

source: Maximum execution time (%ss)
si_lk: උපරිම ක්‍රියාත්මක කාලය (තත්පර%s)

source: Enforce search rate limit
si_lk: සෙවුම් අනුපාත සීමාව බලාත්මක කරන්න

source: # of searches / 15 min
si_lk: සෙවීම් # / විනාඩි 15

source: Memory limit
si_lk: මතක සීමාව

source: Maximum execution time
si_lk: උපරිම ක්රියාත්මක කිරීමේ කාලය

source: Permission
si_lk: අවසර

source: Memory Limit
si_lk: මතක සීමාව

source: Max execution time
si_lk: උපරිම ක්රියාත්මක කිරීමේ කාලය

source: Searches / 15 mins
si_lk: සෙවීම් / විනාඩි 15

source: Unlimited
si_lk: අසීමිතයි

source: Add role
si_lk: භූමිකාව එක් කරන්න

source: Instance specific permission roles.
si_lk: නිදසුන් නිශ්චිත අවසර භූමිකාවන්.

source: Permission level
si_lk: අවසර මට්ටම

source: Events count
si_lk: සිදුවීම් ගණන් කරයි

source: Server events overlap analysis matrix
si_lk: සේවාදායක සිදුවීම් විශ්ලේෂණ අනුකෘතිය අතිච්ඡාදනය වේ

source: None or less than 1 % of the events of %s is contained in %s (%s matching events)
si_lk: %s හි සිදුවීම් වලින් 1% ට වඩා කිසිවක් හෝ අඩු නොවේ %s (ගැලපෙන සිදුවීම්%s)

source: %s % of the events of %s is contained in %s (%s matching events)
si_lk: %s හි සිදුවීම් වලින් %s % %s හි අඩංගු වේ (ගැලපෙන සිදුවීම් %s)

source: Server configuration
si_lk: සේවාදායක වින්‍යාසය

source: Add Server
si_lk: සේවාදායකය එක් කරන්න

source: Instance identification
si_lk: නිදර්ශන හඳුනාගැනීම

source: Instance name
si_lk: උදාහරණයේ නම

source: You can set this instance up as an internal instance by checking the checkbox below. This means that any synchronisation between this instance and the remote will not be automatically degraded as it would in a normal synchronisation scenario. Please make sure that you own both instances and that you are OK with this otherwise dangerous change. This also requires that the current instance's host organisation and the remote sync organisation are the same.
si_lk: ඔබට පහත පිරික්සුම් කොටුව සලකුණු කිරීමෙන් මෙම අවස්ථාව අභ්‍යන්තර අවස්ථාවක් ලෙස සැකසිය හැක. මෙයින් අදහස් කරන්නේ මෙම අවස්ථාව සහ දුරස්ථ පාලකය අතර ඇති ඕනෑම සමමුහුර්තකරණයක් සාමාන්‍ය සමමුහුර්තකරණයකදී සිදු වන පරිදි ස්වයංක්‍රීයව පිරිහීමට ලක් නොවන බවයි. කරුණාකර අවස්ථා දෙකම ඔබ සතු බවත්, වෙනත් ආකාරයකින් මෙම භයානක වෙනස සමඟ ඔබ හොඳින් සිටින බවත් සහතික කර ගන්න. මෙයට වත්මන් අවස්ථාවෙහි ධාරක සංවිධානය සහ දුරස්ථ සමමුහුර්ත සංවිධානය සමාන වීම අවශ්‍ය වේ.

source: Internal instance
si_lk: අභ්යන්තර උදාහරණය

source: Instance ownership and credentials
si_lk: උදාහරණ හිමිකාරිත්වය සහ අක්තපත්ර

source: Information about the organisation that will receive the events, typically the remote instance's host organisation.
si_lk: සිදුවීම් ලැබෙන සංවිධානය පිළිබඳ තොරතුරු, සාමාන්‍යයෙන් දුරස්ථ අවස්ථාවෙහි සත්කාරක සංවිධානය.

source: Organisation Type
si_lk: සංවිධානයේ වර්ගය

source: External Organisation
si_lk: බාහිර සංවිධානය

source: Local Organisation
si_lk: ප්රාදේශීය සංවිධානය

source: Remote Organisation's Name
si_lk: දුරස්ථ සංවිධානයේ නම

source: Remote Organisation's UUID
si_lk: දුරස්ථ සංවිධානයේ UUID

source: Ask the owner of the remote instance for a sync account on their instance, log into their MISP using the sync user's credentials and retrieve your API key by navigating to Global actions -> My profile. This key is used to authenticate with the remote instance.
si_lk: සමමුහුර්ත කිරීමේ ගිණුමක් සඳහා දුරස්ථ අවස්ථාවෙහි හිමිකරුගෙන් විමසන්න, සමමුහුර්ත පරිශීලකයාගේ අක්තපත්‍ර භාවිතයෙන් ඔවුන්ගේ MISP වෙත ලොග් වන්න සහ ගෝලීය ක්‍රියා -> මගේ පැතිකඩ වෙත සංචාලනය කිරීමෙන් ඔබේ API යතුර ලබා ගන්න. මෙම යතුර දුරස්ථ අවස්ථාව සමඟ සත්‍යාපනය කිරීමට භාවිතා කරයි.

source: Leave empty to use current key
si_lk: වත්මන් යතුර භාවිතා කිරීමට හිස්ව තබන්න

source: Enabled synchronisation methods
si_lk: සක්රීය සමමුහුර්ත කිරීමේ ක්රම

source: Server certificate file (*.pem):
si_lk: සේවාදායක සහතික ගොනුව (*.pem):

source: Add certificate file
si_lk: සහතික ගොනුව එක් කරන්න

source: Remove certificate file
si_lk: සහතික ගොනුව ඉවත් කරන්න

source: Client certificate file:
si_lk: සේවාලාභී සහතික ගොනුව:

source: Push rules:
si_lk: තල්ලු කිරීමේ නීති:

source: Events with the following tags allowed:
si_lk: පහත ටැග් සහිත සිදුවීම් වලට අවසර ඇත:

source: Events with the following tags blocked:
si_lk: පහත ටැග් අවහිර කර ඇති සිදුවීම්:

source: Events with the following organisations allowed:
si_lk: පහත සඳහන් සංවිධාන සමඟ සිදුවීම්වලට අවසර ඇත:

source: Events with the following organisations blocked:
si_lk: පහත සංවිධාන සමඟ සිදුවීම් අවහිර කර ඇත:

source: Attributes of the following types blocked:
si_lk: පහත දැක්වෙන වර්ගවල ගුණාංග අවහිර කර ඇත:

source: Objects of the following uuids blocked:
si_lk: පහත uuid වල වස්තු අවහිර කර ඇත:

source: Pull rules:
si_lk: අදින්න නීති:

source: Additional parameters:
si_lk: අතිරේක පරාමිතීන්:

source: Set PUSH rules
si_lk: PUSH නීති සකසන්න

source: Configure the rules to be applied when PUSHing data to the server
si_lk: සේවාදායකය වෙත දත්ත තල්ලු කිරීමේදී යෙදිය යුතු නීති වින්‍යාස කරන්න

source: Configure the rules to be applied when PULLing data from the server
si_lk: සේවාදායකයෙන් දත්ත ඇද ගන්නා විට යෙදිය යුතු නීති වින්‍යාස කරන්න

source: The base-url to the external server you want to sync with. Example: https://foo.sig.mil.be
si_lk: ඔබට සමමුහුර්ත කිරීමට අවශ්‍ය බාහිර සේවාදායකයට මූලික-url. උදාහරණය: https://foo.sig.mil.be

source: The organization having the external server you want to sync with. Example: BE
si_lk: ඔබට සමමුහුර්ත කිරීමට අවශ්‍ය බාහිර සේවාදායකය ඇති සංවිධානය. උදාහරණය: BE

source: A name that will make it clear to your users what this instance is. For example: Organisation A's instance
si_lk: මෙම අවස්ථාව කුමක්ද යන්න ඔබේ පරිශීලකයින්ට පැහැදිලි කරන නමක්. උදාහරණයක් ලෙස: A සංවිධානයේ උදාහරණය

source: You can find the authentication key on your profile on the external server.
si_lk: බාහිර සේවාදායකයේ ඔබගේ පැතිකඩෙහි සත්‍යාපන යතුර ඔබට සොයාගත හැකිය.

source: Allow the upload of events and their attributes.
si_lk: සිදුවීම් සහ ඒවායේ ගුණාංග උඩුගත කිරීමට ඉඩ දෙන්න.

source: Allow the download of events and their attributes from the server.
si_lk: සේවාදායකයෙන් සිදුවීම් සහ ඒවායේ ගුණාංග බාගත කිරීමට ඉඩ දෙන්න.

source: Unpublish new event (working with Push event).
si_lk: නව සිදුවීමක් ප්‍රකාශයට පත් නොකරන්න (Push සිදුවීම සමඟ වැඩ කිරීම).

source: Publish new event without email (working with Pull event).
si_lk: විද්‍යුත් තැපෑලකින් තොරව නව සිදුවීමක් ප්‍රකාශ කරන්න (Pull event සමඟ වැඩ කිරීම).

source: You can also upload a certificate file if the instance you are trying to connect to has its own signing authority.
si_lk: ඔබ සම්බන්ධ වීමට උත්සාහ කරන අවස්ථාවට එහිම අත්සන් කිරීමේ අධිකාරියක් තිබේ නම් ඔබට සහතික ගොනුවක් උඩුගත කළ හැක.

source: You can also upload a client certificate file if the instance you are trying to connect requires this.
si_lk: ඔබ සම්බන්ධ වීමට උත්සාහ කරන අවස්ථාවට මෙය අවශ්‍ය නම් ඔබට සේවාදායක සහතික ගොනුවක් උඩුගත කළ හැක.

source: Click this, if you would like to allow a connection despite the other instance using a self-signed certificate (not recommended).
si_lk: ස්වයං-අත්සන් කළ සහතිකයක් (නිර්දේශිත නොවේ) භාවිතයෙන් අනෙක් අවස්ථාව තිබියදීත් ඔබ සම්බන්ධතාවයකට ඉඩ දීමට කැමති නම්, මෙය ක්ලික් කරන්න.

source: Not set.
si_lk: සකසා නැත.

source: Set event block rules
si_lk: සිදුවීම් වාරණ නීති සකසන්න

source: Event block rules allow you to add a simple tag filter to block events from being added or synced. Events with a tag that matches any of the tags in the rule list will be blocked. It is not possible to add more complex rules with boolean logic (NOT, AND).
si_lk: සිදුවීම් අවහිර කිරීමේ නීති මඟින් ඔබට සිදුවීම් එකතු කිරීම හෝ සමමුහුර්ත කිරීම අවහිර කිරීම සඳහා සරල ටැග් පෙරහනක් එක් කිරීමට ඉඩ ලබා දේ. රීති ලැයිස්තුවේ ඇති ඕනෑම ටැග් එකකට ගැළපෙන ටැගයක් සහිත සිදුවීම් අවහිර කරනු ලැබේ. බූලියන් තර්කනය (NOT, AND) සමඟ වඩාත් සංකීර්ණ රීති එකතු කළ නොහැක.

source: Rule set (json)
si_lk: රීති කට්ටලය (json)

source: Please enter the url parameters that are to be used for the request. Valid parameters are:
si_lk: කරුණාකර ඉල්ලීම සඳහා භාවිතා කළ යුතු url පරාමිති ඇතුළත් කරන්න. වලංගු පරාමිතීන් වන්නේ:

source: Example:
si_lk: උදාහරණයක්:

source: Apply filters to the remote instance's index
si_lk: දුරස්ථ උදාහරණයේ දර්ශකයට පෙරහන් යොදන්න
