Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: Event Report doesn't have an UUID
si_lk: සිදුවීම් වාර්තාවේ UUID එකක් නැත

source: Event Report not found.
si_lk: සිදුවීම් වාර්තාව හමු නොවීය.

source: Failed to delete report
si_lk: වාර්තාව මැකීමට අසමත් විය

source: Invalid report
si_lk: වලංගු නොවන වාර්තාවක්

source: Invalid authorization requested
si_lk: වලංගු නොවන අවසරයක් ඉල්ලා ඇත

source: Could not find associated event
si_lk: ආශ්‍රිත සිදුවීම සොයා ගැනීමට නොහැකි විය

source: Only the creator organisation of the event can modify the report
si_lk: වාර්තාව වෙනස් කළ හැක්කේ සිදුවීමේ නිර්මාතෘ සංවිධානයට පමණි

source: Invalid input source. The only valid options are %s. %s
si_lk: වලංගු නොවන ආදාන මූලාශ්‍රයක්. එකම වලංගු විකල්ප %sවේ. %s

source: Security.disable_local_feed_access is currently enabled, local feeds are thereby not allowed.
si_lk: Security.disable_local_feed_access දැනට සබල කර ඇත, දේශීය සංග්‍රහවලට ඉඩ නොදේ.

source: Fetching %s events.
si_lk: සිදුවීම් %s ක් ලබා ගනිමින්.

source: Feed %s: Fetching.
si_lk: සංග්‍රහය %s: ගෙන ඒම.

source: Could not fetch freetext feed %s. See error log for more details.
si_lk: freetext feed %sලබා ගැනීමට නොහැකි විය. වැඩි විස්තර සඳහා දෝෂ ලොගය බලන්න.

source: Feed %s: %s/%s values cached.
si_lk: සංග්‍රහය %s: %sඅගයන් හැඹිලිගත කර%s.

source: Event %s
si_lk: සිදුවීම %s

source: Feed %s
si_lk: පෝෂණය %s

source: Invalid feed id.
si_lk: වලංගු නොවන සංග්‍රහ id.

source: Feed has to be either a CSV or a freetext feed for the purging to work.
si_lk: පිරිසිදු කිරීම ක්‍රියා කිරීම සඳහා සංග්‍රහය CSV එකක් හෝ නිදහස් පෙළ සංග්‍රහයක් විය යුතුය.

source: Invalid user id.
si_lk: වලංගු නොවන පරිශීලක හැඳුනුම්පතක්.

source: Events related to feed %s purged.
si_lk: සංග්‍රහයට අදාළ සිදුවීම් %s පිරිසිදු කරන ලදී.

source: Galaxy not found
si_lk: Galaxy හමු නොවීය

source: Invalid Galaxy cluster
si_lk: අවලංගු Galaxy පොකුරක්

source: This Cluster can only be attached in a local scope
si_lk: මෙම පොකුර අනුයුක්ත කළ හැක්කේ දේශීය විෂය පථයක් තුළ පමණි

source: Galaxy cannot be represented as a matrix
si_lk: Galaxy අනුකෘතියක් ලෙස නිරූපණය කළ නොහැක

source: Incorrect permission
si_lk: වැරදි අවසරය

source: Blocked by blocklist
si_lk: වාරණ ලැයිස්තුව මගින් අවහිර කර ඇත

source: Cluster already exists in another galaxy
si_lk: පොකුර දැනටමත් වෙනත් මන්දාකිණියක පවතී

source: Edit not allowed on default clusters
si_lk: පෙරනිමි පොකුරු මත සංස්කරණය කිරීමට අවසර නැත

source: Edit not allowed
si_lk: සංස්කරණය කිරීමට අවසර නැත

source: Cluster forks have to belong to the same galaxy as the parent
si_lk: පොකුරු ගෑරුප්පු මව්පියන් මෙන් එකම මන්දාකිණියට අයත් විය යුතුය

source: The sync user has to have access to the sharing group in order to be able to edit it
si_lk: සමමුහුර්ත පරිශීලකයාට එය සංස්කරණය කිරීමට හැකි වීම සඳහා බෙදාගැනීමේ කණ්ඩායමට ප්‍රවේශය තිබිය යුතුය

source: UUID not provided
si_lk: UUID සපයා නැත

source: Unkown UUID
si_lk: නොදන්නා UUID

source: Galaxy Cluster could not be saved: The sync user has to have access to the sharing group in order to be able to edit it.
si_lk: Galaxy Cluster සුරැකීමට නොහැකි විය: සමමුහුර්ත පරිශීලකයාට එය සංස්කරණය කිරීමට හැකි වීම සඳහා බෙදාගැනීමේ කණ්ඩායමට ප්‍රවේශය තිබිය යුතුය.

source: Galaxy Cluster could not be saved: The user used to edit the cluster is not authorised to do so. This can be caused by the user not being of the same organisation as the original creator of the cluster whilst also not being a site administrator.
si_lk: Galaxy Cluster සුරැකීමට නොහැකි විය: පොකුර සංස්කරණය කිරීමට භාවිතා කරන පරිශීලකයාට එසේ කිරීමට අවසර නැත. පරිශීලකයා පොකුරේ මුල් නිර්මාතෘවරයා මෙන් එකම සංවිධානයක නොවීම සහ අඩවි පරිපාලකයෙකු නොවීම මෙයට හේතු විය හැක.

source: Organisation blocklisted (%s)
si_lk: සංවිධානය අවහිර ලැයිස්තුගත කර ඇත (%s)

source: Only non-default clusters can be saved
si_lk: පෙරනිමි නොවන පොකුරු පමණක් සුරැකිය හැක

source: Blocked an edit to an cluster that was created locally. This can happen if a synchronised cluster that was created on this instance was modified by an administrator on the remote side.
si_lk: දේශීයව සාදන ලද පොකුරකට සංස්කරණයක් අවහිර කරන ලදී. මෙම අවස්ථාවේදී නිර්මාණය කරන ලද සමමුහුර්ත කළ පොකුරක් දුරස්ථ පැත්තේ පරිපාලකයෙකු විසින් වෙනස් කළහොත් මෙය සිදුවිය හැක.

source: Remote version is not newer than local one for cluster (%s)
si_lk: දුරස්ථ අනුවාදය පොකුරු (%s) සඳහා දේශීය එකකට වඩා අලුත් නොවේ

source: Issues while capturing relations have been logged.
si_lk: සබඳතා අල්ලා ගැනීමේදී ගැටළු ලොග් වී ඇත.

source: Invalid galaxy cluster
si_lk: අවලංගු මන්දාකිණි පොකුරක්

source: You don't have the permission to do that.
si_lk: ඔබට එය කිරීමට අවසර නැත.

source: Only the creator organisation can modify the galaxy cluster
si_lk: මන්දාකිණි පොකුර වෙනස් කළ හැක්කේ නිර්මාපක සංවිධානයට පමණි

source: Only the creator organisation with publishing capabilities can publish the galaxy cluster
si_lk: ප්‍රකාශන හැකියාවන් ඇති නිර්මාපක සංවිධානයට පමණක් මන්දාකිණි පොකුර ප්‍රකාශනය කළ හැක

source: The remote user does not have the permission to manipulate galaxies - the upload of the galaxy clusters has been blocked.
si_lk: දුරස්ථ පරිශීලකයාට මන්දාකිණි හැසිරවීමට අවසර නැත - මන්දාකිණි පොකුරු උඩුගත කිරීම අවහිර කර ඇත.

source: The distribution level of the cluster blocks it from being pushed.
si_lk: පොකුරේ බෙදා හැරීමේ මට්ටම එය තල්ලු කිරීම අවහිර කරයි.

source: The sync user on the remote instance does not have the required privileges to handle this cluster.
si_lk: දුරස්ථ අවස්ථාවෙහි සමමුහුර්ත පරිශීලකයාට මෙම පොකුර හැසිරවීමට අවශ්‍ය වරප්‍රසාද නොමැත.

source: Uploading GalaxyCluster (%s) to Server (%s)
si_lk: GalaxyCluster (%s) සේවාදායකයට (%s) උඩුගත කිරීම

source: Failed because of errors:
si_lk: දෝෂ නිසා අසාර්ථක විය:

source: failed downloading the galaxy cluster
si_lk: මන්දාකිණි පොකුර බාගැනීම අසාර්ථක විය

source: Relation already exists
si_lk: සම්බන්ධතාවය දැනටමත් පවතී

source: referenced_galaxy_cluster_uuid not provided
si_lk: referenced_galaxy_cluster_uuid සපයා නැත

source: Invalid referenced galaxy cluster
si_lk: අවලංගු යොමු ගැලැක්සි පොකුරක්

source: Tags could not be saved for relation (%s)
si_lk: සම්බන්ධය සඳහා ටැග් සුරැකිය නොහැක (%s)

source: galaxy_cluster_id not provided
si_lk: galaxy_cluster_id සපයා නැත

source: Unkown ID
si_lk: නොදන්නා හැඳුනුම්පත

source: Invalid source galaxy cluster
si_lk: වලංගු නොවන මූලාශ්‍ර මන්දාකිණි පොකුරක්

source: No referenced cluster UUID provided
si_lk: යොමු කළ පොකුරු UUID සපයා නැත

source: relation for cluster (%s)
si_lk: පොකුරු සඳහා සම්බන්ධය (%s)

source: Referenced cluster not found
si_lk: යොමු කළ පොකුරක් හමු නොවීය

source: relation to (%s) for cluster (%s)
si_lk: පොකුරු (%s) සඳහා (%s) සම්බන්ධය

source: Could not attach tag %s
si_lk: ටැගය %sඇමිණිය නොහැකි විය

source: relation (%s)
si_lk: සම්බන්ධතාවය (%s)

source: Job failed.
si_lk: රැකියාව අසාර්ථක විය.

source: No valid template found and object lacking template information. (%s)
si_lk: වලංගු අච්චුවක් හමු නොවූ අතර සැකිලි තොරතුරු නොමැති වස්තුවක්. (%s)

source: Duplicate object found (id: %s, uuid: %s). Since breakOnDuplicate is set the object will not be added.
si_lk: අනුපිටපත් වස්තුව හමු විය (id: %s, uuid: %s). breakOnDuplicate සකසා ඇති බැවින් වස්තුව එකතු නොවේ.

source: Object dropped due to it being a duplicate (ID: %s, UUID: %s) and breakOnDuplicate being requested for Event %s
si_lk: වස්තුව අනුපිටපතක් (ID: %s, UUID: %s) නිසා සහ Event %sසඳහා breakOnDuplicate ඉල්ලා සිටීම නිසා එය පහත වැටුණි

source: Selected Attributes do not exist.
si_lk: තෝරාගත් ගුණාංග නොපවතී.

source: Unrestricted access to any data and functionality on this instance.
si_lk: මෙම අවස්ථාවෙහි ඕනෑම දත්තයකට සහ ක්‍රියාකාරීත්වයකට සීමා රහිත ප්‍රවේශය.

source: Limited organisation admin - create, manage users of their own organisation.
si_lk: සීමිත සංවිධාන පරිපාලක - ඔවුන්ගේම සංවිධානයේ පරිශීලකයින් නිර්මාණය කිරීම, කළමනාකරණය කිරීම.

source: Synchronisation permission, can be used to connect two MISP instances create data on behalf of other users. Make sure that the role with this permission has also access to tagging and tag editing rights.
si_lk: සමමුහුර්ත කිරීමේ අවසරය, වෙනත් පරිශීලකයන් වෙනුවෙන් දත්ත නිර්මාණය කරන MISP අවස්ථා දෙකක් සම්බන්ධ කිරීමට භාවිතා කළ හැක. මෙම අවසරය සහිත භූමිකාවට ටැග් කිරීම සහ ටැග් සංස්කරණය කිරීමේ අයිතීන් සඳහා ද ප්‍රවේශය ඇති බව සහතික කර ගන්න.

source: Access to the audit logs of the user's organisation.
si_lk: පරිශීලක සංවිධානයේ විගණන ලඝු-සටහන් වෙත ප්‍රවේශය.

source: Users with this permission have access to authenticating via their Auth keys, granting them access to the API.
si_lk: මෙම අවසරය ඇති පරිශීලකයින්ට API වෙත ප්‍රවේශය ලබා දෙමින් ඔවුන්ගේ Auth යතුරු හරහා සත්‍යාපනය කිරීමට ප්‍රවේශය ඇත.

source: Users with this role can modify the regex rules affecting how data is fed into MISP. Make sure that caution is advised with handing out roles that include this permission, user controlled executed regexes are dangerous.
si_lk: මෙම භූමිකාව සහිත පරිශීලකයින්ට MISP වෙත දත්ත පෝෂණය වන ආකාරය කෙරෙහි බලපාන regex රීති වෙනස් කළ හැක. මෙම අවසරය ඇතුළත් භූමිකාවන් බෙදා හැරීමේදී ප්‍රවේශම් විය යුතු බව සහතික කර ගන්න, පරිශීලක පාලිත ක්‍රියාත්මක කරන ලද රෙජෙක්ස් භයානක ය.

source: Users with roles that include this permission can attach or detach existing tags to and from events/attributes.
si_lk: මෙම අවසරය ඇතුළත් භූමිකාවන් සහිත පරිශීලකයින්ට සිදුවීම්/ගුණාංග වෙත සහ ඒවායින් පවතින ටැග් ඇමිණීමට හෝ වෙන් කිරීමට හැකිය.

source: This permission gives users the ability to create tags.
si_lk: මෙම අවසරය පරිශීලකයින්ට ටැග් සෑදීමේ හැකියාව ලබා දෙයි.

source: Create or modify templates, to be used when populating events.
si_lk: සිදුවීම් පුරවන විට භාවිතා කිරීමට සැකිලි සාදන්න හෝ වෙනස් කරන්න.

source: Permission to create or modify sharing groups.
si_lk: බෙදාගැනීමේ කණ්ඩායම් සෑදීමට හෝ වෙනස් කිරීමට අවසරය.

source: Allow users to create delegation requests for their own org only events to trusted third parties.
si_lk: විශ්වාසදායක තෙවන පාර්ශ්ව වෙත ඔවුන්ගේම org පමණක් සිදුවීම් සඳහා නියෝජිත ඉල්ලීම් නිර්මාණය කිරීමට පරිශීලකයින්ට ඉඩ දෙන්න.

source: Permits the user to push feedback on attributes into MISP by providing sightings.
si_lk: දර්ශන ලබා දීමෙන් MISP වෙත ගුණාංග පිළිබඳ ප්‍රතිපෝෂණ තල්ලු කිරීමට පරිශීලකයාට අවසර දෙයි.

source: Create or modify MISP Object templates.
si_lk: MISP Object සැකිලි සාදන්න හෝ වෙනස් කරන්න.

source: Create or modify MISP Galaxies and MISP Galaxies Clusters.
si_lk: MISP Galaxies සහ MISP Galaxies Clusters සාදන්න හෝ වෙනස් කරන්න.

source: Create or modify MISP Decaying Models.
si_lk: MISP දිරාපත් වන ආකෘති සාදන්න හෝ වෙනස් කරන්න.

source: Allow users to publish data to the ZMQ pubsub channel via the publish event to ZMQ button.
si_lk: ZMQ බොත්තමට ප්‍රකාශන සිදුවීම හරහා ZMQ පබ්සබ් නාලිකාවට දත්ත ප්‍රකාශ කිරීමට පරිශීලකයින්ට ඉඩ දෙන්න.

source: Allow users to publish data to Kafka via the publish event to Kafka button.
si_lk: ප්‍රකාශන සිදුවීම කෆ්කා බොත්තම හරහා කෆ්කා වෙත දත්ත ප්‍රකාශ කිරීමට පරිශීලකයින්ට ඉඩ දෙන්න.

source: Allow to manage warninglists.
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තු කළමනාකරණය කිරීමට ඉඩ දෙන්න.

source: Server unreachable
si_lk: සේවාදායකයට ළඟා විය නොහැක

source: Unexpected error
si_lk: අනපේක්ෂිත දෝෂයකි

source: Authentication failed
si_lk: සත්‍යාපනය අසාර්ථක විය

source: Password change required
si_lk: මුරපදය වෙනස් කිරීම අවශ්ය වේ

source: Terms not accepted
si_lk: කොන්දේසි පිළිගනු නොලැබේ

source: Failed (partially?) because of validation errors:
si_lk: වලංගු කිරීමේ දෝෂ හේතුවෙන් (අර්ධ වශයෙන්?) අසාර්ථක විය:

source: Blocked an edit to an event that was created locally. This can happen if a synchronised event that was created on this instance was modified by an administrator on the remote side.
si_lk: දේශීයව සාදන ලද සිදුවීමක සංස්කරණයක් අවහිර කරන ලදී. මෙම අවස්ථාවේදී නිර්මාණය කරන ලද සමමුහුර්ත සිදුවීමක් දුරස්ථ පැත්තේ පරිපාලකයෙකු විසින් වෙනස් කළහොත් මෙය සිදුවිය හැක.

source: failed downloading the event
si_lk: සිදුවීම බාගත කිරීම අසාර්ථක විය

source: Empty event detected.
si_lk: හිස් සිදුවීම අනාවරණය විය.

source: Not authorised. This is either due to an invalid auth key, or due to the sync user not having authentication permissions enabled on the remote server. Another reason could be an incorrect sync server setting.
si_lk: අවසර නැත. මෙය එක්කෝ වලංගු නොවන සත්‍යාපන යතුරක් නිසා හෝ සමමුහුර්ත පරිශීලකයාට දුරස්ථ සේවාදායකයේ සත්‍යාපන අවසර සක්‍රීය කර නොතිබීම හේතුවෙනි. තවත් හේතුවක් වැරදි සමමුහුර්ත සේවාදායක සැකසුම විය හැක.

source: Pulling relevant galaxy clusters.
si_lk: අදාළ මන්දාකිණි පොකුරු ඇද ගැනීම.

source: Pulling galaxy clusters.
si_lk: මන්දාකිණි පොකුරු ඇදීම.

source: Push to server %s failed. Reason: %s
si_lk: සේවාදායකය %s වෙත තල්ලු කිරීම අසාර්ථක විය. හේතුව: %s

source: Push to server %s complete.
si_lk: සේවාදායකයට තල්ලු කිරීම %s සම්පූර්ණයි.

source: Enable or disable the %s module.
si_lk: %s මොඩියුලය සක්රිය හෝ අක්රිය කරන්න.

source: Restrict the %s module to the given organisation.
si_lk: %s මොඩියුලය ලබා දී ඇති සංවිධානයට සීමා කරන්න.

source: Set this required module specific setting.
si_lk: මෙම අවශ්‍ය මොඩියුල විශේෂිත සැකසුම සකසන්න.

source: Value not set.
si_lk: අගය සකසා නැත.

source: Invalid language.
si_lk: වලංගු නොවන භාෂාවක්.

source: No organisation selected.
si_lk: සංවිධානයක් තෝරා නැත.

source: Invalid tag_collection.
si_lk: වලංගු නොවන ටැග්_එකතුවක්.

source: This setting has to be a number.
si_lk: මෙම සැකසුම අංකයක් විය යුතුය.

source: The value has to be a whole number greater or equal 0.
si_lk: අගය පූර්ණ සංඛ්‍යාවක් වැඩි හෝ 0 ට සමාන විය යුතුය.

source: The cookie timeout is currently lower than the session timeout. This will invalidate the cookie before the session expires.
si_lk: කුකී කල් ඉකුත්වීම දැනට සැසි කල් ඉකුත්වීමට වඩා අඩුය. මෙය සැසිය කල් ඉකුත් වීමට පෙර කුකිය අවලංගු කරයි.

source: Value is not a boolean, make sure that you convert 'true' to true for example.
si_lk: අගය බූලියන් නොවේ, උදාහරණයක් ලෙස ඔබ 'සත්‍ය' සත්‍ය බවට පරිවර්තනය කිරීමට වග බලා ගන්න.

source: Invalid file path or file not accessible.
si_lk: වලංගු නොවන ගොනු මාර්ගයක් හෝ ගොනුව වෙත ප්‍රවේශ විය නොහැක.

source: File has to be in .pem format.
si_lk: ගොනුව .pem ආකෘතියෙන් තිබිය යුතුය.

source: Emailing is currently disabled. Enabling OTP without e-mailing being configured would lock all users out.
si_lk: විද්‍යුත් තැපෑල දැනට අබල කර ඇත. විද්‍යුත් තැපෑල වින්‍යාස කිරීමකින් තොරව OTP සක්‍රීය කිරීම සියලුම පරිශීලකයින් අගුලු දමනු ඇත.

source: Value could not be null.
si_lk: අගය ශුන්‍ය විය නොහැක.

source: Something went wrong. MISP tried to save a malformed config file. Setting change reverted.
si_lk: මොකක්හරි වැරැද්දක් වෙලා. MISP දෝෂ සහිත වින්‍යාස ගොනුවක් සුරැකීමට උත්සාහ කළේය. සැකසුම් වෙනස් කිරීම ප්‍රතිවර්තනය කරන ලදී.

source: Organisation logos
si_lk: සංවිධානයේ ලාංඡන

source: The logo used by an organisation on the event index, event view, discussions, proposals, etc. Make sure that the filename is in the org.png format, where org is the case-sensitive organisation name.
si_lk: සිද්ධි දර්ශකය, සිදුවීම් දර්ශනය, සාකච්ඡා, යෝජනා, ආදියෙහි සංවිධානයක් විසින් භාවිතා කරන ලාංඡනය. ගොනු නාමය org.png ආකෘතියේ ඇති බවට වග බලා ගන්න, org යනු සිද්ධි-සංවේදී සංවිධානයේ නමයි.

source: 48x48 pixel .png files
si_lk: 48x48 පික්සල් .png ගොනු

source: Filename must be in the following format: *.png
si_lk: ගොනු නාමය පහත ආකෘතියෙන් විය යුතුය: *.png

source: Additional image files
si_lk: අමතර රූප ගොනු

source: Image files uploaded into this directory can be used for various purposes, such as for the login page logos
si_lk: මෙම නාමාවලියට උඩුගත කරන ලද රූප ගොනු, පිවිසුම් පිටු ලාංඡන සඳහා වැනි විවිධ අරමුණු සඳහා භාවිතා කළ හැක

source: PNG or SVG file
si_lk: PNG හෝ SVG ගොනුව

source: Filename must be in the following format: *.png or *.svg
si_lk: ගොනු නාමය පහත ආකෘතියෙන් විය යුතුය: *.png හෝ *.svg

source: Not defined
si_lk: අර්ථ දක්වා නැත

source: Response was empty.
si_lk: ප්‍රතිචාරය හිස් විය.

source: Error: Server didn't send the expected response. This may be because the remote server version is outdated.
si_lk: දෝෂය: සේවාදායකය අපේක්ෂිත ප්‍රතිචාරය එවා නැත. දුරස්ථ සේවාදායක අනුවාදය යල් පැන ගිය නිසා මෙය විය හැකිය.

source: % The command below is a suggestion and might be incorrect. Please ask if you are not sure what you are doing.
si_lk: % පහත විධානය යෝජනාවක් වන අතර එය වැරදි විය හැක. ඔබ කරන්නේ කුමක්දැයි ඔබට විශ්වාස නැතිනම් කරුණාකර විමසන්න.

source: Can't check database schema for Postgres database type
si_lk: Postgres දත්ත සමුදා වර්ගය සඳහා දත්ත සමුදා ක්‍රමය පරීක්ෂා කළ නොහැක

source: Table `%s` does not exist
si_lk: වගුව `%s` නොපවතී

source: Column `%s` exists but should not
si_lk: තීරුව `%sපවතින නමුත් නොවිය යුතුය

source: Column `%s` is different
si_lk: තීරුව `%sවෙනස් වේ

source: Column `%s` does not exist but should
si_lk: තීරුව `%s` නොපවතින නමුත් විය යුතුය

source: Table `%s` is an additional table
si_lk: වගුව `%s` යනු අතිරේක වගුවකි

source: Column `%s` should be unique indexed, but contains duplicate values
si_lk: තීරුව `%sඅද්විතීය සුචිගත කළ යුතුය, නමුත් අනුපිටපත් අගයන් අඩංගු වේ

source: Column `%s` should be indexed
si_lk: තීරුව `%sසුචිගත කළ යුතුය

source: Column `%s` is indexed but should not
si_lk: තීරුව `%sසුචිගත කර ඇති නමුත් නොකළ යුතුය

source: Column `%s` has unique index, but should be non unique
si_lk: `%sතීරුවට අනන්‍ය දර්ශක ඇත, නමුත් අනන්‍ය නොවිය යුතුය

source: Column `%s` should be unique index, but contains duplicate values
si_lk: තීරුව `%sඅනන්‍ය දර්ශක විය යුතුය, නමුත් අනුපිටපත් අගයන් අඩංගු වේ

source: Column `%s` should be unique index
si_lk: තීරුව `%sඅද්විතීය දර්ශකය විය යුතුය

source: Removing a dead worker.
si_lk: මියගිය සේවකයෙකු ඉවත් කිරීම.

source: Removing dead worker data. Worker was of type %s with pid %s
si_lk: මියගිය සේවක දත්ත ඉවත් කිරීම. සේවකයා pid %sසමඟ %s වර්ගයේ විය

source: Stopping a worker.
si_lk: සේවකයෙකු නතර කිරීම.

source: Stopping a worker. Worker was of type %s with pid %s
si_lk: සේවකයෙකු නතර කිරීම. සේවකයා පිඩ් %sසමඟ %s වර්ගයේ විය

source: Invalid submodule.
si_lk: අවලංගු උප මොඩියුලය.

source: unknown
si_lk: නොදන්නා

source: Updating:
si_lk: යාවත්කාලීන කිරීම:

source: Invalid worker.
si_lk: අවලංගු සේවකයෙක්.

source: Background workers not enabled.
si_lk: පසුබිම් සේවකයන් සබල කර නැත.

source: Invalid worker type.
si_lk: වලංගු නොවන සේවක වර්ගය.

source: Could not reset the remote authentication key.
si_lk: දුරස්ථ සත්‍යාපන යතුර යළි පිහිටුවීමට නොහැකි විය.

source: Fetching the '%s' failed with HTTP error 404: Not Found
si_lk: HTTP දෝෂය 404 සමඟ '%s' ලබා ගැනීම අසාර්ථක විය: හමු නොවීය

source: Fetching the '%s' failed with HTTP error %s: %s
si_lk: HTTP දෝෂය %s: %sසමඟ '%s' ලබා ගැනීම අසාර්ථක විය

source: User
si_lk: පරිශීලක

source: Role name
si_lk: භූමිකාවේ නම

source: Unknown, outdated instance
si_lk: නොදන්නා, යල් පැන ගිය අවස්ථාවක්

source: Sync flag
si_lk: සමමුහුර්ත කොඩිය

source: Auth key expiration
si_lk: සත්‍යාපන යතුර කල් ඉකුත්වීම

source: Could not fetch remote user account.
si_lk: දුරස්ථ පරිශීලක ගිණුමක් ලබා ගැනීමට නොහැකි විය.

source: Connection failed. Error returned: %s
si_lk: සම්බන්ධතාවය අසාර්ථක විය. දෝෂය ආපසු: %s

source: The base url of the application (in the format https://www.mymispinstance.com or https://myserver.com/misp). Several features depend on this setting being correctly set to function.
si_lk: යෙදුමේ මූලික url (https://www.mymispinstance.com හෝ https://myserver.com/misp ආකෘතියෙන්). මෙම සැකසුම නිවැරදිව ක්‍රියාත්මක වීමට සකසා තිබීම මත විශේෂාංග කිහිපයක් රඳා පවතී.

source: The currently set baseurl does not match the URL through which you have accessed the page. Disregard this if you are accessing the page via an alternate URL (for example via IP address).
si_lk: දැනට සකසා ඇති baseurl ඔබ පිටුවට ප්‍රවේශ වී ඇති URL සමඟ නොගැලපේ. ඔබ විකල්ප URL එකක් හරහා පිටුවට පිවිසෙන්නේ නම් මෙය නොසලකා හරින්න (උදාහරණයක් ලෙස IP ලිපිනය හරහා).

source: The base url of the application (in the format https://www.mymispinstance.com) as visible externally/by other MISPs. MISP will encode this URL in sharing groups when including itself. If this value is not set, the baseurl is used as a fallback.
si_lk: යෙදුමේ මූලික url (https://www.mymispinstance.com ආකෘතියෙන්) බාහිරව/අනෙකුත් MISPs විසින් දෘශ්‍යමාන වේ. MISP විසින් මෙම URL එක ඇතුලත් කරන විට බෙදාගැනීමේ කණ්ඩායම් තුළ කේතනය කරනු ඇත. මෙම අගය සකසා නොමැති නම්, baseurl එක Fallback එකක් ලෙස භාවිතා කරයි.

source: Unless set to true, the instance will only be accessible by site admins.
si_lk: සත්‍ය ලෙස සකසා නොමැති නම්, එම අවස්ථාවට ප්‍රවේශ විය හැක්කේ අඩවි පරිපාලකයින්ට පමණි.

source: Select the language MISP should use. The default is english.
si_lk: MISP භාවිතා කළ යුතු භාෂාව තෝරන්න. පෙරනිමිය ඉංග්‍රීසි වේ.

source: This values controls the internal fetcher's memory envelope when it comes to attributes. The number provided is the amount of attributes that can be loaded for each MB of PHP memory available in one shot. Consider lowering this number if your instance has a lot of attribute tags / attribute galaxies attached.
si_lk: ගුණාංග සම්බන්ධයෙන් ගත් කල, මෙම අගයන් අභ්‍යන්තර ගෙන්නන්නාගේ මතක ලියුම් කවරය පාලනය කරයි. සපයා ඇති අංකය යනු එක් පහරකින් ලබා ගත හැකි සෑම MB PHP මතකයක් සඳහාම පූරණය කළ හැකි ගුණාංග ප්‍රමාණයයි. ඔබගේ නිදසුනෙහි බොහෝ ගුණාංග ටැග් / උපලක්ෂණ මන්දාකිණි අමුණා තිබේ නම් මෙම අංකය අඩු කිරීමට සලකා බලන්න.

source: This value controls the divisor for attribute weighting when it comes to loading full events. Meaning that it will load coefficient / divisor number of attributes per MB of memory available. Consider raising this number if you have a lot of correlations or highly contextualised events (large number of event level galaxies/tags).
si_lk: මෙම අගය සම්පූර්ණ සිදුවීම් පූරණය කිරීමේදී උපලක්ෂණ බර කිරීම සඳහා භාජකය පාලනය කරයි. එයින් අදහස් වන්නේ එය පවතින මතකයේ MB එකකට උපලක්ෂණ සංගුණකය / භාජක සංඛ්‍යාව පූරණය කරන බවයි. ඔබට බොහෝ සහසම්බන්ධතා හෝ ඉහළ සන්දර්භගත සිදුවීම් (සිදුවීම් මට්ටමේ මන්දාකිණි/ටැග් විශාල සංඛ්‍යාවක්) තිබේ නම් මෙම සංඛ්‍යාව ඉහළ නැංවීමට සලකා බලන්න.

source: Enable some performance heavy correlations (currently CIDR correlation)
si_lk: සමහර කාර්ය සාධන බර සහසම්බන්ධතා සබල කරන්න (දැනට CIDR සහසම්බන්ධය)

source: Enable this setting to directly save the config.php file without first creating a temporary file and moving it to avoid concurency issues. Generally not recommended, but useful when for example other tools modify/maintain the config.php file.
si_lk: config.php ගොනුව සෘජුවම සුරැකීමට මෙම සැකසුම සක්‍රීය කරන්න පළමුව තාවකාලික ගොනුවක් සාදා එය ගෙනයාමෙන් තොරව සමගාමී ගැටළු මඟහරවා ගන්න. සාමාන්‍යයෙන් නිර්දේශ නොකරයි, නමුත් උදාහරණයක් ලෙස වෙනත් මෙවලම් config.php ගොනුව වෙනස් කරන විට/පවත්වන විට ප්‍රයෝජනවත් වේ.

source: It is highly recommended to install all the python dependencies in a virtualenv. The recommended location is: %s/venv
si_lk: Virtualenv එකක සියලුම python පරායත්තතා ස්ථාපනය කිරීම ඉතා නිර්දේශිතයි. නිර්දේශිත ස්ථානය වන්නේ: %s/venv

source: MISP will default to the bundled mozilla certificate bundle shipped with the framework, which is rather stale. If you wish to use an alternate bundle, just set this setting using the path to the bundle to use. This setting can only be modified via the CLI.
si_lk: MISP රාමුව සමඟ නැව්ගත කරන ලද බණ්ඩල් කරන ලද mozilla සහතික මිටියට පෙරනිමි වනු ඇත, එය තරමක් පරණ ය. ඔබට විකල්ප මිටියක් භාවිතා කිරීමට අවශ්‍ය නම්, භාවිතා කිරීමට බණ්ඩලයට යන මාර්ගය භාවිතා කර මෙම සැකසුම සකසන්න. මෙම සැකසුම වෙනස් කළ හැක්කේ CLI හරහා පමණි.

source: In some cases, a heavily used MISP instance can generate unwanted blackhole errors due to a high number of requests hitting the server. Disable the auto logout functionality to ease the burden on the system.
si_lk: සමහර අවස්ථා වලදී, අධික ලෙස භාවිතා කරන ලද MISP අවස්ථාවක් සේවාදායකයට පහර දෙන ඉල්ලීම් විශාල සංඛ්‍යාවක් හේතුවෙන් අනවශ්‍ය බ්ලැක්හෝල් දෝෂ ජනනය කළ හැකිය. පද්ධතියේ බර ලිහිල් කිරීමට ස්වයංක්‍රීය පිටවීමේ ක්‍රියාකාරිත්වය අක්‍රීය කරන්න.

source: Set the ssdeep score at which to consider two ssdeep hashes as correlating [1-100]
si_lk: ssdeep හැෂ් දෙකක් සහසම්බන්ධ [1-100]ලෙස සැලකීමට ssdeep ලකුණු සකසන්න

source: Sets the maximum number of correlations that can be fetched with a single event. For extreme edge cases this can prevent memory issues. The default value is 5k.
si_lk: තනි සිදුවීමක් සමඟ ලබා ගත හැකි උපරිම සහසම්බන්ධතා සංඛ්‍යාව සකසයි. ආන්තික අවස්ථාවන් සඳහා මෙය මතක ගැටළු වළක්වා ගත හැකිය. පෙරනිමි අගය 5k වේ.

source: The message that users will see if the instance is not live.
si_lk: අවස්ථාව සජීවී නොවේ නම් පරිශීලකයින් දකින පණිවිඩය.
