Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: Are you sure you want to rerun all of the regex rules on every attribute in the database? This task will take a long while and will modify data indiscriminately based on the rules configured.
si_lk: දත්ත සමුදායේ ඇති සෑම උපලක්‍ෂණයකම සියලුම රීජෙක්ස් රීති නැවත ක්‍රියාත්මක කිරීමට අවශ්‍ය බව ඔබට විශ්වාසද? මෙම කාර්යයට බොහෝ කාලයක් ගතවනු ඇති අතර වින්‍යාස කර ඇති නීතිරීති මත පදනම්ව දත්ත විචක්ෂණ ලෙස වෙනස් කරනු ඇත.

source: Edit Regexp
si_lk: Regexp සංස්කරණය කරන්න

source: Delete Regexp
si_lk: Regexp මකන්න

source: Are you sure you want to delete #%s?
si_lk: ඔබට #%sමැකීමට අවශ්‍ය බව විශ්වාසද?

source: View Correlation Exclusion
si_lk: සහසම්බන්ධතා බැහැර කිරීම බලන්න

source: List Correlation Exclusions
si_lk: සහසම්බන්ධතා බැහැර කිරීම් ලැයිස්තුගත කරන්න

source: Add Correlation Exclusion
si_lk: සහසම්බන්ධතා බැහැර කිරීම් එකතු කරන්න

source: View Warninglist
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තුව බලන්න

source: Edit Warninglist
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තුව සංස්කරණය කරන්න

source: Add Warninglist
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තුව එක් කරන්න

source: List Warninglists
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තු ලැයිස්තුගත කරන්න

source: Update Warninglists
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තු යාවත්කාලීන කරන්න

source: Are you sure you want to update all warninglists?
si_lk: ඔබට සියලුම අනතුරු ඇඟවීමේ ලැයිස්තු යාවත්කාලීන කිරීමට අවශ්‍ය බව විශ්වාසද?

source: Search in Warninglists
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තු තුළ සොයන්න

source: View Noticelist
si_lk: දැන්වීම් ලැයිස්තුව බලන්න

source: List Noticelist
si_lk: දැන්වීම් ලැයිස්තුව

source: Update Noticelists
si_lk: දැනුම්දීම් යාවත්කාලීන කරන්න

source: Do you wish to continue and update all noticelists?
si_lk: ඔබ සියලු දැන්වීම් ලැයිස්තු දිගටම කරගෙන යාමට සහ යාවත්කාලීන කිරීමට කැමතිද?

source: List Allowedlist
si_lk: අවසර ලත් ලැයිස්තුව

source: New Allowedlist
si_lk: නව අවසර ලත් ලැයිස්තුව

source: Edit Allowedlist
si_lk: අවසර ලත් ලැයිස්තුව සංස්කරණය කරන්න

source: Delete Allowedlist
si_lk: අවසර ලත් ලැයිස්තුව මකන්න

source: Edit My Profile
si_lk: මගේ පැතිකඩ සංස්කරණය කරන්න

source: Change Password
si_lk: මුරපදය වෙනස් කරන්න

source: View Organisation
si_lk: සංවිධානය බලන්න

source: Edit Sharing Group
si_lk: බෙදාගැනීමේ කණ්ඩායම සංස්කරණය කරන්න

source: View Sharing Group
si_lk: බෙදාගැනීමේ කණ්ඩායම බලන්න

source: Explore Remote Server
si_lk: දුරස්ථ සේවාදායකය ගවේෂණය කරන්න

source: Explore Remote Event
si_lk: දුරස්ථ සිදුවීම ගවේෂණය කරන්න

source: Fetch This Event
si_lk: මෙම සිදුවීම ලබා ගන්න

source: Are you sure you want to fetch and save this event on your instance?
si_lk: ඔබට මෙම සිදුවීම ඔබගේ නිදසුන මත ලබා ගැනීමට සහ සුරැකීමට අවශ්‍ය බව විශ්වාසද?

source: Edit Server
si_lk: සේවාදායකය සංස්කරණය කරන්න

source: New Servers
si_lk: නව සේවාදායකයන්

source: View community
si_lk: ප්රජාව බලන්න

source: Request E-mail
si_lk: විද්‍යුත් තැපෑල ඉල්ලන්න

source: List Cerebrates
si_lk: ලැයිස්තුව සමරයි

source: View Cerebrate
si_lk: බලන්න Cerebrate

source: Restore Deleted Events
si_lk: මකා දැමූ සිදුවීම් ප්‍රතිසාධනය කරන්න

source: View User
si_lk: පරිශීලක බලන්න

source: Reset Password
si_lk: මුරපදය නැවත සකසන්න

source: Edit User
si_lk: පරිශීලක සංස්කරණය කරන්න

source: Delete User
si_lk: පරිශීලක මකන්න

source: Are you sure you want to delete #%s? It is highly recommended to never delete users but to disable them instead.
si_lk: ඔබට #%sමැකීමට අවශ්‍ය බව විශ්වාසද? කිසිවිටක පරිශීලකයන් මකා නොදැමීම, ඒ වෙනුවට ඒවා අක්‍රිය කිරීම නිර්දේශ කෙරේ.

source: Edit Role
si_lk: භූමිකාව සංස්කරණය කරන්න

source: Delete Role
si_lk: භූමිකාව මකන්න

source: Pending registrations
si_lk: පොරොත්තු ලියාපදිංචි කිරීම්

source: User settings
si_lk: පරිශීලක සැකසුම්

source: Add Organisation
si_lk: සංවිධානය එකතු කරන්න

source: Edit Organisation
si_lk: සංවිධානය සංස්කරණය කරන්න

source: Merge Organisation
si_lk: ඒකාබද්ධ සංවිධානය

source: Delete Organisation
si_lk: සංවිධානය මකන්න

source: Add Role
si_lk: භූමිකාව එක් කරන්න

source: Blocklists Organisation
si_lk: වාරණ ලැයිස්තු සංවිධානය

source: View Thread
si_lk: නූල් බලන්න

source: Add Post
si_lk: පෝස්ට් එකතු කරන්න

source: Edit Post
si_lk: පළ කිරීම සංස්කරණය කරන්න

source: List Threads
si_lk: නූල් ලැයිස්තුගත කරන්න

source: New Thread
si_lk: අලුත් Thread

source: List Favourite Tags
si_lk: ප්රියතම ටැග් ලැයිස්තුගත කරන්න

source: Edit Tag
si_lk: ටැගය සංස්කරණය කරන්න

source: View Taxonomy
si_lk: වර්ගීකරණය බලන්න

source: Delete Taxonomy
si_lk: වර්ගීකරණය මකන්න

source: Update Taxonomies
si_lk: වර්ගීකරණය යාවත්කාලීන කරන්න

source: View Template
si_lk: සැකිල්ල බලන්න

source: Edit Template
si_lk: සැකිල්ල සංස්කරණය කරන්න

source: Update Default Models
si_lk: පෙරනිමි මාදිලි යාවත්කාලීන කරන්න

source: Force Update Default Models
si_lk: බලහත්කාරයෙන් යාවත්කාලීන පෙරනිමි මාදිලි

source: Import Decaying Model
si_lk: ක්ෂය වන ආකෘතිය ආනයනය කරන්න

source: Add Decaying Model
si_lk: දිරාපත් වන ආකෘතිය එක් කරන්න

source: View Decaying Model
si_lk: දිරාපත් වන ආකෘතිය බලන්න

source: Edit Decaying Model
si_lk: ක්ෂය වන ආකෘතිය සංස්කරණය කරන්න

source: Add Feed
si_lk: සංග්‍රහය එක් කරන්න

source: Import Feeds from JSON
si_lk: JSON වෙතින් සංග්‍රහ ආයාත කරන්න

source: Feed overlap analysis matrix
si_lk: සංග්‍රහ අතිච්ඡාදනය විශ්ලේෂණ අනුකෘතිය

source: Export Feed settings
si_lk: අපනයන සංග්‍රහ සැකසුම්

source: Edit Feed
si_lk: සංග්‍රහය සංස්කරණය කරන්න

source: View Feed
si_lk: සංග්‍රහය බලන්න

source: PreviewIndex
si_lk: පෙරදසුන් දර්ශකය

source: PreviewEvent
si_lk: පෙරදසුන් සිදුවීම

source: View News
si_lk: පුවත් බලන්න

source: Add News Item
si_lk: පුවත් අයිතම එකතු කරන්න

source: Edit News Item
si_lk: ප්‍රවෘත්ති අයිතමය සංස්කරණය කරන්න

source: List Cluster Blocklists
si_lk: පොකුරු වාරණ ලැයිස්තු ලැයිස්තුගත කරන්න

source: Update Galaxies
si_lk: Galaxies යාවත්කාලීන කරන්න

source: Are you sure you want to reimport all galaxies from the submodule?
si_lk: උප මොඩියුලයෙන් සියලුම මන්දාකිණි නැවත ආයාත කිරීමට අවශ්‍ය බව ඔබට විශ්වාසද?

source: Force Update Galaxies
si_lk: බලහත්කාරයෙන් Galaxies යාවත්කාලීන කරන්න

source: Are you sure you want to drop and reimport all galaxies from the submodule?
si_lk: උපමොඩියුලයෙන් සියලුම මන්දාකිණි අතහැර නැවත ආයාත කිරීමට අවශ්‍ය බව ඔබට විශ්වාසද?

source: Wipe Default Galaxy Clusters
si_lk: Default Galaxy Clusters පිස දමන්න

source: Are you sure you want to drop all default galaxy clusters?
si_lk: ඔබට සියලු පෙරනිමි මන්දාකිණි පොකුරු අත්හැරීමට අවශ්‍ය බව විශ්වාසද?

source: Import Galaxy Clusters
si_lk: Galaxy Clusters ආනයනය කරන්න

source: Export Galaxy Clusters
si_lk: Galaxy Clusters අපනයනය කරන්න

source: View Galaxy
si_lk: Galaxy බලන්න

source: View Cluster
si_lk: පොකුර බලන්න

source: Edit Cluster
si_lk: සංස්කරණ පොකුර

source: Add Cluster
si_lk: පොකුරු එකතු කරන්න

source: Fork Cluster
si_lk: ෆෝක් පොකුර

source: Unpublish Cluster
si_lk: ප්‍රකාශනය ඉවත් කරන්න පොකුර

source: Publish Cluster
si_lk: පර්ෂදය ප්‍රකාශ කරන්න

source: Add Relationship
si_lk: සම්බන්ධතාවය එකතු කරන්න

source: Update Objects
si_lk: වස්තු යාවත්කාලීන කරන්න

source: View Object Template
si_lk: Object Template බලන්න

source: Add SightingDB connection
si_lk: SightingDB සම්බන්ධතාවය එක් කරන්න

source: Edit SightingDB connection
si_lk: SightingDB සම්බන්ධතාවය සංස්කරණය කරන්න

source: List SightingDB connections
si_lk: SightingDB සම්බන්ධතා ලැයිස්තුගත කරන්න

source: %s view
si_lk: %s බැලීම

source: Add organisation
si_lk: සංවිධානය එකතු කරන්න

source: Add individual
si_lk: තනි පුද්ගල එකතු කරන්න

source: Show database indexes
si_lk: දත්ත සමුදා දර්ශක පෙන්වන්න

source: Index diagnostic:
si_lk: දර්ශක රෝග විනිශ්චය:

source: Notice
si_lk: දැනුම්දීම

source: The highlighted issues may be benign. if you are unsure, please open an issue and ask for clarification.
si_lk: උද්දීපනය කරන ලද ගැටළු අශුභ විය හැකිය. ඔබට විශ්වාස නැත්නම්, කරුණාකර ගැටලුවක් විවෘත කර පැහැදිලි කිරීමක් ඉල්ලා සිටින්න.

source: Fix Database Index Schema
si_lk: දත්ත සමුදා දර්ශක යෝජනා ක්‍රමය නිවැරදි කරන්න

source: Executing this query might take some time and may harm your database. Please review the query below or backup your database in case of doubt.
si_lk: මෙම විමසුම ක්‍රියාත්මක කිරීමට යම් කාලයක් ගත විය හැකි අතර ඔබගේ දත්ත ගබඩාවට හානි විය හැක. කරුණාකර පහත විමසුම සමාලෝචනය කරන්න හෝ සැකයක් ඇත්නම් ඔබේ දත්ත සමුදාය උපස්ථ කරන්න.

source: An update is currently in progress.
si_lk: යාවත්කාලීන කිරීමක් දැනට සිදු වෙමින් පවතී.

source: You can check the current progress %s.
si_lk: ඔබට වත්මන් ප්‍රගතිය පරීක්ෂා කළ හැක %s.

source: here
si_lk: මෙතන

source: The current database schema does not match the expected format.
si_lk: වත්මන් දත්ත සමුදා යෝජනා ක්රමය අපේක්ෂිත ආකෘතියට නොගැලපේ.

source: Database schema diagnostic:
si_lk: දත්ත සමුදා ක්‍රම රෝග විනිශ්චය:

source: The MISP database state does not match the expected schema. Resolving these issues is recommended.
si_lk: MISP දත්ත සමුදා තත්ත්වය අපේක්ෂිත යෝජනා ක්‍රමයට නොගැලපේ. මෙම ගැටළු විසඳීම නිර්දේශ කරනු ලැබේ.

source: ⚠ This diagnostic tool is in experimental state - the highlighted issues may be benign. If you are unsure, please open an issue on with the issues identified over at https://github.com/MISP/MISP for clarification.
si_lk: ⚠ මෙම රෝග විනිශ්චය මෙවලම පර්යේෂණාත්මක තත්ත්වයක පවතී - උද්දීපනය කරන ලද ගැටළු අශුභ විය හැක. ඔබට අවිනිශ්චිත නම්, පැහැදිලි කිරීම සඳහා https://github.com/MISP/MISP හි හඳුනාගෙන ඇති ගැටළු පිළිබඳ ගැටලුවක් විවෘත කරන්න.

source: Debug mode: Reveal benign deltas
si_lk: නිදොස් කිරීමේ මාදිලිය: නිරපේක්ෂ ඩෙල්ටා හෙළි කරන්න

source: Most of the time, these benign deltas are artifacts coming from a different database version or RDBMS system used by this instance and thus, can be ignored.
si_lk: බොහෝ විට, මෙම නිරපේක්ෂ ඩෙල්ටා මෙම අවස්ථාව භාවිතා කරන වෙනත් දත්ත සමුදා අනුවාදයකින් හෝ RDBMS පද්ධතියකින් එන පුරාවස්තු වන අතර, එබැවින් නොසලකා හැරිය හැක.

source: Table name
si_lk: මේසයේ නම

source: Expected schema
si_lk: අපේක්ෂිත යෝජනා ක්රමය

source: Actual schema
si_lk: සැබෑ සැලැස්ම

source: Fix Database schema
si_lk: දත්ත සමුදා සැලැස්ම නිවැරදි කරන්න

source: The current database is correct
si_lk: වත්මන් දත්ත සමුදාය නිවැරදියි

source: Expected DB_version:
si_lk: අපේක්ෂිත DB_version:

source: The current database version matches the expected one
si_lk: වත්මන් දත්ත සමුදා අනුවාදය අපේක්ෂිත එකට ගැලපේ

source: Actual DB_version:
si_lk: සැබෑ DB_version:

source: The current database version does not match the expected one
si_lk: වත්මන් දත්ත සමුදා අනුවාදය අපේක්ෂිත එකට නොගැලපේ

source: Updates are locked
si_lk: යාවත්කාලීන අගුලු දමා ඇත

source: Updates are not locked
si_lk: යාවත්කාලීන අගුලු දමා නැත

source: Updates are locked due to to many update fails
si_lk: බොහෝ යාවත්කාලීන අසාර්ථක වීම හේතුවෙන් යාවත්කාලීන අගුලු දමා ඇත

source: Updates unlocked in %s
si_lk: යාවත්කාලීන %sකින් අගුලු හරින ලදී

source: DataSource:
si_lk: දත්ත මූලාශ්රය:

source: Column diagnostic
si_lk: තීරු රෝග විනිශ්චය

source: Incorrect database encoding setting: Your database connection is currently NOT set to UTF-8. Please make sure to uncomment the 'encoding' => 'utf8' line in
si_lk: වැරදි දත්ත සමුදා කේතන සැකසුම: ඔබගේ දත්ත සමුදා සම්බන්ධතාවය දැනට UTF-8 ලෙස සකසා නොමැත. කරුණාකර 'කේතනය' => 'utf8' රේඛාවේ අදහස් දැක්වීම ඉවත් කිරීමට වග බලා ගන්න

source: MISP version
si_lk: MISP අනුවාදය

source: Every version of MISP includes a JSON file with the current version. This is checked against the latest tag on GitHub, if there is a version mismatch the tool will warn you about it. Make sure that you update MISP regularly.
si_lk: MISP හි සෑම අනුවාදයකම වත්මන් අනුවාදය සමඟ JSON ගොනුවක් ඇතුළත් වේ. මෙය GitHub හි නවතම ටැගයට එරෙහිව පරීක්ෂා කරනු ලැබේ, අනුවාද නොගැලපීමක් තිබේ නම් මෙවලම ඔබට ඒ ගැන අනතුරු අඟවයි. ඔබ නිතිපතා MISP යාවත්කාලීන කරන බවට වග බලා ගන්න.

source: Currently installed version…
si_lk: දැනට ස්ථාපනය කර ඇති අනුවාදය…

source: Upcoming development version
si_lk: ඉදිරි සංවර්ධන අනුවාදය

source: Outdated version
si_lk: යල් පැන ගිය අනුවාදය

source: Could not retrieve version from GitHub
si_lk: GitHub වෙතින් අනුවාදය ලබා ගැනීමට නොහැකි විය

source: Unable to fetch current commit ID, check apache user read privilege.
si_lk: වත්මන් කැපවීම් හැඳුනුම්පත ලබා ගැනීමට නොහැකි විය, apache පරිශීලක කියවීමේ වරප්‍රසාදය පරීක්ෂා කරන්න.

source: Latest available version…
si_lk: පවතින නවතම අනුවාදය…

source: Status…
si_lk: තත්ත්වය…

source: Current branch…
si_lk: වත්මන් ශාඛාව…

source: You are not on a branch, Update MISP will fail
si_lk: ඔබ ශාඛාවක නැත, MISP යාවත්කාලීන කිරීම අසාර්ථක වනු ඇත

source: Pull the latest MISP version from GitHub
si_lk: GitHub වෙතින් නවතම MISP අනුවාදය අදින්න

source: Update MISP
si_lk: MISP යාවත්කාලීන කරන්න

source: Click the following button to go to the update progress page. This page lists all updates that are currently queued and executed.
si_lk: යාවත්කාලීන ප්‍රගති පිටුවට යාමට පහත බොත්තම ක්ලික් කරන්න. මෙම පිටුව දැනට පෝලිම් කර ක්‍රියාත්මක කර ඇති සියලුම යාවත්කාලීන ලැයිස්තුගත කරයි.

source: View Update Progress
si_lk: යාවත්කාලීන ප්‍රගතිය බලන්න

source: Submodules version
si_lk: උප මොඩියුල අනුවාදය

source: Refresh submodules version.
si_lk: උපමොඩියුල අනුවාදය නැවුම් කරන්න.

source: Load all JSON into the database.
si_lk: සියලුම JSON දත්ත ගබඩාවට පූරණය කරන්න.

source: Load JSON into database
si_lk: JSON දත්ත ගබඩාවට පූරණය කරන්න

source: Writeable Directories and files
si_lk: ලිවිය හැකි නාමාවලි සහ ගොනු

source: The following directories and files have to be writeable for MISP to function properly. Make sure that the apache user has write privileges for the directories below.
si_lk: MISP නිසි ලෙස ක්‍රියා කිරීම සඳහා පහත නාමාවලි සහ ගොනු ලිවිය හැකි විය යුතුය. apache පරිශීලකයාට පහත නාමාවලි සඳහා ලිවීමේ වරප්‍රසාද ඇති බවට වග බලා ගන්න.

source: Directories
si_lk: නාමාවලි

source: Directory
si_lk: නාමාවලිය

source: Writeable Files
si_lk: ලිවිය හැකි ගොනු

source: File
si_lk: ගොනුව

source: Readable Files
si_lk: කියවිය හැකි ගොනු

source: Security Audit
si_lk: ආරක්ෂක විගණනය

source: Congratulation, your instance pass all security checks.
si_lk: සුභ පැතුම්, ඔබගේ නිදසුන සියලු ආරක්ෂක පරීක්ෂාවන් සමත් වේ.

source: Area
si_lk: ප්රදේශය

source: Level
si_lk: මට්ටමින්

source: Message
si_lk: පණිවුඩය

source: Hint
si_lk: ඉඟිය

source: More info
si_lk: වැඩි විස්තර

source: PHP Settings
si_lk: PHP සැකසුම්

source: Up to date
si_lk: යාවත්කාලීනව

source: Issues determining version
si_lk: අනුවාදය තීරණය කිරීමේ ගැටළු

source: Update highly recommended
si_lk: යාවත්කාලීන කිරීම ඉතා නිර්දේශිතයි

source: Version unsupported, update ASAP
si_lk: අනුවාදය සහාය නොදක්වයි, ඉක්මනින් යාවත්කාලීන කරන්න

source: Version unsupported, 8.x support not available yet.
si_lk: අනුවාද සඳහා සහය නොදක්වයි, 8.x සහාය තවමත් නොමැත.

source: PHP ini path
si_lk: PHP ini මාර්ගය

source: PHP Version
si_lk: PHP අනුවාදය

source: recommended
si_lk: නිර්දේශ කර ඇත

source: PHP CLI Version
si_lk: PHP CLI අනුවාදය

source: The following settings might have a negative impact on certain functionalities of MISP with their current and recommended minimum settings. You can adjust these in your php.ini. Keep in mind that the recommendations are not requirements, just recommendations. Depending on usage you might want to go beyond the recommended values.
si_lk: පහත සැකසීම් MISP හි ඇතැම් ක්‍රියාකාරීත්වයන්ට ඒවායේ වත්මන් සහ නිර්දේශිත අවම සැකසුම් සමඟ ඍණාත්මක බලපෑමක් ඇති කළ හැකිය. ඔබට මේවා ඔබගේ php.ini හි සීරුමාරු කළ හැක. නිර්දේශ අවශ්‍යතා නොවන බව මතක තබා ගන්න, නිර්දේශ පමණි. භාවිතය අනුව ඔබට නිර්දේශිත අගයන් ඉක්මවා යාමට අවශ්‍ය විය හැක.

source: Low
si_lk: අඩු

source: PHP Extensions
si_lk: PHP දිගු

source: Extension
si_lk: දිගු කිරීම

source: Why to install
si_lk: ස්ථාපනය කරන්නේ ඇයි

source: Web
si_lk: වෙබ්

source: Version %s installed, but required at least %s
si_lk: අනුවාදය %s ස්ථාපනය කර ඇත, නමුත් අවම වශයෙන් %sඅවශ්ය වේ

source: Table
si_lk: වගුව

source: Used
si_lk: පාවිච්චි කළා

source: Reclaimable
si_lk: ආපසු ලබාගත හැකි

source: SQL database status
si_lk: SQL දත්ත සමුදා තත්ත්වය

source: Size of each individual table on disk, along with the size that can be freed via SQL optimize. Make sure that you always have at least 3x the size of the largest table in free space in order for the update scripts to work as expected.
si_lk: තැටියේ ඇති එක් එක් වගුවේ ප්‍රමාණය, SQL ප්‍රශස්තකරණය හරහා නිදහස් කළ හැකි ප්‍රමාණය සමඟ. යාවත්කාලීන ස්ක්‍රිප්ට් බලාපොරොත්තු වන පරිදි ක්‍රියා කිරීම සඳහා ඔබට සෑම විටම විශාලම වගුවේ ප්‍රමාණයෙන් 3x ප්‍රමාණය නිදහස් ඉඩක් ඇති බවට වග බලා ගන්න.

source: Schema status
si_lk: යෝජනා ක්රමයේ තත්ත්වය

source: Redis info
si_lk: Redis තොරතුරු

source: PHP extension version
si_lk: PHP දිගු අනුවාදය

source: Not installed.
si_lk: ස්ථාපනය කර නැත.

source: Redis version
si_lk: රෙඩිස් අනුවාදය

source: Memory allocator
si_lk: මතක වෙන් කරන්නා

source: Memory usage
si_lk: මතක භාවිතය

source: Peak memory usage
si_lk: උපරිම මතක භාවිතය

source: Fragmentation ratio
si_lk: ඛණ්ඩනය අනුපාතය

source: Total system memory
si_lk: සම්පූර්ණ පද්ධති මතකය

source: Advanced attachment handler
si_lk: උසස් ඇමුණුම් හසුරුව

source: The advanced attachment tools are used by the add attachment functionality to extract additional data about the uploaded sample.
si_lk: උඩුගත කළ නියැදිය පිළිබඳ අමතර දත්ත උකහා ගැනීම සඳහා ඇඩ් ඇමිණුම් ක්‍රියාකාරීත්වය මඟින් උසස් ඇමුණුම් මෙවලම් භාවිත කෙරේ.

source: Not installed or version outdated.
si_lk: ස්ථාපනය කර නැත හෝ අනුවාදය යල් පැන ගොස් නැත.

source: Attachment scan module
si_lk: ඇමුණුම් ස්කෑන් මොඩියුලය

source: Not available.
si_lk: ලද නොහැක.

source: STIX and Cybox libraries
si_lk: STIX සහ Cybox පුස්තකාල

source: Mitre's STIX and Cybox python libraries have to be installed in order for MISP's STIX export to work. Make sure that you install them (as described in the MISP installation instructions) if you receive an error below.
si_lk: MISP හි STIX අපනයනය ක්‍රියා කිරීම සඳහා Mitre's STIX සහ Cybox python පුස්තකාල ස්ථාපනය කළ යුතුය. ඔබට පහත දෝෂයක් ලැබුනේ නම් (MISP ස්ථාපන උපදෙස් වල විස්තර කර ඇති පරිදි) ඔබ ඒවා ස්ථාපනය කරන බවට වග බලා ගන්න.

source: If you run into any issues here, make sure that both STIX and CyBox are installed as described in the INSTALL.txt file.
si_lk: ඔබට මෙහි කිසියම් ගැටළුවක් ඇති වුවහොත්, INSTALL.txt ගොනුවේ විස්තර කර ඇති පරිදි STIX සහ CyBox යන දෙකම ස්ථාපනය කර ඇති බවට වග බලා ගන්න.

source: Could not run test script (stixtest.py). Please check error logs for more details.
si_lk: පරීක්ෂණ ස්ක්‍රිප්ට් ධාවනය කළ නොහැක (stixtest.py). වැඩි විස්තර සඳහා කරුණාකර දෝෂ ලඝු පරීක්ෂා කරන්න.

source: Current libraries status
si_lk: වත්මන් පුස්තකාල තත්ත්වය

source: Failed to run STIX diagnostics tool.
si_lk: STIX diagnostics මෙවලම ධාවනය කිරීමට අසමත් විය.

source: Some of the libraries related to STIX are not installed. Make sure that all libraries listed below are correctly installed.
si_lk: STIX සම්බන්ධ සමහර පුස්තකාල ස්ථාපනය කර නැත. පහත ලැයිස්තුගත කර ඇති සියලුම පුස්තකාල නිවැරදිව ස්ථාපනය කර ඇති බවට වග බලා ගන්න.

source: Some versions should be updated.
si_lk: සමහර අනුවාද යාවත්කාලීන කළ යුතුය.

source: Library
si_lk: පුස්තකාලය

source: Expected version
si_lk: අපේක්ෂිත අනුවාදය

source: Installed version
si_lk: ස්ථාපිත අනුවාදය

source: Not installed
si_lk: ස්ථාපනය කර නැත

source: Correct
si_lk: නිවැරදි

source: Incorrect
si_lk: වැරදියි

source: Yara
si_lk: යාරා

source: This tool tests whether plyara, the library used by the yara export tool is installed or not.
si_lk: යාරා අපනයන මෙවලම භාවිතා කරන පුස්තකාලය වන plyara ස්ථාපනය කර තිබේද නැද්ද යන්න මෙම මෙවලම පරීක්ෂා කරයි.

source: Failed to run yara diagnostics tool.
si_lk: යාර රෝග විනිශ්චය මෙවලම ධාවනය කිරීමට අසමත් විය.

source: Invalid plyara version / plyara not installed. Please run pip3 install plyara
si_lk: වලංගු නොවන ප්ලයිරා අනුවාදය / ප්ලයිරා ස්ථාපනය කර නැත. කරුණාකර pip3 ස්ථාපනය plyara ධාවනය කරන්න

source: plyara library installed
si_lk: plyara පුස්තකාලය ස්ථාපනය කර ඇත

source: This tool tests whether your GnuPG is set up correctly or not.
si_lk: මෙම මෙවලම ඔබගේ GnuPG නිවැරදිව සකසා තිබේද නැද්ද යන්න පරීක්ෂා කරයි.

source: GnuPG installation and settings
si_lk: GnuPG ස්ථාපනය සහ සැකසුම්

source: GnuPG version: %s
si_lk: GnuPG අනුවාදය: %s

source: This tool tests whether the ZeroMQ extension is installed and functional.
si_lk: මෙම මෙවලම ZeroMQ දිගුව ස්ථාපනය කර ක්‍රියාකාරීද යන්න පරීක්ෂා කරයි.

source: ZeroMQ settings
si_lk: ZeroMQ සැකසුම්

source: Start ZMQ service
si_lk: ZMQ සේවාව ආරම්භ කරන්න

source: Start ZeroMQ service
si_lk: ZeroMQ සේවාව ආරම්භ කරන්න

source: Start
si_lk: ආරම්භ කරන්න

source: Stop ZeroMQ service
si_lk: ZeroMQ සේවාව නවත්වන්න

source: Stop
si_lk: නවත්වන්න

source: Check ZeroMQ service status
si_lk: ZeroMQ සේවා තත්ත්වය පරීක්ෂා කරන්න

source: Proxy
si_lk: ප්‍රොක්සි

source: This tool tests whether your HTTP proxy settings are correct.
si_lk: මෙම මෙවලම ඔබගේ HTTP ප්‍රොක්සි සැකසුම් නිවැරදිද යන්න පරීක්ෂා කරයි.

source: Proxy settings
si_lk: ප්‍රොක්සි සැකසුම්

source: Module System
si_lk: මොඩියුල පද්ධතිය

source: This tool tests the various module systems and whether they are reachable based on the module settings.
si_lk: මෙම මෙවලම විවිධ මොඩියුල පද්ධති සහ ඒවා මොඩියුල සැකසුම් මත පදනම්ව ළඟා විය හැකිද යන්න පරීක්ෂා කරයි.

source: module system
si_lk: මොඩියුල පද්ධතිය

source: Session table
si_lk: සැසි වගුව

source: This tool checks how large your database's session table is. <br />Sessions in CakePHP rely on PHP's garbage collection for clean-up and in certain distributions this can be disabled by default resulting in an ever growing cake session table. <br />If you are affected by this, just click the clean session table button below.
si_lk: මෙම මෙවලම ඔබගේ දත්ත සමුදායේ සැසි වගුව කොතරම් විශාලදැයි පරීක්ෂා කරයි. <br />CakePHP හි සැසි පිරිසිදු කිරීම සඳහා PHP හි කසළ එකතු කිරීම මත රඳා පවතින අතර ඇතැම් බෙදාහැරීම් වලදී මෙය පෙරනිමියෙන් අක්‍රිය කළ හැකි අතර එහි ප්‍රතිඵලයක් ලෙස දිනෙන් දින වර්ධනය වන කේක් සැසි වගුවක් ඇති වේ. <br />ඔබට මෙය බලපාන්නේ නම්, පහත පිරිසිදු සැසි වගු බොත්තම ක්ලික් කරන්න.

source: Expired sessions
si_lk: කල් ඉකුත් වූ සැසි

source: Purge sessions
si_lk: පිරිසිදු කිරීමේ සැසි

source: Upgrade authkeys keys to the advanced keys format
si_lk: Autkeys යතුරු උසස් යතුරු ආකෘතියට උත්ශ්‍රේණි කරන්න

source: MISP can store the user API keys either in the clear directly attached to the users, or as of recently, it can generate a list of hashed keys for different purposes. If the latter feature is enabled, it might be useful to move all existing keys over to the new format so that users do not lose access to the system. In order to do so, run the following functionality.
si_lk: MISP හට පරිශීලක API යතුරු පරිශීලකයින්ට සෘජුවම අමුණා ඇති පැහැදිලිව ගබඩා කළ හැක, නැතහොත් මෑතක සිට විවිධ අරමුණු සඳහා හැෂ් යතුරු ලැයිස්තුවක් ජනනය කළ හැක. අවසාන විශේෂාංගය සක්‍රීය කර ඇත්නම්, පරිශීලකයින්ට පද්ධතියට ප්‍රවේශය අහිමි නොවන පරිදි පවතින සියලුම යතුරු නව ආකෘතියට මාරු කිරීම ප්‍රයෝජනවත් විය හැකිය. එසේ කිරීම සඳහා පහත ක්‍රියාකාරීත්වය ක්‍රියාත්මක කරන්න.

source: Update Authkeys to advanced Authkeys
si_lk: Autkeys උසස් Autkeys වෙත යාවත්කාලීන කරන්න

source: Clean model cache
si_lk: ආකෘති හැඹිලිය පිරිසිදු කරන්න

source: If you ever run into issues with missing database fields / tables, please run the following script to clean the model cache.
si_lk: ඔබ කවදා හෝ අතුරුදහන් වූ දත්ත සමුදා ක්ෂේත්‍ර / වගු සම්බන්ධ ගැටළු වලට මුහුණ දෙන්නේ නම්, කරුණාකර ආකෘති හැඹිලිය පිරිසිදු කිරීමට පහත ස්ක්‍රිප්ට් එක ධාවනය කරන්න.

source: Clean cache
si_lk: හැඹිලිය පිරිසිදු කරන්න

source: Check for deprecated function usage
si_lk: අත්හරින ලද කාර්යය භාවිතය සඳහා පරීක්ෂා කරන්න

source: In an effort to identify the usage of deprecated functionalities, MISP has started aggregating the count of access requests to these endpoints. Check the frequency of their use below along with the users to potentially warn about better ways of achieving their goals.
si_lk: අත්හැර දැමූ ක්‍රියාකාරීත්වයන්ගේ භාවිතය හඳුනාගැනීමේ ප්‍රයත්නයක් ලෙස, MISP විසින් මෙම අන්ත ලක්ෂ්‍ය වෙත ප්‍රවේශ ඉල්ලීම් ගණන එකතු කිරීම ආරම්භ කර ඇත. ඔවුන්ගේ අරමුණු සාක්ෂාත් කර ගැනීමේ වඩා හොඳ ක්‍රම ගැන අනතුරු ඇඟවීමට පරිශීලකයන් සමඟ ඔවුන්ගේ භාවිතයේ වාර ගණන පහතින් පරීක්ෂා කරන්න.

source: View deprecated endpoint usage
si_lk: අත්හැර දැමූ අන්ත ලක්ෂ්‍ය භාවිතය බලන්න

source: Orphaned attributes
si_lk: අනාථ ගුණාංග
