Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: The sector of the organisation
si_lk: සංවිධානයේ අංශය

source: Will only return the sharing group ID
si_lk: බෙදාගැනීමේ කණ්ඩායම් හැඳුනුම්පත පමණක් ආපසු ලබා දෙනු ඇත

source: Sharing group ID
si_lk: කණ්ඩායම් හැඳුනුම්පත බෙදා ගැනීම

source: The source of the Sighting (e.g. honeypot_1)
si_lk: දර්ශනයේ මූලාශ්‍රය (උදා: honeypot_1)

source: Only returns tags matching exactly the tag name (thus skipping synonyms and cluster's value)
si_lk: ටැග් නමට හරියටම ගැළපෙන ටැග් පමණක් ආපසු ලබා දෙයි (එමගින් සමාන පද සහ පොකුරු අගය මඟ හැරේ)

source: The email's subject
si_lk: ඊමේල් විෂය

source: Base64 encoded certificate
si_lk: Base64 කේතනය කළ සහතිකය

source: A tag ID to attach to created events
si_lk: සාදන ලද සිදුවීම් වෙත ඇමිණීමට ටැග් හැඳුනුම්පතක්

source: The provided ID will be reused as an existing event
si_lk: සපයා ඇති හැඳුනුම්පත පවතින සිදුවීමක් ලෙස නැවත භාවිත කෙරේ

source: Time of the sighting with the form `h:i:s`
si_lk: `h:i:s` පෝරමය සමඟින් දර්ශනය වූ වේලාව

source: The title of the log
si_lk: ලොගයේ මාතෘකාව

source: The date to which the event was published
si_lk: සිදුවීම ප්‍රකාශයට පත් කළ දිනය

source: The state of the `to_ids` flag
si_lk: `to_ids` ධජයේ තත්ත්වය

source: The type of the attribute
si_lk: ගුණාංගයේ වර්ගය

source: Placeholder containing values to sight
si_lk: දර්ශනයට අගයන් අඩංගු තැන් දරන්නා

source: Not supported (warninglist->checkvalues) expect an array
si_lk: සහාය නොදක්වයි (අවවාද ලැයිස්තුව-> පිරික්සුම් අගයන්) අරාවක් බලාපොරොත්තු වන්න

source: Not supported
si_lk: සහාය නොදක්වයි

source: Also supports array of tags
si_lk: ටැග් අරාවට ද සහය දක්වයි

source: Attribute id
si_lk: උපලක්ෂණ id

source: Seen within the last x amount of time, where x can be defined in days, hours, minutes (for example 5d or 12h or 30m)
si_lk: අවසාන x කාල ප්‍රමාණය තුළ දක්නට ලැබේ, එහිදී x දින, පැය, මිනිත්තු වලින් අර්ථ දැක්විය හැක (උදාහරණයක් ලෙස 5d හෝ 12h හෝ 30m)

source: Indexing %s -> %s
si_lk: සුචිගත කිරීම %s -> %s

source: Issues executing the pre-update test `%s`. The returned error is: %s
si_lk: පූර්ව යාවත්කාලීන පරීක්ෂණය ක්‍රියාත්මක කිරීමේ ගැටළු `%s. ආපසු පැමිණි දෝෂය වන්නේ: %s

source: Successfully executed the SQL query for
si_lk: සඳහා SQL විමසුම සාර්ථකව ක්‍රියාත්මක කරන ලදී

source: The executed SQL query was: %s
si_lk: ක්‍රියාත්මක කරන ලද SQL විමසුම: %s

source: Successfully executed the SQL query for %s
si_lk: %sසඳහා SQL විමසුම සාර්ථකව ක්‍රියාත්මක කරන ලදී

source: Issues executing the SQL query for %s
si_lk: %sසඳහා SQL විමසුම ක්‍රියාත්මක කිරීමේ ගැටළු

source: The executed SQL query was:
si_lk: ක්‍රියාත්මක කළ SQL විමසුම වූයේ:

source: The returned error is:
si_lk: ආපසු පැමිණි දෝෂය වන්නේ:

source: Issues executing the SQL query for `%s`. The returned error is:
si_lk: `%s` සඳහා SQL විමසුම ක්‍රියාත්මක කිරීමේ ගැටළු. ආපසු පැමිණි දෝෂය වන්නේ:

source: However, as this error is allowed, the update went through.
si_lk: කෙසේ වෙතත්, මෙම දෝෂය අවසර දී ඇති බැවින්, යාවත්කාලීන කිරීම සිදු විය.

source: Successfully indexed %s -> %s
si_lk: %s -> %sසාර්ථකව සුචිගත කරන ලදී

source: Failed to add index
si_lk: දර්ශකය එක් කිරීමට අසමත් විය

source: The returned error is:
si_lk: ආපසු පැමිණි දෝෂය වන්නේ:

source: Database updates stopped as some errors occurred and the stop flag is enabled.
si_lk: සමහර දෝෂ ඇති වූ අතර නැවතුම් ධජය සක්‍රීය කර ඇති බැවින් දත්ත සමුදා යාවත්කාලීන කිරීම් නතර විය.

source: Invalid JSON.
si_lk: වලංගු නොවන JSON.

source: Issues executing run_updates
si_lk: Run_updates ක්‍රියාත්මක කිරීමේ ගැටළු

source: Database updates are locked. Worker not spawned
si_lk: දත්ත සමුදා යාවත්කාලීන අගුලු දමා ඇත. කම්කරුවා බිහි වී නැත

source: Update done
si_lk: යාවත්කාලීන කර ඇත

source: Updates are locked. Stopping worker gracefully
si_lk: යාවත්කාලීන අගුලු දමා ඇත. සේවකයා අලංකාර ලෙස නතර කිරීම

source: Running update %s
si_lk: යාවත්කාලීන %sක්‍රියාත්මක වේ

source: Update done in another worker. Gracefully stopping.
si_lk: යාවත්කාලීන කිරීම වෙනත් සේවකයෙකු තුළ සිදු කරන ලදී. සුහදව නවතිනවා.

source: Your organisation only
si_lk: ඔබේ සංවිධානය පමණි

source: This community only
si_lk: මෙම ප්රජාව පමණි

source: Connected communities
si_lk: සම්බන්ධිත ප්රජාවන්

source: All communities
si_lk: සියලුම ප්රජාවන්

source: Inherit event
si_lk: සිදුවීම උරුමය

source: Composite type, but value not explodable
si_lk: සංයුක්ත වර්ගය, නමුත් අගය පුපුරා යා නොහැක

source: The entered string is too long and would get truncated. Please consider adding the data as an attachment instead
si_lk: ඇතුළත් කළ තන්තුව ඉතා දිගු වන අතර එය කපා හැරෙනු ඇත. කරුණාකර ඒ වෙනුවට ඇමුණුමක් ලෙස දත්ත එක් කිරීම සලකා බලන්න

source: Could not read user.
si_lk: පරිශීලක කියවීමට නොහැකි විය.

source: Invalid hash type.
si_lk: වලංගු නොවන හැෂ් වර්ගය.

source: This field is mandatory.
si_lk: මෙම ක්ෂේත්රය අනිවාර්ය වේ.

source: Something went wrong. Received a non-numeric event ID while trying to create a zip archive of an uploaded malware sample.
si_lk: මොකක්හරි වැරැද්දක් වෙලා. උඩුගත කරන ලද අනිෂ්ට මෘදුකාංග නියැදියක zip සංරක්ෂිතයක් සෑදීමට උත්සාහ කරන අතරතුර සංඛ්‍යාත්මක නොවන සිදුවීම් ID එකක් ලැබුණි.

source: Reference used by the publishing party (e.g. ticket number)
si_lk: ප්‍රකාශන පාර්ශවය විසින් භාවිතා කරන ලද යොමුව (උදා ප්‍රවේශපත්‍ර අංකය)

source: Internal Attack Targeting and Compromise Information
si_lk: අභ්‍යන්තර ප්‍රහාර ඉලක්ක කිරීම සහ සම්මුති තොරතුරු

source: Targeting information to include recipient email, infected machines, department, and or locations.
si_lk: ලබන්නාගේ විද්‍යුත් තැපෑල, ආසාදිත යන්ත්‍ර, දෙපාර්තමේන්තුව, සහ හෝ ස්ථාන ඇතුළත් කිරීමට තොරතුරු ඉලක්ක කිරීම.

source: All the info about how the malware is detected by the antivirus products
si_lk: ප්‍රති-වයිරස නිෂ්පාදන මගින් අනිෂ්ට මෘදුකාංග අනාවරණය කරගන්නා ආකාරය පිළිබඳ සියලු තොරතුරු

source: List of anti-virus vendors detecting the malware or information on detection performance (e.g. 13/43 or 67%). Attachment with list of detection or link to VirusTotal could be placed here as well.
si_lk: අනිෂ්ට මෘදුකාංග හඳුනාගන්නා ප්‍රති-වයිරස වෙළෙන්දන්ගේ ලැයිස්තුව හෝ හඳුනාගැනීමේ කාර්ය සාධනය පිළිබඳ තොරතුරු (උදා: 13/43 හෝ 67%). හඳුනාගැනීම් ලැයිස්තුවක් සහිත ඇමුණුම හෝ VirusTotal වෙත සබැඳිය මෙහි ද තැබිය හැකිය.

source: Information about how the malware is delivered
si_lk: අනිෂ්ට මෘදුකාංග බෙදා හරින ආකාරය පිළිබඳ තොරතුරු

source: Information about the way the malware payload is initially delivered, for example information about the email or web-site, vulnerability used, originating IP etc. Malware sample itself should be attached here.
si_lk: අනිෂ්ට මෘදුකාංග ගෙවීම ආරම්භ කරන ආකාරය පිළිබඳ තොරතුරු, උදාහරණයක් ලෙස විද්‍යුත් තැපෑල හෝ වෙබ් අඩවිය පිළිබඳ තොරතුරු, භාවිතා කළ අවදානම, IP ආරම්භය යනාදිය. අනිෂ්ට මෘදුකාංග නියැදිය මෙහි අමුණා තිබිය යුතුය.

source: Any artifact (files, registry keys etc.) dropped by the malware or other modifications to the system
si_lk: අනිෂ්ට මෘදුකාංග හෝ පද්ධතියට වෙනත් වෙනස් කිරීම් මගින් අතහැර දැමූ ඕනෑම කෞතුක වස්තුවක් (ගොනු, රෙජිස්ට්‍රි යතුරු ආදිය)

source: Info on where the malware gets installed in the system
si_lk: පද්ධතිය තුළ අනිෂ්ට මෘදුකාංග ස්ථාපනය කරන ස්ථානය පිළිබඳ තොරතුරු

source: Location where the payload was placed in the system and the way it was installed. For example, a filename|md5 type attribute can be added here like this: c:\windows\system32\malicious.exe|41d8cd98f00b204e9800998ecf8427e.
si_lk: පද්ධතිය තුළ ගෙවීම් පැටවූ ස්ථානය සහ එය ස්ථාපනය කර ඇති ආකාරය. උදාහරණයක් ලෙස, ගොනු නාමයක්|md5 වර්ගයේ ගුණාංගයක් මෙහි එකතු කළ හැක: c:\windows\system32\malicious.exe|41d8cd98f00b204e9800998ecf8427e.

source: Mechanisms used by the malware to start at boot
si_lk: ආරම්භයේදී ආරම්භ කිරීමට අනිෂ්ට මෘදුකාංග භාවිතා කරන යාන්ත්‍රණ

source: Mechanisms used by the malware to start at boot. This could be a registry key, legitimate driver modification, LNK file in startup
si_lk: ආරම්භයේදී ආරම්භ කිරීමට අනිෂ්ට මෘදුකාංග භාවිතා කරන යාන්ත්‍රණ. මෙය රෙජිස්ට්‍රි යතුරක්, නීත්‍යානුකූල ධාවක වෙනස් කිරීමක්, LNK ගොනුවක් ආරම්භයේදී විය හැක

source: Information about network traffic generated by the malware
si_lk: අනිෂ්ට මෘදුකාංග මගින් ජනනය කරන ජාල ගමනාගමනය පිළිබඳ තොරතුරු

source: Information about the final payload(s)
si_lk: අවසාන ගෙවීම (ය) පිළිබඳ තොරතුරු

source: Information about the final payload(s). Can contain a function of the payload, e.g. keylogger, RAT, or a name if identified, such as Poison Ivy.
si_lk: අවසාන ගෙවීම (ය) පිළිබඳ තොරතුරු. ගෙවීමේ කාර්යයක් අඩංගු විය හැක, උදා keylogger, RAT, හෝ Poison Ivy වැනි හඳුනා ගතහොත් නමක්.

source: Identification of the group, organisation, or country behind the attack
si_lk: ප්‍රහාරය පිටුපස සිටින කණ්ඩායම, සංවිධානය හෝ රට හඳුනා ගැනීම

source: Any other result from additional analysis of the malware like tools output
si_lk: මෙවලම් ප්‍රතිදානය වැනි අනිෂ්ට මෘදුකාංගවල අමතර විශ්ලේෂණයකින් වෙනත් ඕනෑම ප්‍රතිඵලයක්

source: Any other result from additional analysis of the malware like tools output Examples: pdf-parser output, automated sandbox analysis, reverse engineering report.
si_lk: මෙවලම් ප්‍රතිදානය වැනි අනිෂ්ට මෘදුකාංගයේ අමතර විශ්ලේෂණයකින් වෙනත් ඕනෑම ප්‍රතිඵලයක් උදාහරණ: pdf-parser output, automated sandbox analysis, reverse engineer report.

source: Financial Fraud indicators
si_lk: මූල්ය වංචා දර්ශක

source: Financial Fraud indicators, for example: IBAN Numbers, BIC codes, Credit card numbers, etc.
si_lk: මූල්‍ය වංචා දර්ශක, උදාහරණයක් ලෙස: IBAN අංක, BIC කේත, ක්‍රෙඩිට් කාඩ් අංක, ආදිය.

source: Tools supporting analysis or detection of the event
si_lk: සිද්ධිය විශ්ලේෂණය කිරීමට හෝ හඳුනා ගැනීමට සහාය වන මෙවලම්

source: Social networks and platforms
si_lk: සමාජ ජාල සහ වේදිකා

source: A human being - natural person
si_lk: මිනිසෙක් - ස්වභාවික පුද්ගලයෙක්

source: Attributes that are not part of any other category or are meant to be used as a component in MISP objects in the future
si_lk: වෙනත් කිසිදු කාණ්ඩයක කොටසක් නොවන හෝ අනාගතයේදී MISP වස්තු වල සංරචකයක් ලෙස භාවිතා කිරීමට අදහස් කරන ගුණාංග

source: A checksum in md5 format
si_lk: md5 ආකෘතියෙන් චෙක්සම් එකක්

source: You are encouraged to use filename|md5 instead. A checksum in md5 format, only use this if you don't know the correct filename
si_lk: ඒ වෙනුවට ගොනු නාමය|md5 භාවිතා කිරීමට ඔබව දිරිමත් කරනු ලැබේ. md5 ආකෘතියෙන් චෙක්සම් එකක්, ඔබ නිවැරදි ගොනු නාමය නොදන්නේ නම් පමණක් මෙය භාවිතා කරන්න

source: A checksum in sha1 format
si_lk: sha1 ආකෘතියෙන් චෙක්සම් එකක්

source: You are encouraged to use filename|sha1 instead. A checksum in sha1 format, only use this if you don't know the correct filename
si_lk: ඒ වෙනුවට ගොනු නාමය|sha1 භාවිතා කිරීමට ඔබව දිරිමත් කරනු ලැබේ. sha1 ආකෘතියෙන් චෙක්සම් එකක්, ඔබ නිවැරදි ගොනු නාමය නොදන්නේ නම් පමණක් මෙය භාවිතා කරන්න

source: A checksum in sha256 format
si_lk: sha256 ආකෘතියෙන් චෙක්සම් එකක්

source: You are encouraged to use filename|sha256 instead. A checksum in sha256 format, only use this if you don't know the correct filename
si_lk: ඒ වෙනුවට ගොනු නාමය|sha256 භාවිතා කිරීමට ඔබව දිරිමත් කරනු ලැබේ. sha256 ආකෘතියෙන් චෙක්සම් එකක්, ඔබ නිවැරදි ගොනු නාමය නොදන්නේ නම් පමණක් මෙය භාවිතා කරන්න

source: Filename
si_lk: ගොනුවේ නම

source: Microsoft Program database (PDB) path information
si_lk: Microsoft Program දත්ත සමුදාය (PDB) මාර්ග තොරතුරු

source: A filename and an md5 hash separated by a |
si_lk: ගොනු නාමයක් සහ md5 හෑෂ් එකක් |

source: A filename and an md5 hash separated by a | (no spaces)
si_lk: ගොනු නාමයක් සහ md5 හෑෂ් එකක් | (හිඩැස් නැති)

source: A filename and an sha1 hash separated by a |
si_lk: ගොනු නාමයක් සහ sha1 හෑෂ් එකක් |

source: A filename and an sha1 hash separated by a | (no spaces)
si_lk: ගොනු නාමයක් සහ sha1 හෑෂ් එකක් | (හිඩැස් නැති)

source: A filename and an sha256 hash separated by a |
si_lk: ගොනු නාමයක් සහ sha256 හෑෂ් එකක් |

source: A filename and an sha256 hash separated by a | (no spaces)
si_lk: ගොනු නාමයක් සහ sha256 හෑෂ් එකක් | (හිඩැස් නැති)

source: A source IP address of the attacker
si_lk: ප්‍රහාරකයාගේ මූලාශ්‍ර IP ලිපිනය

source: A destination IP address of the attacker or C&C server
si_lk: ප්‍රහාරකයාගේ ගමනාන්ත IP ලිපිනයක් හෝ C&C සේවාදායකය

source: A destination IP address of the attacker or C&C server. Also set the IDS flag on when this IP is hardcoded in malware
si_lk: ප්‍රහාරකයාගේ ගමනාන්ත IP ලිපිනයක් හෝ C&C සේවාදායකය. අනිෂ්ට මෘදුකාංග වල මෙම IP දෘඪ කේතය කර ඇති විට IDS ධජය ද සකසන්න

source: A full host/dnsname of an attacker
si_lk: ප්‍රහාරකයෙකුගේ සම්පූර්ණ සත්කාරක/ඩීඑන්එස් නමක්

source: A full host/dnsname of an attacker. Also set the IDS flag on when this hostname is hardcoded in malware
si_lk: ප්‍රහාරකයෙකුගේ සම්පූර්ණ සත්කාරක/ඩීඑන්එස් නමක්. අනිෂ්ට මෘදුකාංග තුළ මෙම ධාරක නාමය දෘඪ කේත කර ඇති විට IDS ධජය ද සකසන්න

source: A domain name used in the malware
si_lk: අනිෂ්ට මෘදුකාංගයේ භාවිතා කරන ඩොමේන් නාමයක්

source: A domain name used in the malware. Use this instead of hostname when the upper domain is important or can be used to create links between events.
si_lk: අනිෂ්ට මෘදුකාංගයේ භාවිතා කරන ඩොමේන් නාමයක්. ඉහළ වසම වැදගත් වන විට හෝ සිදුවීම් අතර සබැඳි සෑදීමට භාවිතා කළ හැකි විට ධාරක නාමය වෙනුවට මෙය භාවිතා කරන්න.

source: A domain name and its IP address (as found in DNS lookup) separated by a |
si_lk: වසම් නාමයක් සහ එහි IP ලිපිනය (DNS සෙවීමේදී සොයාගත් පරිදි) | මගින් වෙන් කර ඇත

source: A domain name and its IP address (as found in DNS lookup) separated by a | (no spaces)
si_lk: වසම් නාමයක් සහ එහි IP ලිපිනය (DNS සෙවීමේදී සොයාගත් පරිදි) | මගින් වෙන් කර ඇත (හිඩැස් නැති)

source: The source email address. Used to describe the sender when describing an e-mail.
si_lk: මූලාශ්ර ඊමේල් ලිපිනය. විද්‍යුත් තැපෑලක් විස්තර කිරීමේදී යවන්නා විස්තර කිරීමට භාවිතා කරයි.

source: eduPersonPrincipalName - eppn - the NetId of the person for the purposes of inter-institutional authentication. Should be stored in the form of user@univ.edu, where univ.edu is the name of the local security domain.
si_lk: eduPersonPrincipalName - eppn - අන්තර් ආයතනික සත්‍යාපනයේ අරමුණු සඳහා පුද්ගලයාගේ NetId. univ.edu යනු දේශීය ආරක්ෂක වසමේ නම වන user@univ.edu ආකාරයෙන් ගබඩා කළ යුතුය.

source: The destination email address. Used to describe the recipient when describing an e-mail.
si_lk: ගමනාන්ත ඊමේල් ලිපිනය. විද්‍යුත් තැපෑලක් විස්තර කිරීමේදී ලබන්නා විස්තර කිරීමට භාවිතා කරයි.

source: The subject of the email
si_lk: විද්‍යුත් තැපෑලේ විෂය

source: File name of the email attachment.
si_lk: ඊමේල් ඇමුණුමේ ගොනු නාමය.

source: Email body
si_lk: ඊමේල් ශරීරය

source: A floating point value.
si_lk: පාවෙන ලක්ෂ්‍ය අගයක්.

source: A git commit ID.
si_lk: git කැපවීමේ හැඳුනුම්පතක්.

source: HTTP method used by the malware (e.g. POST, GET, ...).
si_lk: අනිෂ්ට මෘදුකාංග භාවිතා කරන HTTP ක්‍රමය (උදා. POST, GET, ...).

source: The user-agent used by the malware in the HTTP request.
si_lk: HTTP ඉල්ලීමෙහි අනිෂ්ට මෘදුකාංග භාවිතා කරන පරිශීලක නියෝජිතයා.

source: JA3 is a method for creating SSL/TLS client fingerprints that should be easy to produce on any platform and can be easily shared for threat intelligence.
si_lk: JA3 යනු SSL/TLS සේවාදායක ඇඟිලි සලකුණු නිර්මාණය කිරීමේ ක්‍රමයකි, එය ඕනෑම වේදිකාවක නිෂ්පාදනය කිරීමට පහසු විය යුතු අතර තර්ජන බුද්ධිය සඳහා පහසුවෙන් බෙදාගත හැක.

source: JARM is a method for creating SSL/TLS server fingerprints.
si_lk: JARM යනු SSL/TLS සේවාදායක ඇඟිලි සලකුණු නිර්මාණය කිරීමේ ක්‍රමයකි.

source: favicon-mmh3 is the murmur3 hash of a favicon as used in Shodan.
si_lk: favicon-mmh3 යනු Shodan හි භාවිතා වන පරිදි favicon එකක murmur3 හැෂ් වේ.

source: hassh is a network fingerprinting standard which can be used to identify specific Client SSH implementations. The fingerprints can be easily stored, searched and shared in the form of an MD5 fingerprint.
si_lk: hassh යනු විශේෂිත සේවාලාභී SSH ක්‍රියාත්මක කිරීම් හඳුනා ගැනීමට භාවිතා කළ හැකි ජාල ඇඟිලි සලකුණු ප්‍රමිතියකි. MD5 ඇඟිලි සලකුණක් ආකාරයෙන් ඇඟිලි සලකුණු පහසුවෙන් ගබඩා කිරීමට, සෙවීමට සහ බෙදා ගැනීමට හැකිය.

source: hasshServer is a network fingerprinting standard which can be used to identify specific Server SSH implementations. The fingerprints can be easily stored, searched and shared in the form of an MD5 fingerprint.
si_lk: hasshServer යනු විශේෂිත සේවාදායක SSH ක්‍රියාත්මක කිරීම් හඳුනා ගැනීමට භාවිතා කළ හැකි ජාල ඇඟිලි සලකුණු ප්‍රමිතියකි. MD5 ඇඟිලි සලකුණක් ආකාරයෙන් ඇඟිලි සලකුණු පහසුවෙන් ගබඩා කිරීමට, සෙවීමට සහ බෙදා ගැනීමට හැකිය.

source: Registry key or value
si_lk: රෙජිස්ට්රි යතුර හෝ අගය

source: Registry value + data separated by |
si_lk: රෙජිස්ට්‍රි අගය + දත්ත වෙන් කරන ලද්දේ |

source: Autonomous system
si_lk: ස්වාධීන පද්ධතිය

source: An IDS rule in Snort rule-format
si_lk: Snort රීති ආකෘතියෙන් IDS රීතියක්

source: An IDS rule in Snort rule-format. This rule will be automatically rewritten in the NIDS exports.
si_lk: Snort රීති ආකෘතියෙන් IDS රීතියක්. මෙම රීතිය NIDS අපනයනය තුළ ස්වයංක්‍රීයව නැවත ලියනු ලැබේ.

source: An NIDS rule in the Bro rule-format
si_lk: Bro රීති ආකෘතියේ NIDS රීතියක්

source: An NIDS rule in the Bro rule-format.
si_lk: Bro රීති ආකෘතියේ NIDS රීතියක්.

source: An NIDS rule in the Zeek rule-format
si_lk: Zeek රීති ආකෘතියේ NIDS රීතියක්

source: An NIDS rule in the Zeek rule-format.
si_lk: Zeek රීති ආකෘතියේ NIDS රීතියක්.

source: a community ID flow hashing algorithm to map multiple traffic monitors into common flow id
si_lk: බහු රථවාහන නිරීක්ෂකයන් පොදු ප්‍රවාහ හැඳුනුම්පතට සිතියම්ගත කිරීම සඳහා ප්‍රජා හැඳුනුම්පත් ප්‍රවාහ හැෂිං ඇල්ගොරිතමයක්

source: Pattern in file that identifies the malware
si_lk: අනිෂ්ට මෘදුකාංග හඳුනා ගන්නා ගොනුවේ රටාව

source: Pattern in network traffic that identifies the malware
si_lk: අනිෂ්ට මෘදුකාංග හඳුනා ගන්නා ජාල තදබදයේ රටාව

source: Pattern in memory dump that identifies the malware
si_lk: අනිෂ්ට මෘදුකාංග හඳුනා ගන්නා මතක ඩම්ප් තුළ ඇති රටාව

source: A pattern in the name of a file
si_lk: ගොනුවක නාමයෙන් රටාවක්

source: A PGP public key
si_lk: PGP පොදු යතුරක්

source: A PGP private key
si_lk: PGP පුද්ගලික යතුරක්

source: A fingerprint of SSH key material
si_lk: SSH යතුරු ද්‍රව්‍යයේ ඇඟිලි සලකුණක්

source: Yara signature
si_lk: යාරා අත්සන

source: STIX 2 pattern
si_lk: STIX 2 රටාව

source: Sigma - Generic Signature Format for SIEM Systems
si_lk: සිග්මා - SIEM පද්ධති සඳහා සාමාන්‍ය අත්සන ආකෘතිය

source: GENE - Go Evtx sigNature Engine
si_lk: GENE - Go Evtx සිග්නේචර් එන්ජිම

source: Kusto query - Kusto from Microsoft Azure is a service for storing and running interactive analytics over Big Data.
si_lk: Kusto විමසුම - Microsoft Azure වෙතින් Kusto යනු Big Data හරහා අන්තර්ක්‍රියාකාරී විශ්ලේෂණ ගබඩා කිරීම සහ ධාවනය කිරීම සඳහා වූ සේවාවකි.

source: A media type (also MIME type and content type) is a two-part identifier for file formats and format contents transmitted on the Internet
si_lk: මාධ්‍ය වර්ගයක් (MIME වර්ගය සහ අන්තර්ගත වර්ගයද) යනු අන්තර්ජාලය හරහා සම්ප්‍රේෂණය වන ගොනු ආකෘති සහ ආකෘති අන්තර්ගතයන් සඳහා කොටස් දෙකක හඳුනාගැනීමකි.

source: Identity card number
si_lk: හැඳුනුම්පත් අංකය

source: HTTP cookie as often stored on the user web client. This can include authentication cookie or session cookie.
si_lk: HTTP කුකී බොහෝ විට පරිශීලක වෙබ් සේවාදායකයා මත ගබඩා කර ඇත. මෙයට සත්‍යාපන කුකී හෝ සැසි කුකී ඇතුළත් විය හැක.

source: A reference to the vulnerability used in the exploit
si_lk: සූරාකෑමේදී භාවිතා වන අවදානමට සඳහනක්

source: Common Platform Enumeration - structured naming scheme for information technology systems, software, and packages.
si_lk: පොදු වේදිකා ගණනය කිරීම - තොරතුරු තාක්ෂණ පද්ධති, මෘදුකාංග සහ පැකේජ සඳහා ව්‍යුහගත නම් කිරීමේ යෝජනා ක්‍රමය.

source: A reference to the weakness used in the exploit
si_lk: සූරාකෑමේදී භාවිතා කරන දුර්වලතාවයට සඳහනක්

source: Attachment with external information
si_lk: බාහිර තොරතුරු සමඟ ඇමුණුම

source: Please upload files using the <em>Upload Attachment</em> button.
si_lk: කරුණාකර <em>උඩුගත ඇමුණුම්</em> බොත්තම භාවිතයෙන් ගොනු උඩුගත කරන්න.

source: Attachment containing encrypted malware sample
si_lk: සංකේතාත්මක අනිෂ්ට මෘදුකාංග සාම්පල අඩංගු ඇමුණුම

source: Link to an external information
si_lk: බාහිර තොරතුරු වෙත සබැඳිය

source: Comment or description in a human language
si_lk: මානව භාෂාවකින් අදහස් දැක්වීම හෝ විස්තරය

source: Comment or description in a human language. This will not be correlated with other attributes
si_lk: මානව භාෂාවකින් අදහස් දැක්වීම හෝ විස්තරය. මෙය වෙනත් ගුණාංග සමඟ සහසම්බන්ධ නොවනු ඇත

source: Name, ID or a reference
si_lk: නම, හැඳුනුම්පත හෝ යොමුවක්

source: A value in hexadecimal format
si_lk: ෂඩාස්රාකාර ආකෘතියේ අගයක්

source: Other attribute
si_lk: වෙනත් ගුණාංගය

source: Named pipe, use the format \.\pipe\<PipeName>
si_lk: නල ලෙස නම් කර ඇත, \.\pipe\<PipeName>ආකෘතිය භාවිතා කරන්න

source: Mutex, use the format \BaseNamedObjects\<Mutex>
si_lk: Mutex, \BaseNamedObjects\<Mutex>ආකෘතිය භාවිතා කරන්න

source: State of a process
si_lk: ක්‍රියාවලියක තත්වය

source: Attack Targets Username(s)
si_lk: ප්‍රහාර ඉලක්ක පරිශීලක නාමය(ය)

source: Attack Targets Email(s)
si_lk: ප්‍රහාර ඉලක්ක ඊමේල්(ය)

source: Attack Targets Machine Name(s)
si_lk: ප්‍රහාර ඉලක්ක යන්ත්‍ර නාමය(ය)

source: Attack Targets Department or Organization(s)
si_lk: ප්‍රහාර ඉලක්ක දෙපාර්තමේන්තුව හෝ සංවිධානය(ය)

source: Attack Targets Physical Location(s)
si_lk: ප්‍රහාර ඉලක්ක භෞතික පිහිටීම(ය)

source: External Target Organizations Affected by this Attack
si_lk: මෙම ප්‍රහාරයෙන් බලපෑමට ලක් වූ බාහිර ඉලක්ක සංවිධාන

source: Bitcoin Address
si_lk: Bitcoin ලිපිනය

source: Dash Address
si_lk: ඩෑෂ් ලිපිනය

source: Monero Address
si_lk: Monero ලිපිනය

source: International Bank Account Number
si_lk: ජාත්‍යන්තර බැංකු ගිණුම් අංකය

source: Bank Identifier Code Number also known as SWIFT-BIC, SWIFT code or ISO 9362 code
si_lk: බැංකු හඳුනාගැනීමේ කේතය SWIFT-BIC, SWIFT කේතය හෝ ISO 9362 කේතය ලෙසද හැඳින්වේ

source: Bank account number without any routing number
si_lk: මාර්ග අංකයක් නොමැති බැංකු ගිණුම් අංකය

source: ABA routing transit number
si_lk: ABA මාර්ගගත සංක්‍රමණ අංකය

source: Bank Identification Number
si_lk: බැංකු හඳුනාගැනීමේ අංකය

source: Credit-Card Number
si_lk: ණය පත් අංකය

source: Premium-Rate Telephone Number
si_lk: වාරික ගාස්තු දුරකථන අංකය

source: Telephone Number
si_lk: දුරකථන අංකය

source: A string identifying the threat actor
si_lk: තර්ජනාත්මක නළුවා හඳුනා ගන්නා තන්තුවක්

source: Associated campaign name
si_lk: සම්බන්ධිත ව්‍යාපාරයේ නම

source: Associated campaign ID
si_lk: ආශ්‍රිත ප්‍රචාරක හැඳුනුම්පත

source: Uniform Resource Identifier
si_lk: ඒකාකාර සම්පත් හඳුනාගැනීම

source: Authenticode executable signature hash
si_lk: සත්‍යාපන කේතය ක්‍රියාත්මක කළ හැකි අත්සන හැෂ්

source: You are encouraged to use filename|authentihash instead. Authenticode executable signature hash, only use this if you don't know the correct filename
si_lk: ඒ වෙනුවට ගොනු නාමය|authentihash භාවිතා කිරීමට ඔබව දිරිමත් කරනු ලැබේ. සත්‍යාපන කේතය ක්‍රියාත්මක කළ හැකි අත්සන හැෂ්, ඔබ නිවැරදි ගොනු නාමය නොදන්නේ නම් පමණක් මෙය භාවිතා කරන්න

source: A VirusTotal checksum
si_lk: VirusTotal චෙක්සම් එකක්

source: You are encouraged to use filename|vhash instead. A checksum from VirusTotal, only use this if you don't know the correct filename
si_lk: ඒ වෙනුවට ගොනු නාමය|vhash භාවිතා කිරීමට ඔබව දිරිමත් කරනු ලැබේ. VirusTotal වෙතින් චෙක්සම් එකක්, ඔබ නිවැරදි ගොනු නාමය නොදන්නේ නම් පමණක් මෙය භාවිතා කරන්න

source: A checksum in ssdeep format
si_lk: ssdeep ආකෘතියෙන් චෙක්සම් එකක්

source: You are encouraged to use filename|ssdeep instead. A checksum in the SSDeep format, only use this if you don't know the correct filename
si_lk: ඒ වෙනුවට ගොනු නාමය|ssdeep භාවිතා කිරීමට ඔබව දිරිමත් කරනු ලැබේ. SSDeep ආකෘතියේ චෙක්සම් එකක්, ඔබ නිවැරදි ගොනු නාමය නොදන්නේ නම් පමණක් මෙය භාවිතා කරන්න

source: Import hash - a hash created based on the imports in the sample.
si_lk: ආයාත හැෂ් - නියැදියේ ආයාත මත පදනම්ව සාදන ලද හැෂ්.

source: You are encouraged to use filename|imphash instead. A hash created based on the imports in the sample, only use this if you don't know the correct filename
si_lk: ඒ වෙනුවට filename|imphash භාවිතා කිරීමට ඔබව දිරිමත් කරනු ලැබේ. නියැදියේ ඇති ආයාත මත පදනම්ව සාදන ලද හැෂ් එකක්, ඔබ නිවැරදි ගොනු නාමය නොදන්නේ නම් පමණක් මෙය භාවිතා කරන්න

source: telfhash is symbol hash for ELF files, just like imphash is imports hash for PE files.
si_lk: telfhash යනු ELF ගොනු සඳහා සංකේත හැෂ් වේ, හරියට imphash යනු PE ගොනු සඳහා හැෂ් ආනයනය කරයි.

source: You are encouraged to use a file object with telfash
si_lk: ටෙල්ෆාෂ් සමඟ ගොනු වස්තුවක් භාවිතා කිරීමට ඔබව දිරිමත් කරනු ලැබේ
