Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: In some rare cases attributes can remain in the database after an event is deleted becoming orphaned attributes. This means that they do not belong to any event, which can cause issues with the correlation engine (known cases include event deletion directly in the database without cleaning up the attributes and situations involving a race condition with an event deletion happening before all attributes are synchronised over).
si_lk: සමහර දුර්ලභ අවස්ථාවන්හිදී, සිදුවීමක් මකාදැමීමෙන් පසුව අනාථ ගුණාංග බවට පත් වීමෙන් පසුව උපලක්ෂණ දත්ත ගබඩාවේ පැවතිය හැක. මෙයින් අදහස් කරන්නේ ඔවුන් සහසම්බන්ධතා එන්ජිම සමඟ ගැටළු ඇති කළ හැකි කිසිදු සිදුවීමකට අයත් නොවන බවයි (දන්නා අවස්ථා වලට දත්ත සමුදාය තුළ සෘජුවම සිදුවීම් මකාදැමීම ඇතුළත් වේ. ඉවරයි).

source: Run the test below
si_lk: පහත පරීක්ෂණය ධාවනය කරන්න

source: Check for orphaned attribute
si_lk: අනාථ ගුණාංග සඳහා පරීක්ෂා කරන්න

source: Check for orphaned attributes
si_lk: අනාථ ගුණාංග සඳහා පරීක්ෂා කරන්න

source: Remove orphaned attributes
si_lk: අනාථ වූ ගුණාංග ඉවත් කරන්න

source: Remove orphaned correlations
si_lk: අනාථ සහසම්බන්ධතා ඉවත් කරන්න

source: Remove published empty events
si_lk: ප්‍රකාශිත හිස් සිදුවීම් ඉවත් කරන්න

source: Administrator On-demand Action
si_lk: පරිපාලක ඉල්ලීම මත ක්‍රියාව

source: Click the following button to go to the Administrator On-demand Action page.
si_lk: Administrator On-demand Action පිටුවට යාමට පහත බොත්තම ක්ලික් කරන්න.

source: Legacy Administrative Tools
si_lk: ලෙගසි පරිපාලන මෙවලම්

source: Click the following button to go to the legacy administrative tools page. There should in general be no need to do this unless you are upgrading a very old MISP instance (<2.4), all updates are done automatically with more current versions.
si_lk: ලෙගසි පරිපාලන මෙවලම් පිටුවට යාමට පහත බොත්තම ක්ලික් කරන්න. ඔබ ඉතා පැරණි MISP අවස්ථාවක් (<2.4) උත්ශ්‍රේණිගත කරන්නේ නම් මිස සාමාන්‍යයෙන් මෙය කිරීමට අවශ්‍ය නොවිය යුතුය, සියලුම යාවත්කාලීන කිරීම් වඩාත් වත්මන් අනුවාද සමඟ ස්වයංක්‍රීයව සිදු වේ.

source: Verify bad link on attachments
si_lk: ඇමුණුම් මත නරක සබැඳිය තහවුරු කරන්න

source: Verify each attachment referenced in database is accessible on filesystem.
si_lk: දත්ත සමුදායේ සඳහන් සෑම ඇමුණුමක්ම ගොනු පද්ධතියට ප්‍රවේශ විය හැකිදැයි තහවුරු කරන්න.

source: Non existing attachments referenced in Database
si_lk: දත්ත ගබඩාවේ සඳහන් කර ඇති නොපවතින ඇමුණුම්

source: Check bad link on attachments
si_lk: ඇමුණුම් මත නරක සබැඳිය පරීක්ෂා කරන්න

source: Recover deleted events
si_lk: මකා දැමූ සිදුවීම් නැවත ලබා ගන්න

source: Due to a bug introduced after 2.4.129, users could occasionally accidentally and unknowingly trigger event deletions. Use the tool below to display any events deleted during the timeframe when the bug was active and optionally recover individual events if you believe they were removed in error.
si_lk: 2.4.129 ට පසුව හඳුන්වා දුන් දෝෂයක් හේතුවෙන්, පරිශීලකයින්ට ඉඳහිට අහම්බෙන් සහ නොදැනුවත්ව සිදුවීම් මකාදැමීම් අවුලුවාලිය හැකිය. දෝෂය සක්‍රිය වූ කාලරාමුව තුළ මකා දැමූ සිදුවීම් සංදර්ශන කිරීමට පහත මෙවලම භාවිතා කරන්න සහ ඒවා දෝෂයකින් ඉවත් කර ඇති බව ඔබ විශ්වාස කරන්නේ නම් විකල්ප වශයෙන් තනි සිදුවීම් ප්‍රතිසාධනය කරන්න.

source: Below you will find a list of the uploaded files based on type.
si_lk: පහතින් ඔබට වර්ගය මත පදනම්ව උඩුගත කළ ගොනු ලැයිස්තුවක් සොයාගත හැකිය.

source: Expected Format
si_lk: අපේක්ෂිත ආකෘතිය

source: Path
si_lk: මාර්ගය

source: Files set for each relevant setting
si_lk: එක් එක් අදාළ සැකසුම් සඳහා ගොනු සකසා ඇත

source: Used by
si_lk: විසින් භාවිතා කරන ලදී

source: Size
si_lk: ප්රමාණය

source: Permissions
si_lk: අවසර

source: Are you sure you want to delete %s?
si_lk: ඔබට %sමැකීමට අවශ්‍ය බව විශ්වාසද?

source: Critical, your MISP instance requires immediate attention.
si_lk: විවේචනාත්මක, ඔබේ MISP අවස්ථාවට ක්ෂණික අවධානයක් අවශ්‍ය වේ.

source: Issues found, it is recommended that you resolve them.
si_lk: ගැටළු සොයාගෙන ඇත, ඔබ ඒවා විසඳීමට නිර්දේශ කරනු ලැබේ.

source: Good, but there are some optional settings that are incorrect / not set.
si_lk: හොඳයි, නමුත් වැරදි / සකසා නැති විකල්ප සැකසුම් කිහිපයක් තිබේ.

source: In perfect health.
si_lk: පරිපූර්ණ සෞඛ්‍ය තත්වයෙන්.

source: Test
si_lk: පරීක්ෂණය

source: Overall health
si_lk: සමස්ත සෞඛ්යය

source: The overall health of your instance depends on the most severe unresolved issues.
si_lk: ඔබගේ නිදසුනෙහි සමස්ත සෞඛ්‍යය රඳා පවතින්නේ වඩාත්ම බරපතල නොවිසඳුනු ගැටළු මත ය.

source: settings incorrectly or not set
si_lk: සැකසුම් වැරදි ලෙස හෝ සකසා නැත

source: %s incorrect settings.
si_lk: %s වැරදි සැකසුම්.

source: Critical issues revealed by the diagnostics
si_lk: රෝග විනිශ්චය මගින් හෙළිදරව් කරන ලද විවේචනාත්මක ගැටළු

source: %s issues detected.
si_lk: ගැටළු %s ක් අනාවරණය විය.

source: Issues revealed here can be due to incorrect directory permissions or not correctly installed dependencies.
si_lk: මෙහි හෙළිදරව් වන ගැටළු වැරදි නාමාවලි අවසර හෝ නිවැරදිව ස්ථාපනය කර නොමැති පරායත්තතා නිසා විය හැක.

source: CLI only
si_lk: CLI පමණි

source: Priority
si_lk: ප්රමුඛත්වය

source: Setting
si_lk: සැකසීම

source: Error Message
si_lk: දෝෂ පණිවිඩය

source: Overview
si_lk: දළ විශ්ලේෂණය

source: %s settings%s
si_lk: %s සිටුවම්%s

source: This tab reports some potential critical misconfigurations.
si_lk: මෙම ටැබය සමහර විභව තීරණාත්මක වැරදි වින්‍යාස කිරීම් වාර්තා කරයි.

source: Manage files
si_lk: ගොනු කළමනාකරණය කරන්න

source: Workers
si_lk: කම්කරුවෝ

source: Download report
si_lk: වාර්තාව බාගත කරන්න

source: Filter the table(s) below
si_lk: පහත වගුව(ය) පෙරහන් කරන්න

source: MISP cannot access your /proc directory to check the status of the worker processes, which means that dead workers will not be detected by the diagnostic tool. If you would like to regain this functionality, make sure that the open_basedir directive is not set, or that /proc is included in it.
si_lk: සේවක ක්‍රියාවලීන්ගේ තත්ත්වය පරීක්ෂා කිරීමට MISP හට ඔබගේ /proc නාමාවලියට ප්‍රවේශ විය නොහැක, එයින් අදහස් වන්නේ රෝග විනිශ්චය කිරීමේ මෙවලම මගින් මියගිය සේවකයින් හඳුනා නොගන්නා බවයි. ඔබට මෙම ක්‍රියාකාරීත්වය නැවත ලබා ගැනීමට අවශ්‍ය නම්, open_basedir විධානය සකසා නොමැති බවට හෝ /proc එහි ඇතුළත් කර ඇති බවට වග බලා ගන්න.

source: MISP cannot connect to the Supervisord API, check the following settings are correct: [`supervisor_host`, `supervisor_port`, `supervisor_user`, `supervisor_password`] and restart the service. For details check the MISP error logs.
si_lk: MISP හට Supervisord API වෙත සම්බන්ධ විය නොහැක, පහත සැකසීම් නිවැරදිදැයි පරීක්ෂා කරන්න: [`supervisor_host`, `supervisor_port`, `supervisor_user`, `supervisor_password`] සහ සේවාව නැවත ආරම්භ කරන්න. විස්තර සඳහා MISP දෝෂ ලඝු පරීක්ෂා කරන්න.

source: Note:
si_lk: සටහන:

source: You have set the "manage_workers" variable to "false", therefore worker controls have been disabled.
si_lk: ඔබ "manage_workers" විචල්‍යය "false" ලෙස සකසා ඇත, එබැවින් සේවක පාලන අක්‍රිය කර ඇත.

source: Issues prevent jobs from being processed. Please resolve them below.
si_lk: ගැටළු රැකියා සැකසීමෙන් වළක්වයි. කරුණාකර ඒවා පහතින් විසඳන්න.

source: Worker started with the correct user, but the current status is unknown.
si_lk: සේවකයා නිවැරදි පරිශීලකයා සමඟ ආරම්භ කළ නමුත් වත්මන් තත්ත්වය නොදනී.

source: There are issues with the worker(s), but at least one healthy worker is monitoring the queue.
si_lk: සේවකයා(න්) සමඟ ගැටලු ඇත, නමුත් අවම වශයෙන් එක් සෞඛ්‍ය සම්පන්න සේවකයෙක් පෝලිම නිරීක්ෂණය කරයි.

source: Worker type:
si_lk: සේවක වර්ගය:

source: Jobs in the queue:
si_lk: පෝලිමේ රැකියා:

source: Queue status:
si_lk: පෝලිම් තත්ත්වය:

source: Worker PID
si_lk: සේවක PID

source: Worker process
si_lk: සේවක ක්රියාවලිය

source: Information
si_lk: විස්තර

source: Worker not running!
si_lk: සේවකයා දුවන්නේ නැත!

source: The worker appears to be healthy.
si_lk: සේවකයා නිරෝගී බව පෙනේ.

source: The worker was started with a user other than the apache user. MISP cannot check whether the worker is alive or not.
si_lk: සේවකයා apache පරිශීලකයා හැර වෙනත් පරිශීලකයෙකු සමඟ ආරම්භ කරන ලදී. සේවකයා ජීවතුන් අතරද නැද්ද යන්න MISP හට පරීක්ෂා කළ නොහැක.

source: Cannot check whether the worker is alive or dead.
si_lk: සේවකයා ජීවතුන් අතරද මැරුණාද යන්න පරීක්ෂා කළ නොහැක.

source: Dead
si_lk: මරු

source: The Worker appears to be dead.
si_lk: සේවකයා මිය ගොස් ඇති බව පෙනේ.

source: Stop (if still running) and remove this worker. This will immediately terminate any jobs that are being executed by it.
si_lk: නවත්වන්න (තවමත් ධාවනය නම්) සහ මෙම සේවකයා ඉවත් කරන්න. මෙය ක්‍රියාත්මක කරන ඕනෑම රැකියාවක් වහාම අවසන් කරනු ඇත.

source: Start a worker
si_lk: සේවකයෙකු ආරම්භ කරන්න

source: Restart dead workers
si_lk: මිය ගිය කම්කරුවන් නැවත ආරම්භ කරන්න

source: Kill all workers
si_lk: සියලුම කම්කරුවන් මරා දමන්න

source: Force kill all workers
si_lk: සියලුම කම්කරුවන් බලෙන් මරා දමන්න

source: Are you sure you want to force kill all workers? This will issue a kill -9 and terminate any processing underway.
si_lk: ඔබට සියලු කම්කරුවන් මරා දැමීමට අවශ්‍ය බව විශ්වාසද? මෙය කිල් -9 නිකුත් කරනු ලබන අතර සිදුවෙමින් පවතින ඕනෑම සැකසුම් අවසන් කරයි.

source: Markdown
si_lk: සලකුණු කිරීම

source: Raw
si_lk: අමු

source: Save
si_lk: සුරකින්න

source: Menu
si_lk: මෙනු

source: Download PDF (via print)
si_lk: PDF බාගන්න (මුද්‍රණය හරහා)

source: Download Markdown
si_lk: Markdown බාගන්න

source: Replace custom syntax by a valid one
si_lk: අභිරුචි වාක්‍ය ඛණ්ඩය වලංගු එකකින් ප්‍රතිස්ථාපනය කරන්න

source: Download GFM simplified format
si_lk: GFM සරල කළ ආකෘතිය බාගන්න

source: Markdown parsing rules
si_lk: සලකුණු විග්‍රහ කිරීමේ නීති

source: Image parsing
si_lk: රූප විග්‍රහ කිරීම

source: Link parsing
si_lk: සබැඳි විග්‍රහ කිරීම

source: Edit report
si_lk: වාර්තාව සංස්කරණය කරන්න

source: Help
si_lk: උදව්

source: Bold
si_lk: නිර්භීත

source: Italic
si_lk: ඇල අකුරු

source: Heading
si_lk: ශීර්ෂය

source: Strikethrough
si_lk: පහර හරහා

source: Unordered list
si_lk: ඇණවුම් නොකළ ලැයිස්තුව

source: Ordered list
si_lk: ඇණවුම් කළ ලැයිස්තුව

source: Last updated
si_lk: අවසන් වරට යාවත්කාලීන කරන ලදී

source: Toggle autocompletion while typing
si_lk: ටයිප් කිරීමේදී ස්වයං සම්පූර්ණ කිරීම ටොගල් කරන්න

source: Synchronize scrolling
si_lk: අනුචලනය සමමුහුර්ත කරන්න

source: Automatically render markdown when typing
si_lk: ටයිප් කරන විට ස්වයංක්‍රීයව සලකුණු කිරීම

source: Toggle fullscreen mode
si_lk: සම්පූර්ණ තිර මාදිලිය ටොගල් කරන්න

source: You are about to save the document. Do you wish to proceed?
si_lk: ඔබ ලේඛනය සුරැකීමට සූදානම් වේ. ඔබ ඉදිරියට යාමට කැමතිද?

source: In order to save the PDF, you have to set the print destination to `Save as PDF`.
si_lk: PDF සුරැකීමට, ඔබ මුද්‍රණ ගමනාන්තය 'PDF ලෙස සුරකින්න' ලෙස සැකසිය යුතුය.

source: You are about to leave the page with unsaved changes. Do you want to proceed?
si_lk: ඔබ නොසුරකින ලද වෙනස්කම් සහිතව පිටුවෙන් ඉවත් වීමට සූදානම් වේ. ඔබට ඉදිරියට යාමට අවශ්‍යද?

source: Unsaved changes
si_lk: නොසුරකින ලද වෙනස්කම්

source: Command
si_lk: විධානය

source: Action
si_lk: කටයුතු

source: Triggers autocomplete if applicable
si_lk: අදාළ නම් ස්වයං සම්පූර්ණ කිරීම අවුලුවයි

source: Makes text bold
si_lk: පෙළ තද බවට පත් කරයි

source: Makes text italic
si_lk: පෙළ ඇල අකුරු කරයි

source: Insert a MISP Element
si_lk: MISP මූලද්‍රව්‍යයක් ඇතුළු කරන්න

source: Makes text as header
si_lk: ශීර්ෂකය ලෙස පෙළ සාදයි

source: Editor shortcuts
si_lk: සංස්කාරක කෙටිමං

source: Markdown plugin
si_lk: මාර්ක්ඩවුන් ප්ලගිනය

source: Markdown plugins
si_lk: මාර්ක්ඩවුන් ප්ලගින

source: Highlighted language
si_lk: උද්දීපනය කළ භාෂාව

source: Languages rendered in code block can be highlighted using the %s plugin. The list of supported languages can be found %s.
si_lk: %s ප්ලගිනය භාවිතයෙන් කේත බ්ලොක් එකෙහි විදැහුම් කරන ලද භාෂා උද්දීපනය කළ හැක. සහාය දක්වන භාෂා ලැයිස්තුව %sසොයා ගත හැක.

source: Markdown viewer help
si_lk: Markdown viewer උදවු

source: Organisations and Tags are being fetched from the remote server.
si_lk: සංවිධාන සහ ටැග් දුරස්ථ සේවාදායකයෙන් ලබා ගනිමින් ඇත.

source: Organisations and Tags have been fetched from the remote server.
si_lk: සංවිධාන සහ ටැග් දුරස්ථ සේවාදායකයෙන් ලබාගෙන ඇත.

source: Issues while trying to fetch Organisations and Tags from the remote server.
si_lk: දුරස්ථ සේවාදායකයෙන් සංවිධාන සහ ටැග් ලබා ගැනීමට උත්සාහ කිරීමේදී ගැටළු.

source: Reason:
si_lk: හේතුව:

source: tag
si_lk: ටැගය

source: AND
si_lk: හා

source: AND NOT
si_lk: සහ නොවේ

source: Additional sync parameters (based on the event index filters)
si_lk: අතිරේක සමමුහුර්ත පරාමිති (සිදුවීම් දර්ශක පෙරහන් මත පදනම්ව)

source: Connection error or the remote version is not supporting remote filter lookups (v2.4.142+). Make sure that the remote instance is accessible and that it is up to date.
si_lk: සම්බන්ධතා දෝෂය හෝ දුරස්ථ අනුවාදය දුරස්ථ පෙරහන් සෙවීම් සඳහා සහය නොදක්වයි (v2.4.142+). දුරස්ථ අවස්ථාවට ප්‍රවේශ විය හැකි බවත් එය යාවත්කාලීන බවත් සහතික කර ගන්න.

source: The server must first be saved in order to fetch remote synchronisation rules.
si_lk: දුරස්ථ සමමුහුර්ත කිරීමේ නීති ලබා ගැනීම සඳහා සේවාදායකය පළමුව සුරැකිය යුතුය.

source: Type filtering
si_lk: වර්ගය පෙරීම

source: Warning!
si_lk: අවවාදයයි!

source: Use this feature only if you know exactly what you are doing as it might introduce unwanted behaviour:
si_lk: අනවශ්‍ය හැසිරීම් හඳුන්වා දිය හැකි බැවින් ඔබ කරන්නේ කුමක්ද යන්න ඔබ හරියටම දන්නේ නම් පමණක් මෙම විශේෂාංගය භාවිතා කරන්න:

source: This instance will potentially receive incomplete events (missing the filtered-out types)
si_lk: මෙම අවස්ථාවට අසම්පූර්ණ සිදුවීම් ලැබීමට ඉඩ ඇත (පෙරහන ලද වර්ග මග හැරී ඇත)

source: If later on you were to decide to have the previously filtered types included, the only way for this instance to receive them is to completely delete the affected events, as a full sync is needed
si_lk: පසුකාලීනව ඔබ කලින් පෙරහන ලද වර්ග ඇතුළත් කිරීමට තීරණය කරන්නේ නම්, මෙම අවස්ථාවට ඒවා ලැබීමට ඇති එකම ක්‍රමය සම්පූර්ණ සමමුහුර්ත කිරීමක් අවශ්‍ය බැවින් බලපෑමට ලක් වූ සිදුවීම් සම්පූර්ණයෙන්ම මකා දැමීමයි.

source: Any instances synchronising with this instances will also receive incomplete events
si_lk: මෙම අවස්ථාවන් සමඟ සමමුහුර්ත කරන ඕනෑම අවස්ථාවක් අසම්පූර්ණ සිදුවීම් ද ලැබෙනු ඇත

source: Any instance being synchronised with this one will also be affected by these shortcomings!
si_lk: මෙය සමඟ සමමුහුර්ත වන ඕනෑම අවස්ථාවක් මෙම අඩුපාඩු වලින් ද බලපානු ඇත!

source: I understand the caveats mentioned above resulting from the use of these filters
si_lk: මෙම ෆිල්ටර භාවිතයේ ප්‍රතිඵලයක් ලෙස ඉහත සඳහන් කළ අනතුරු ඇඟවීම් මට වැටහෙනවා

source: Attribute Types
si_lk: ගුණාංග වර්ග

source: Object Types
si_lk: වස්තු වර්ග

source: Allowed %s (OR)
si_lk: අවසර %s (හෝ)

source: Delete selected rules
si_lk: තෝරාගත් නීති මකන්න

source: Move %s to the list of %s to allow
si_lk: ඉඩ දීමට %s %s ගෙන යන්න

source: Move %s to the list of %s to block
si_lk: අවහිර කිරීමට %s %s ගෙන යන්න

source: This text input allows you to add custom values to the rules
si_lk: මෙම පෙළ ආදානය ඔබට රීති වලට අභිරුචි අගයන් එකතු කිරීමට ඉඩ සලසයි

source: Show freetext input
si_lk: නිදහස් පෙළ ආදානය පෙන්වන්න

source: Blocked %s (AND NOT)
si_lk: අවහිර %s (සහ නොවේ)

source: Select some %s
si_lk: %sකිහිපයක් තෝරන්න

source: Field
si_lk: ක්ෂේත්රය

source: Describe the %s using one or several (separated by a line-break) of the following types: %s
si_lk: පහත වර්ග වලින් එකක් හෝ කිහිපයක් (රේඛා බිඳීමකින් වෙන් කර ඇති) භාවිතා කරමින් %s විස්තර කරන්න: %s

source: Describe the %s using one or several %s\s (separated by a line-break)
si_lk: %s\s එකක් හෝ කිහිපයක් භාවිතා කරමින් %s විස්තර කරන්න (රේඛා බිඳීමකින් වෙන් කර ඇත)

source: Describe the %s using one of the following types: %s
si_lk: පහත වර්ග වලින් එකක් භාවිතා කරමින් %s විස්තර කරන්න: %s

source: Describe the %s using a %s
si_lk: %sභාවිතා කර %s විස්තර කරන්න

source: Template Description
si_lk: සැකිලි විස්තරය

source: Template ID
si_lk: සැකිලි ID

source: Created by
si_lk: නිර්මාණය කළේ

source: Tags automatically assigned
si_lk: ටැග් ස්වයංක්‍රීයව පවරා ඇත

source: File
si_lk: ගොනුව

source: Types
si_lk: වර්ග

source: Batch
si_lk: කණ්ඩායම

source: Delete template element
si_lk: අච්චු අංගය මකන්න

source: Edit template element
si_lk: අච්චු මූලාංගය සංස්කරණය කරන්න

source: Malware
si_lk: අනිෂ්ට මෘදුකාංග

source: Text
si_lk: පෙළ

source: A new or modified event was just published on %s
si_lk: නව හෝ වෙනස් කරන ලද සිදුවීමක් %sදින ප්‍රකාශයට පත් කරන ලදී

source: If you would like to unsubscribe from receiving such alert e-mails, simply disable publish alerts via %s
si_lk: ඔබ එවැනි අනතුරු ඇඟවීමේ විද්‍යුත් තැපෑල ලැබීමෙන් ඉවත් වීමට කැමති නම්, සරලව %sහරහා ප්‍රකාශන ඇඟවීම් අබල කරන්න.

source: You have tripped the cross-site request forgery protection of MISP
si_lk: ඔබ MISP හි හරස්-අඩවි ඉල්ලීම ව්‍යාජ ආරක්ෂණය අවුල් කර ඇත

source: CSRF error
si_lk: CSRF දෝෂයකි

source: This happens usually when you try to resubmit the same form with invalidated CSRF tokens or you had a form open too long and the CSRF tokens simply expired. Just go back to the previous page and refresh the form (by reloading the same url) so that the tokens get refreshed.
si_lk: ඔබ වලංගු නොවන CSRF ටෝකන සමඟ එකම පෝරමය නැවත ඉදිරිපත් කිරීමට උත්සාහ කරන විට මෙය සාමාන්‍යයෙන් සිදු වේ පෙර පිටුවට ආපසු ගොස් පෝරමය නැවුම් කරන්න (එකම url නැවත පූරණය කිරීමෙන්) එවිට ටෝකන නැවුම් වේ.

source: Alternatively, click <a href="%s">here</a> to continue to the start page.
si_lk: විකල්පයක් ලෙස, ආරම්භක පිටුවට යාමට මෙහි <a href="%s"></a> ක්ලික් කරන්න.

source: Missing Database Connection
si_lk: දත්ත සමුදා සම්බන්ධතාව මග හැරී ඇත

source: PDO error
si_lk: PDO දෝෂයකි

source: Add Event Blocklist Entries
si_lk: සිදුවීම් වාරණ ලැයිස්තු ඇතුළත් කිරීම් එක් කරන්න

source: Simply paste a list of all the event UUIDs that you wish to block from being entered.
si_lk: ඔබ ඇතුළු කිරීමෙන් අවහිර කිරීමට බලාපොරොත්තු වන සියලුම සිදුවීම් UUID ලැයිස්තුවක් සරලව අලවන්න.

source: Enter a single or a list of UUIDs
si_lk: තනි හෝ UUID ලැයිස්තුවක් ඇතුළු කරන්න

source: Creating organisation
si_lk: සංවිධානය නිර්මාණය කිරීම

source: (Optional) The organisation that the event is associated with
si_lk: (විකල්ප) සිදුවීම සම්බන්ධ සංවිධානය

source: (Optional) the event info of the event that you would like to block. It's best to leave this empty if you are adding a list of UUIDs.
si_lk: (විකල්ප) ඔබ අවහිර කිරීමට කැමති සිදුවීමේ සිදුවීම් තොරතුරු. ඔබ UUID ලැයිස්තුවක් එක් කරන්නේ නම් මෙය හිස්ව තැබීම වඩාත් සුදුසුය.

source: (Optional) Any comments you would like to add regarding this (or these) entries.
si_lk: (විකල්ප) මෙම (හෝ මෙම) ඇතුළත් කිරීම් සම්බන්ධයෙන් ඔබ එක් කිරීමට කැමති අදහස්.

source: Edit Event Blocklist Entries
si_lk: සිදුවීම් වාරණ ලැයිස්තු ඇතුළත් කිරීම් සංස්කරණය කරන්න

source: List of all the event UUIDs that you wish to block from being entered.
si_lk: ඔබ ඇතුළු කිරීමෙන් අවහිර කිරීමට බලාපොරොත්තු වන සියලුම සිදුවීම් UUID ලැයිස්තුව.

source: Event Blocklists
si_lk: සිදුවීම් වාරණ ලැයිස්තු

source: Delete blocklisted events
si_lk: අවහිර කළ සිදුවීම් මකන්න

source: Are you sure you want to delete from the blocklist the selected events?
si_lk: ඔබට තෝරාගත් සිදුවීම් අවහිර ලැයිස්තුවෙන් මැකීමට අවශ්‍ය බව විශ්වාසද?

source: Pending
si_lk: පොරොත්තුවෙන්

source: Issued
si_lk: නිකුත් කළ

source: Requester
si_lk: ඉල්ලන්නා

source: Recipient
si_lk: ලබන්නා

source: Delegation index
si_lk: නියෝජිත දර්ශකය

source: Are you sure you would like to accept the request by %s to take ownership of Event #%s
si_lk: සිදුවීම් #%sහි හිමිකාරිත්වය ගැනීමට ඔබ %s න් ඉල්ලීම පිළිගැනීමට කැමති බව ඔබට විශ්වාසද

source: Delegate the publishing of the Event to another organisation
si_lk: උත්සවයේ ප්‍රකාශනය වෙනත් සංවිධානයකට පවරන්න

source: Warning: You are about to request another organisation to take ownership of this event.
si_lk: අවවාදයයි: ඔබ මෙම සිදුවීමේ හිමිකාරිත්වය ගැනීමට වෙනත් ආයතනයක් ඉල්ලීමට සූදානම් වේ.

source: Target Organisation
si_lk: ඉලක්ක සංවිධානය

source: Select organisation
si_lk: සංවිධානය තෝරන්න

source: Desired Distribution
si_lk: අපේක්ෂිත බෙදා හැරීම

source: Desired Sharing Group
si_lk: කැමති බෙදාගැනීමේ කණ්ඩායම

source: Message to the recipient organisation
si_lk: ලබන්නාගේ සංවිධානයට පණිවිඩය

source: Delete Delegation Request
si_lk: නියෝජිත ඉල්ලීම මකන්න

source: Are you sure you would like to discard the request by %s to take ownership of Event #%s
si_lk: සිදුවීම් #%sහි හිමිකාරිත්වය ගැනීමට ඔබ ඉල්ලීම %s න් ඉවත දැමීමට කැමති බව ඔබට විශ්වාසද

source: Event Delegation
si_lk: සිදුවීම් නියෝජිත කණ්ඩායම

source: your organisation
si_lk: ඔබේ සංවිධානය

source: Your organisation
si_lk: ඔබේ සංවිධානය

source: Request details</b><br /><span class="red bold">%s</span> is requesting <span class="red bold">%s</span> to take over this event.
si_lk: ඉල්ලීම් විස්තර</b><br /><span class="red bold">%s</span> මෙම සිදුවීම භාර ගැනීමට <span class="red bold">%s</span> ඉල්ලා සිටී.

source: The desired distribution level is
si_lk: අපේක්ෂිත බෙදාහැරීමේ මට්ටම වේ

source: The desired sharing group to distribute the event to is
si_lk: සිදුවීම බෙදා හැරීමට අපේක්ෂිත බෙදාගැනීමේ කණ්ඩායම වේ

source: Message from requester
si_lk: ඉල්ලන්නාගෙන් පණිවිඩය

source: Accept delegation request
si_lk: නියෝජිත ඉල්ලීම පිළිගන්න

source: Accept
si_lk: පිළිගන්න

source: Decline and remove delegation request
si_lk: නියෝජිත ඉල්ලීම ප්‍රතික්ෂේප කර ඉවත් කරන්න

source: Discard
si_lk: ඉවතලන්න

source: Add EventGraph
si_lk: EventGraph එකතු කරන්න

source: Edit EventGraph
si_lk: EventGraph සංස්කරණය කරන්න

source: EventGraph Deletion
si_lk: EventGraph මකාදැමීම

source: Are you sure you want to delete eventGraph #%s? The eventGraph will be permanently deleted and unrecoverable.
si_lk: ඔබට EventGraph #%sමැකීමට අවශ්‍ය බව විශ්වාසද? සිදුවීම් ප්‍රස්තාරය ස්ථිරවම මකා දැමෙනු ඇති අතර ආපසු ලබාගත නොහැක.

source: Add Event Report for Event #%s
si_lk: සිදුවීම් #%sසඳහා සිදුවීම් වාර්තාව එක් කරන්න

source: Edit Event Report %s (event #%s)
si_lk: සිදුවීම් වාර්තාව %s සංස්කරණය කරන්න (සිදුවීම #%s)

source: Event Reports %s
si_lk: සිදුවීම් වාර්තා %s

source: for Event %s
si_lk: සිදුවීම් %sසඳහා

source: Last update
si_lk: අවසාන යාවත්කාලීන කිරීම

source: Restore report
si_lk: වාර්තාව ප්‍රතිසාධනය කරන්න

source: Are you sure you want to restore the Report?
si_lk: ඔබට වාර්තාව ප්‍රතිසාධනය කිරීමට අවශ්‍ය බව විශ්වාසද?

source: Event report: %s
si_lk: සිදුවීම් වාර්තාව: %s

source: Delete Event Report
si_lk: සිදුවීම් වාර්තාව මකන්න

source: report
si_lk: වාර්තාව

source: Automatic entities extraction
si_lk: ස්වයංක්‍රීය ආයතන නිස්සාරණය

source: Automatically extracting entities from a report will use the freetext import tools to extract and create attributes from the report.
si_lk: වාර්තාවකින් ආයතන ස්වයංක්‍රීයව උපුටා ගැනීම, වාර්තාවෙන් උපලක්ෂණ උකහා ගැනීමට සහ නිර්මාණය කිරීමට නිදහස් පෙළ ආයාත මෙවලම් භාවිත කරයි.

source: Post extraction actions:
si_lk: පශ්චාත් නිස්සාරණ ක්‍රියා:

source: Tag the event with contextual elements found in the report
si_lk: වාර්තාවේ ඇති සන්දර්භීය අංග සමඟ සිදුවීම ටැග් කරන්න

source: Import from URL (event %s)
si_lk: URL වෙතින් ආයාත කරන්න (සිදුවීම %s)

source: Content for this URL will be downloaded and converted to Markdown
si_lk: මෙම URL සඳහා අන්තර්ගතය බාගත කර Markdown බවට පරිවර්තනය කරනු ඇත

source: Viewing reports in extended event view
si_lk: විස්තීරණ සිදුවීම් දසුන තුළ වාර්තා බැලීම

source: Import from URL
si_lk: URL වෙතින් ආයාත කරන්න

source: Generate report from Event
si_lk: සිදුවීමෙන් වාර්තාවක් සාදන්න

source: Based on filters, create a report summarizing the event
si_lk: පෙරහන් මත පදනම්ව, සිදුවීම සාරාංශ කරමින් වාර්තාවක් සාදන්න

source: Failed to load Event report table
si_lk: සිදුවීම් වාර්තා වගුව පූරණය කිරීමට අසමත් විය

source: Replace suggestions in report
si_lk: වාර්තාවේ යෝජනා ප්‍රතිස්ථාපනය කරන්න

source: Create report from event
si_lk: සිදුවීමෙන් වාර්තාවක් සාදන්න

source: Generate a report based on filtering criterias.
si_lk: පෙරීමේ නිර්ණායක මත පදනම්ව වාර්තාවක් උත්පාදනය කරන්න.

source: REST search filters
si_lk: REST සෙවුම් පෙරහන්

source: Provide the filtering criterias for attributes to be taken into account in the report
si_lk: වාර්තාවේ සැලකිල්ලට ගත යුතු ගුණාංග සඳහා පෙරීමේ නිර්ණායක සපයන්න

source: Threat Level
si_lk: තර්ජන මට්ටම

source: Event Info
si_lk: සිදුවීම් තොරතුරු

source: Quick Event Description or Tracking Info
si_lk: ඉක්මන් සිදුවීම් විස්තරය හෝ ලුහුබැඳීමේ තොරතුරු

source: Event UUID or ID. Leave blank if not applicable.
si_lk: සිදුවීම් UUID හෝ ID. අදාළ නොවේ නම් හිස්ව තබන්න.
