Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: Insufficient privileges to remove local tags from events you do not own.
si_lk: ඔබට අයිති නැති සිදුවීම් වලින් දේශීය ටැග් ඉවත් කිරීමට ප්‍රමාණවත් වරප්‍රසාද නැත.

source: %s tag %s (%s) successfully removed from %s(%s).
si_lk: %s ටැගය %s (%s) %s(%s) වෙතින් සාර්ථකව ඉවත් කරන ලදී.

source: Local
si_lk: දේශීය

source: Global
si_lk: ගෝලීය

source: Failed to remove tag from object.
si_lk: වස්තුවෙන් ටැගය ඉවත් කිරීමට අසමත් විය.

source: Taxonomy not found.
si_lk: වර්ගීකරණය හමු නොවීය.

source: %s Taxonomy Library
si_lk: %s වර්ගීකරණ පුස්තකාලය

source: Taxonomy enabled.
si_lk: වර්ගීකරණය සබල කර ඇත.

source: Taxonomy disabled.
si_lk: වර්ගීකරණය ආබාධිතයි.

source: All taxonomy libraries are up to date already.
si_lk: සියලුම වර්ගීකරණ පුස්තකාල දැනටමත් යාවත්කාලීන වේ.

source: Could not update any of the taxonomy libraries
si_lk: වර්ගීකරණ පුස්තකාල කිසිවක් යාවත්කාලීන කිරීමට නොහැකි විය

source: Successfully updated
si_lk: සාර්ථකව යාවත්කාලීන කරන ලදී

source: taxonomy libraries.
si_lk: වර්ගීකරණ පුස්තකාල.

source: However, could not update
si_lk: කෙසේ වෙතත්, යාවත්කාලීන කිරීමට නොහැකි විය

source: Taxonomy ID or tag name must be provided.
si_lk: වර්ගීකරණ හැඳුනුම්පත හෝ ටැග් නම සැපයිය යුතුය.

source: The tag(s) has been saved.
si_lk: ටැගය(ය) සුරැකී ඇත.

source: The tag(s) could not be saved. Please, try again.
si_lk: ටැගය(ය) සුරැකිය නොහැක. කරුණාකර නැවත උත්සාහ කරන්න.

source: The tag(s) has been hidden.
si_lk: ටැග්(ය) සඟවා ඇත.

source: The tag(s) could not be hidden. Please, try again.
si_lk: ටැග්(ය) සැඟවිය නොහැක. කරුණාකර නැවත උත්සාහ කරන්න.

source: Taxonomy successfully deleted.
si_lk: වර්ගීකරණය සාර්ථකව මකා ඇත.

source: Taxonomy could not be deleted.
si_lk: වර්ගීකරණය මැකීමට නොහැකි විය.

source: No template with the provided ID exists, or you are not authorised to see it.
si_lk: සපයා ඇති හැඳුනුම්පත සහිත අච්චුවක් නොමැත, නැතහොත් ඔබට එය බැලීමට අවසර නැත.

source: Event populated,
si_lk: සිදුවීම ජනාකීර්ණ,

source: Event populated, but
si_lk: සිදුවීම ජනාකීර්ණ නමුත්

source: Invalid ID passed.
si_lk: වලංගු නොවන හැඳුනුම්පත සම්මත විය.

source: Invalid user setting.
si_lk: වලංගු නොවන පරිශීලක සැකසුම.

source: Invalid setting.
si_lk: වලංගු නොවන සැකසුම.

source: This setting is restricted and requires the following permission(s): %s
si_lk: මෙම සැකසුම සීමා කර ඇති අතර පහත අවසරය අවශ්‍ය වේ: %s

source: Setting saved.
si_lk: සැකසීම සුරකින ලදී.

source: Setting could not be saved.
si_lk: සැකසීම සුරැකිය නොහැකි විය.

source: Expecting POST or DELETE request.
si_lk: POST හෝ DELETE ඉල්ලීමක් බලාපොරොත්තු වේ.

source: Setting deleted.
si_lk: සැකසීම මකා දමන ලදී.

source: Setting could not be deleted.
si_lk: සැකසීම මැකීමට නොහැකි විය.

source: No path POSTed.
si_lk: කිසිදු මාර්ගයක් පළ කර නැත.

source: Expecting POST request.
si_lk: POST ඉල්ලීමක් බලාපොරොත්තු වේ.

source: Invalid user or not authorised.
si_lk: වලංගු නොවන පරිශීලක හෝ අවසර නැත.

source: Invalid user
si_lk: වලංගු නොවන පරිශීලක

source: Invalid e-mail domain. Your user is restricted to creating users for the following domain(s):
si_lk: වලංගු නොවන විද්‍යුත් තැපැල් වසමක්. ඔබගේ පරිශීලකයා පහත වසම් (ය) සඳහා පරිශීලකයන් සෑදීමට සීමා කර ඇත:

source: The profile has been updated
si_lk: පැතිකඩ යාවත්කාලීන කර ඇත

source: The profile could not be updated. Please, try again.
si_lk: පැතිකඩ යාවත්කාලීන කළ නොහැකි විය. කරුණාකර නැවත උත්සාහ කරන්න.

source: Invalid password. Please enter your current password to continue.
si_lk: වලංගු නොවන මුරපදයක්. ඉදිරියට යාමට කරුණාකර ඔබගේ වත්මන් මුරපදය ඇතුලත් කරන්න.

source: Please enter your current password to continue.
si_lk: ඉදිරියට යාමට කරුණාකර ඔබගේ වත්මන් මුරපදය ඇතුලත් කරන්න.

source: Submitted new password cannot be the same as the current one
si_lk: ඉදිරිපත් කරන ලද නව මුරපදය වත්මන් මුරපදයට සමාන විය නොහැක

source: Password Changed.
si_lk: මුරපදය වෙනස් කර ඇත.

source: The password could not be updated. Make sure you meet the minimum password length / complexity requirements.
si_lk: මුරපදය යාවත්කාලීන කළ නොහැකි විය. ඔබ අවම මුරපද දිග / සංකීර්ණතා අවශ්‍යතා සපුරාලන බවට වග බලා ගන්න.

source: Redacted
si_lk: සංශෝධනය කරන ලදී

source: The user could not be saved. Invalid organisation.
si_lk: පරිශීලකයා සුරැකීමට නොහැකි විය. වලංගු නොවන සංවිධානයක්.

source: User notified of new credentials.
si_lk: නව අක්තපත්‍ර ගැන පරිශීලකයාට දැනුම් දෙනු ලැබේ.

source: User notification of new credentials could not be send.
si_lk: නව අක්තපත්‍ර පිළිබඳ පරිශීලක දැනුම්දීම යැවීමට නොහැකි විය.

source: The user has been saved.
si_lk: පරිශීලකයා සුරකින ලදී.

source: The user could not be saved. Please, try again.
si_lk: පරිශීලකයා සුරැකීමට නොහැකි විය. කරුණාකර නැවත උත්සාහ කරන්න.

source: The user has been saved
si_lk: පරිශීලකයා සුරකින ලදී

source: User deleted
si_lk: පරිශීලක මකා දමන ලදී

source: User was not deleted
si_lk: පරිශීලක මකා නැත

source: The field `%s` cannot be toggled
si_lk: ක්ෂේත්‍රය `%sටොගල් කළ නොහැක

source: Administrators only
si_lk: පරිපාලකයින් පමණි

source: Invalid users
si_lk: වලංගු නොවන පරිශීලකයන්

source: %s users got their field `%s` %s
si_lk: පරිශීලකයින් %s දෙනෙකුට ඔවුන්ගේ ක්ෂේත්‍රය ` %s%s

source: enabled
si_lk: සක්රීය කර ඇත

source: disabled
si_lk: ආබාධිතයි

source: All users have already their field `%s` %s
si_lk: සියලුම පරිශීලකයින්ට දැනටමත් ඔවුන්ගේ ක්ෂේත්‍රය `%s` %sඇත

source: Invalid username or password, try again
si_lk: වලංගු නොවන පරිශීලක නාමයක් හෝ මුරපදයක්, නැවත උත්සාහ කරන්න

source: Welcome! Last login was on %s
si_lk: සාදරයෙන් පිළිගනිමු! අවසාන පිවිසුම %sට සිදු විය

source: Good-Bye
si_lk: ආයුබෝවන්

source: This functionality is only accessible via POST requests.
si_lk: මෙම ක්‍රියාකාරීත්වයට ප්‍රවේශ විය හැක්කේ POST ඉල්ලීම් හරහා පමණි.

source: New authkey generated.
si_lk: නව authkey ජනනය කරන ලදී.

source: Job initiated.
si_lk: රැකියාව ආරම්භ කරන ලදී.

source: %s authkeys reset, %s could not be reset.
si_lk: %s authkeys යළි පිහිටුවයි, %s නැවත සැකසිය නොහැක.

source: You accepted the Terms and Conditions.
si_lk: ඔබ නියම සහ කොන්දේසි පිළිගෙන ඇත.

source: Recipient email not provided
si_lk: ලබන්නාගේ ඊමේල් සපයා නැත

source: Recipient organisation not provided
si_lk: ලබන්නාගේ සංවිධානය සපයා නැත

source: E-mails sent, but failed to deliver the messages to the following recipients:
si_lk: විද්‍යුත් තැපෑල යවා ඇත, නමුත් පහත ලබන්නන් වෙත පණිවිඩ ලබා දීමට අපොහොසත් විය:

source: E-mails sent.
si_lk: ඊමේල් යවා ඇත.

source: The OTP is incorrect or has expired
si_lk: OTP වැරදි හෝ කල් ඉකුත් වී ඇත

source: An email containing a OTP has been sent.
si_lk: OTP අඩංගු විද්‍යුත් තැපෑලක් යවා ඇත.

source: The email couldn't be sent, please reach out to your administrator.
si_lk: විද්‍යුත් තැපෑල යැවීමට නොහැකි විය, කරුණාකර ඔබගේ පරිපාලක වෙත සම්බන්ධ වන්න.

source: Usage data
si_lk: භාවිත දත්ත

source: Organisations
si_lk: ආයතන

source: User and Organisation statistics
si_lk: පරිශීලක සහ සංවිධාන සංඛ්‍යාලේඛන

source: Tags
si_lk: ටැග්

source: Attribute histogram
si_lk: ගුණාංග හිස්ටෝග්‍රෑම්

source: Sightings toplists
si_lk: දර්ශන ඉහල පෙලේ

source: All
si_lk: සියලුම

source: Self registration is not enabled on this instance.
si_lk: මෙම අවස්ථාවෙහිදී ස්වයං ලියාපදිංචිය සබල නොවේ.

source: We require at least the email field to be filled.
si_lk: අපට අවම වශයෙන් විද්‍යුත් තැපැල් ක්ෂේත්‍රය වත් පිරවීම අවශ්‍ය වේ.

source: Request could not be created.
si_lk: ඉල්ලීම නිර්මාණය කළ නොහැකි විය.

source: Errors: %s
si_lk: දෝෂ: %s

source: User registration for %s.
si_lk: %sසඳහා පරිශීලක ලියාපදිංචිය.

source: Request could not be created. Make sure that the email and org name fields are filled.
si_lk: ඉල්ලීම නිර්මාණය කළ නොහැකි විය. ඊමේල් සහ ආයතන නාම ක්ෂේත්‍ර පුරවා ඇති බවට වග බලා ගන්න.

source: Request sent. The administrators of this community have been notified.
si_lk: ඉල්ලීම යවන ලදී. මෙම ප්‍රජාවේ පරිපාලකයින්ට දන්වා ඇත.

source: default
si_lk: පෙරනිමිය

source: Yes
si_lk: ඔව්

source: No
si_lk: නැත

source: Role ID not provided and no default role exist on the instance
si_lk: භූමිකාව හැඳුනුම්පත සපයා නැති අතර නිදසුනෙහි පෙරනිමි භූමිකාවක් නොමැත

source: No organisation selected. Supply an Organisation ID
si_lk: සංවිධානයක් තෝරා නැත. සංවිධාන හැඳුනුම්පතක් සපයන්න

source: Added %s user(s).
si_lk: පරිශීලක(න්) %s ක් එක් කරන ලදී.

source: Could not add %s user(s), reasons for the failure have been logged.
si_lk: පරිශීලක(ය) %s ක් එක් කිරීමට නොහැකි විය, අසාර්ථක වීමට හේතු ලොග් කර ඇත.

source: No new users added - there was nothing to add.
si_lk: නව පරිශීලකයින් එක් කර නැත - එකතු කිරීමට කිසිවක් නැත.

source: This endpoint can only be triggered via POST requests.
si_lk: මෙම අන්ත ලක්ෂ්‍යය ක්‍රියාත්මක කළ හැක්කේ POST ඉල්ලීම් හරහා පමණි.

source: Warning list updated
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තුව යාවත්කාලීන කරන ලදී

source: Warning list failed to update
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තුව යාවත්කාලීන කිරීමට අසමත් විය

source: %s could not be installed/updated. Error: %s
si_lk: %s ස්ථාපනය/යාවත්කාලීන කිරීමට නොහැකි විය. දෝෂය: %s

source: Warninglist update (nothing to update)
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තු යාවත්කාලීන කිරීම (යාවත්කාලීන කිරීමට කිසිවක් නැත)

source: Executed an update of the warning lists, but there was nothing to update.
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තු යාවත්කාලීන කිරීමක් ක්‍රියාත්මක කළ නමුත් යාවත්කාලීන කිරීමට කිසිවක් නොතිබුණි.

source: All warninglists are up to date already.
si_lk: සියලුම අනතුරු ඇඟවීමේ ලැයිස්තු දැනටමත් යාවත්කාලීන වේ.

source: Could not update any of the warning lists
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තු කිසිවක් යාවත්කාලීන කිරීමට නොහැකි විය

source: Successfully updated %s warninglists.
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තු %s ක් සාර්ථකව යාවත්කාලීන කරන ලදී.

source: However, could not update %s warninglists.
si_lk: කෙසේ වෙතත්, අනතුරු ඇඟවීමේ ලැයිස්තු %s ක් යාවත්කාලීන කිරීමට නොහැකි විය.

source: This function only accepts POST requests.
si_lk: මෙම කාර්යය POST ඉල්ලීම් පමණක් පිළිගනී.

source: Warninglist not found.
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තුව හමු නොවීය.

source: Warninglist(s) not found.
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තුව(ය) හමු නොවීය.

source: warninglist(s)
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තුව(ය)

source: Warninglist(s) could not be toggled.
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තුව(ය) ටොගල් කළ නොහැකි විය.

source: Invalid Warninglist.
si_lk: වලංගු නොවන අනතුරු ඇඟවීමේ ලැයිස්තුව.

source: Warninglist disabled
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තුව අබල කර ඇත

source: Warninglist enabled
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තුව සබල කර ඇත

source: This action is available via AJAX only.
si_lk: මෙම ක්‍රියාව AJAX හරහා පමණක් ලබා ගත හැක.

source: No valid data received.
si_lk: වලංගු දත්ත ලැබී නැත.

source: No valid data received: field `%s` is missing.
si_lk: වලංගු දත්ත කිසිවක් ලැබී නැත: ක්ෂේත්‍රය `%sඅස්ථානගත වී ඇත.

source: No valid data received: `list` field is not array
si_lk: වලංගු දත්ත කිසිවක් ලැබී නැත: `ලැයිස්තුව` ක්ෂේත්‍රය අරාවක් නොවේ

source: Warninglist imported
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තුව ආනයනය කරන ලදී

source: Warninglist successfully deleted.
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තුව සාර්ථකව මකා ඇත.

source: Warninglists could not be deleted.
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තු මකා දැමිය නොහැක.

source: This could be an indication of an attempted privilege escalation on older vulnerable versions of MISP (<2.4.115)
si_lk: මෙය MISP (<2.4.115) හි පැරණි අවදානමට ලක්විය හැකි අනුවාදවල වරප්‍රසාද උත්සන්න කිරීමේ උත්සාහයක ඇඟවීමක් විය හැකිය.

source: User triggered security alert by attempting to access /%s/%s. Reason why this endpoint is of interest: %s
si_lk: පරිශීලක /%sවෙත ප්‍රවේශ වීමට උත්සාහ කිරීමෙන් ආරක්‍ෂක ඇඟවීමක් ක්‍රියාවට%s. මෙම අවසාන ලක්ෂ්‍යය උනන්දු වීමට හේතුව: %s

source: The %s has been saved.
si_lk: %s ඉතිරි කර ඇත.

source: The %s could not be saved. Please, try again.
si_lk: %s සුරැකීමට නොහැකි විය. කරුණාකර නැවත උත්සාහ කරන්න.

source: Invalid %s
si_lk: වලංගු නොවන %s

source: The %s has been saved
si_lk: %s ඉතිරි කර ඇත

source: %s deleted
si_lk: %s මකා දමන ලදී

source: %s was not deleted
si_lk: %s මකා නැත

source: Pass a list of uuids via the "uuids" key in the request object.
si_lk: ඉල්ලීම් වස්තුවේ "uuids" යතුර හරහා uuid ලැයිස්තුවක් ලබා දෙන්න.

source: Done. Added %d new entries to the blocklist. %d entries could not be saved.
si_lk: කළා. අවහිර ලැයිස්තුවට නව ඇතුළත් කිරීම් %d ක් එක් කරන ලදී. ඇතුළත් කිරීම් %d ක් සුරැකීමට නොහැකි විය.

source: Blocklist item not found.
si_lk: අවහිර ලැයිස්තු අයිතමය හමු නොවීය.

source: Blocklist item added.
si_lk: වාරණ ලැයිස්තු අයිතමය එකතු කරන ලදී.

source: Could not save the blocklist item
si_lk: වාරණ ලැයිස්තු අයිතමය සුරැකීමට නොහැකි විය

source: Blocklist entry removed
si_lk: අවහිර ලැයිස්තු ඇතුළත් කිරීම ඉවත් කරන ලදී

source: Could not remove the blocklist entry
si_lk: අවහිර ලැයිස්තු ඇතුළත් කිරීම ඉවත් කිරීමට නොහැකි විය

source: %s added.
si_lk: %s එකතු කරන ලදී.

source: %s could not be added.
si_lk: %s එකතු කළ නොහැකි විය.

source: Invalid %s.
si_lk: වලංගු නොවන %s.

source: %s deleted.
si_lk: %s මකා දමන ලදී.

source: Use /attributes/restSearch to export RPZ rules.
si_lk: RPZ රීති අපනයනය කිරීමට /attributes/restSearch භාවිතා කරන්න.

source: Use /attributes/restSearch to export flat indicator lists.
si_lk: පැතලි දර්ශක ලැයිස්තු අපනයනය කිරීමට /attributes/restSearch භාවිතා කරන්න.

source: Use MISP modules to import in OpenIOC format.
si_lk: OpenIOC ආකෘතියෙන් ආයාත කිරීමට MISP මොඩියුල භාවිතා කරන්න.

source: Use /events/restSearch to export in CSV format.
si_lk: CSV ආකෘතියෙන් අපනයනය කිරීමට /events/restSearch භාවිතා කරන්න.

source: Use the REST client to refine your search conditions and export in any of the given formats with much more control.
si_lk: ඔබගේ සෙවුම් කොන්දේසි පිරිපහදු කිරීමට සහ ලබා දී ඇති ඕනෑම ආකෘතියකින් අපනයනය කිරීමට REST සේවාලාභියා භාවිතා කරන්න.

source: Use /events/restSearch to export hashes.
si_lk: හැෂ් අපනයනය කිරීමට /events/restSearch භාවිතා කරන්න.

source: Use /events/restSearch to export in the various NIDS formats.
si_lk: විවිධ NIDS ආකෘතිවලින් අපනයනය කිරීමට /events/restSearch භාවිතා කරන්න.

source: Use /events/restSearch to export in STIX format.
si_lk: STIX ආකෘතියෙන් අපනයනය කිරීමට /events/restSearch භාවිතා කරන්න.

source: Use /events/restSearch to export in STIX2 format.
si_lk: STIX2 ආකෘතියෙන් අපනයනය කිරීමට /events/restSearch භාවිතා කරන්න.

source: Use /events/restSearch to export in XML format. It is highly recommended to use JSON whenever possible.
si_lk: XML ආකෘතියෙන් අපනයනය කිරීමට /events/restSearch භාවිතා කරන්න. හැකි සෑම විටම JSON භාවිතා කිරීම බෙහෙවින් නිර්දේශ කෙරේ.

source: API searches are not allowed for this user role.
si_lk: මෙම පරිශීලක භූමිකාව සඳහා API සෙවුම් ඉඩ නොදේ.

source: Rate limit exceeded.
si_lk: අනුපාත සීමාව ඉක්මවා ඇත.

source: The action that the user performed
si_lk: පරිශීලකයා සිදු කළ ක්‍රියාව

source: Is the sharing group selectable (active) when choosing distribution
si_lk: බෙදා හැරීම තෝරාගැනීමේදී බෙදාගැනීමේ කණ්ඩායම තෝරාගත හැකි (ක්‍රියාකාරී) වේ

source: Search for a full or a substring (delimited by % for substrings) in the event info, event tags, attribute tags, attribute values or attribute comment fields
si_lk: සිදුවීම් තොරතුරු, සිදුවීම් ටැග්, උපලක්ෂණ ටැග්, උපලක්ෂණ අගයන් හෝ උපලක්ෂණ විවරණ ක්ෂේත්‍ර තුළ සම්පූර්ණ හෝ උප තන්තුවක් (උප පද සඳහා % කින් සීමා කළ) සොයන්න

source: All organisations contained on the instance will be part of the sharing group
si_lk: නිදසුනෙහි අඩංගු සියලුම සංවිධාන බෙදාගැනීමේ කණ්ඩායමේ කොටසක් වනු ඇත

source: hard-delete already soft-deleted attributes
si_lk: දැනටමත් මෘදු-මකා දැමූ ගුණාංග අමාරුවෙන් මකා දමන්න

source: Maturity of the event
si_lk: සිද්ධියේ පරිණතභාවය

source: Anonymise the information regarding the server on which the request was issued
si_lk: ඉල්ලීම නිකුත් කරන ලද සේවාදායකය පිළිබඳ තොරතුරු නිර්නාමික කරන්න

source: Filter on attribute value
si_lk: ගුණාංග අගය මත පෙරහන් කරන්න

source: The authorisation key found on the external server
si_lk: අවසර යතුර බාහිර සේවාදායකයේ හමු විය

source: The user receive alerts when events are published
si_lk: සිදුවීම් ප්‍රකාශනය කරන විට පරිශීලකයාට ඇඟවීම් ලැබේ

source: The email's body
si_lk: විද්‍යුත් තැපෑලේ ශරීරය

source: The feed is cached
si_lk: සංග්‍රහය හැඹිලිගත කර ඇත

source: A valid x509 certificate
si_lk: වලංගු x509 සහතිකයක්

source: The text contained in the change field
si_lk: වෙනස් කිරීමේ ක්ෂේත්රයේ අඩංගු පෙළ

source: The user will be prompted the change the password
si_lk: මුරපදය වෙනස් කිරීමට පරිශීලකයාගෙන් විමසනු ඇත

source: A valid hexadecimal colour `#ffffff`
si_lk: වලංගු ෂඩ් දශම වර්ණයක් `#ffffff`

source: Contact details for the organisation
si_lk: සංවිධානය සඳහා සම්බන්ධතා විස්තර

source: The user receive alerts from `contact reporter` requests
si_lk: පරිශීලකයාට 'සම්බන්ධතා වාර්තාකරු' ඉල්ලීම් වලින් ඇඟවීම් ලැබේ

source: Base64 encoded file contents
si_lk: Base64 කේතනය කළ ගොනු අන්තර්ගතය

source: The user set date field on the event level. If you are using restSearch, you can use any of the valid time related filters (examples: 7d, timestamps, [14d, 7d] for ranges, etc.)
si_lk: පරිශීලකයා සිදුවීම් මට්ටමින් දින ක්ෂේත්‍රය සකසා ඇත. ඔබ restSearch භාවිතා කරන්නේ නම්, ඔබට වලංගු කාලය සම්බන්ධ ඕනෑම පෙරහන් භාවිතා කළ හැක (උදාහරණ: 7d, වේලා මුද්‍රා, [14d, 7d] පරාසයන් සඳහා, ආදිය)

source: The role is a default role (selected by default)
si_lk: භූමිකාව පෙරනිමි භූමිකාවකි (පෙරනිමියෙන් තෝරා ඇත)

source: Remove file after ingestion
si_lk: ඇතුල් කිරීමෙන් පසු ගොනුව ඉවත් කරන්න

source: Include deleted elements
si_lk: මකා දැමූ අංග ඇතුළත් කරන්න

source: Merge attributes (only add new attribute, remove revoked attributes)
si_lk: ගුණාංග ඒකාබද්ධ කරන්න (නව උපලක්ෂණය පමණක් එක් කරන්න, අවලංගු කළ ගුණාංග ඉවත් කරන්න)

source: Disable the user account
si_lk: පරිශීලක ගිණුම අක්රිය කරන්න

source: Filter on user email
si_lk: පරිශීලක ඊමේල් මත පෙරහන් කරන්න

source: Set the password manually
si_lk: මුරපදය අතින් සකසන්න

source: When uploading malicious samples, set this flag to tell MISP to encrypt the sample and extract the file hashes. This will create a MISP object with the appropriate attributes.
si_lk: අනිෂ්ට සාම්පල උඩුගත කරන විට, නියැදිය සංකේතනය කර ගොනු හැෂ් උපුටා ගන්නා ලෙස MISP හට පැවසීමට මෙම ධජය සකසන්න. මෙය සුදුසු ගුණාංග සහිත MISP වස්තුවක් සාදනු ඇත.

source: Should the warning list be enforced. Adds `blocked` field for matching attributes
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තුව බලාත්මක කළ යුතුද? ගැළපෙන ගුණාංග සඳහා `අවහිර කළ' ක්ෂේත්‍රය එක් කරයි

source: Event id
si_lk: සිදුවීම් id

source: Provide filters on which the sightings should be applied to when fetching attributes to be sighted. Support most parameters exposed in /attributes/restSearch.
si_lk: දැකිය යුතු ගුණාංග ලබා ගැනීමේදී දර්ශන යෙදිය යුතු පෙරහන් සපයන්න. /attributes/restSearch හි නිරාවරණය වන බොහෝ පරාමිති සඳහා සහය වන්න.

source: The timestamp at which the event was last modified
si_lk: සිදුවීම අවසන් වරට වෙනස් කරන ලද වේලා මුද්‍රාව

source: The timestamp at which the attribute was last modified
si_lk: උපලක්ෂණ අවසන් වරට වෙනස් කරන ලද වේලා මුද්‍රාව

source: Quick event description
si_lk: ඉක්මන් සිදුවීම් විස්තරය

source: The tag is exported when synchronising with other instances
si_lk: වෙනත් අවස්ථාවන් සමඟ සමමුහුර්ත කිරීමේදී ටැගය අපනයනය කෙරේ

source: Exclude local tags from the export
si_lk: අපනයනයෙන් දේශීය ටැග් බැහැර කරන්න

source: The organisation have write access to this sharing group (they can add/remove other organisation)
si_lk: සංවිධානයට මෙම බෙදාගැනීමේ කණ්ඩායමට ලිඛිත ප්‍රවේශය ඇත (ඔවුන්ට වෙනත් සංවිධානයක් එක් කිරීමට/ඉවත් කිරීමට හැකිය)

source: An external authorisation is required for this user
si_lk: මෙම පරිශීලකයා සඳහා බාහිර අවසරයක් අවශ්‍ය වේ

source: A valid external auth key
si_lk: වලංගු බාහිර සත්‍යාපන යතුරක්

source: target_event option might be considered
si_lk: target_event විකල්පය සලකා බැලිය හැක

source: The date from which the event was published
si_lk: සිදුවීම ප්‍රකාශයට පත් කළ දිනය

source: Source galaxy cluster UUID
si_lk: මූලාශ්‍ර මන්දාකිණි පොකුරු UUID

source: A valid GPG key
si_lk: වලංගු GPG යතුරක්

source: The event contains proposals
si_lk: උත්සවයේ යෝජනා අඩංගු වේ

source: Headers to be passed with the requests. All separated by `\n`
si_lk: ඉල්ලීම් සමඟ සම්මත කළ යුතු ශීර්ෂයන්. සියල්ල `\nමගින් වෙන් කර ඇත

source: The tag is hidden (not selectable)
si_lk: ටැගය සඟවා ඇත (තෝරා ගත නොහැක)

source: Include matching attributes in the response
si_lk: ප්‍රතිචාරයේ ගැළපෙන ගුණාංග ඇතුළත් කරන්න

source: Include matching events in the response
si_lk: ප්‍රතිචාරයේ ගැළපෙන සිදුවීම් ඇතුළත් කරන්න

source: Include matching eventUuids in the response
si_lk: ප්‍රතිචාරයේ ගැලපෙන eventUuids ඇතුළත් කරන්න

source: Include tags of matching events in the response
si_lk: ප්‍රතිචාරයේ ගැළපෙන සිදුවීම් ටැග් ඇතුළත් කරන්න

source: Include proposals of matching events in the response
si_lk: ප්‍රතිචාරයේ සිදුවීම් ගැළපෙන යෝජනා ඇතුළත් කරන්න

source: Specify whether the source (url field) is a directory (local) or an geniun url (network)
si_lk: මූලාශ්‍රය (url ක්ෂේත්‍රය) නාමාවලියක් (දේශීය) හෝ geniun url (ජාලය) ද යන්න සඳහන් කරන්න.

source: The IP of a login attempt
si_lk: ඇතුල් වීමේ උත්සාහයක IP

source: JSON containing ID, UUID and name
si_lk: ID, UUID සහ නම අඩංගු JSON

source: Events published within the last x amount of time, where x can be defined in days, hours, minutes (for example 5d or 12h or 30m)
si_lk: අවසාන x කාලය තුළ ප්‍රකාශිත සිදුවීම්, x දින, පැය, මිනිත්තු (උදාහරණයක් ලෙස 5d හෝ 12h හෝ 30m) වලින් අර්ථ දැක්විය හැක

source: Limit on the pagination
si_lk: පිටුවෙහි සීමාව

source: If the organisation should have access to this instance, make sure that the Local organisation setting is checked. If you would only like to add a known external organisation for inclusion in sharing groups, uncheck the Local organisation setting.
si_lk: සංවිධානයට මෙම අවස්ථාවට ප්‍රවේශය තිබිය යුතු නම්, ප්‍රාදේශීය සංවිධාන සැකසීම පරීක්ෂා කර ඇති බවට වග බලා ගන්න. බෙදාගැනීමේ කණ්ඩායම්වලට ඇතුළත් කිරීම සඳහා ඔබ දන්නා බාහිර සංවිධානයක් පමණක් එක් කිරීමට කැමති නම්, ප්‍රාදේශීය සංවිධාන සැකසීම් සලකුණු නොකරන්න.

source: The lookup will not be visible in the feed correlation
si_lk: සංග්‍රහ සහසම්බන්ධය තුළ සෙවීම දෘශ්‍යමාන නොවනු ඇත

source: Message to be included
si_lk: ඇතුළත් කළ යුතු පණිවිඩය

source: Will only return the metadata of the given query scope, contained data is omitted.
si_lk: ලබා දී ඇති විමසුම් විෂය පථයේ පාර-දත්ත පමණක් ආපසු ලබා දෙනු ඇත, අඩංගු දත්ත මඟ හැර ඇත.

source: Will only return id, timestamp, published and uuid
si_lk: හැඳුනුම්පත, වේලා මුද්‍රාව, ප්‍රකාශිත සහ uuid පමණක් ආපසු ලබා දෙනු ඇත

source: Mock the query
si_lk: විමසුම සමච්චල් කරන්න

source: The last time the sharing group was modified
si_lk: අවසන් වරට බෙදාගැනීමේ කණ්ඩායම වෙනස් කරන ලදී

source: The news are read
si_lk: ප්‍රවෘත්ති කියවනවා

source: The unique Signature Identification
si_lk: අද්විතීය අත්සන හඳුනාගැනීම

source: Can be either the ORG_ID or the ORG_NAME
si_lk: ORG_ID හෝ ORG_NAME විය හැක

source: Describe the organisation
si_lk: සංවිධානය විස්තර කරන්න

source: Organisation identifier (name)
si_lk: සංවිධාන හැඳුනුම්කාරකය (නම)

source: Globally used uuid of an organisation
si_lk: සංවිධානයක ගෝලීය වශයෙන් භාවිතා වන uuid

source: The IDS flags will be set to off for this feed
si_lk: මෙම සංග්‍රහය සඳහා IDS ධජ අක්‍රිය කිරීමට සකසනු ඇත

source: Page number for the pagination
si_lk: පිටුව සඳහා පිටු අංකය

source: The hardcoded password
si_lk: දෘඪ සංකේත සහිත මුරපදය

source: The name of the feed provider
si_lk: ආහාර සපයන්නාගේ නම

source: The event will be published
si_lk: සිද්ධිය ප්‍රකාශයට පත් කෙරේ

source: Allow the download of events and their attribute from the server
si_lk: සේවාදායකයෙන් සිදුවීම් සහ ඒවායේ ගුණාංග බාගත කිරීමට ඉඩ දෙන්න

source: Allow the upload of events and their attribute to the server
si_lk: සිදුවීම් සහ ඒවායේ ගුණාංග සේවාදායකය වෙත උඩුගත කිරීමට ඉඩ දෙන්න

source: Allow the upload of sightings to the server
si_lk: දර්ශන සේවාදායකය වෙත උඩුගත කිරීමට ඉඩ දෙන්න

source: Destination galaxy cluster UUID
si_lk: ගමනාන්ත මන්දාකිණි පොකුරු UUID

source: The type of the relation. Example: `is`, `related-to`, ...
si_lk: සම්බන්ධතාවයේ වර්ගය. උදාහරණය: `යි`, `සම්බන්ධිත`, ...

source: Concise summary for who this sharing group is releasable to
si_lk: මෙම බෙදාගැනීමේ කණ්ඩායම මුදා හැරිය හැක්කේ කාටද යන්න පිළිබඳ සංක්ෂිප්ත සාරාංශය

source: Pass the event to any connected instance where the sync connection is tied to an organisation contained in the SG organisation list
si_lk: SG සංවිධාන ලැයිස්තුවේ අඩංගු සංවිධානයකට සමමුහුර්ත සම්බන්ධතාවය බැඳී ඇති ඕනෑම සම්බන්ධිත අවස්ථාවකට සිදුවීම ලබා දෙන්න
