Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: Extends Event
si_lk: සිදුවීම දිගු කරයි

source: Import OpenIOC
si_lk: OpenIOC ආනයනය කරන්න

source: Import from MISP Export File
si_lk: MISP අපනයන ගොනුවෙන් ආයාත කරන්න

source: MISP XML or JSON file
si_lk: MISP XML හෝ JSON ගොනුව

source: Take ownership of the event
si_lk: සිදුවීමේ අයිතිය ගන්න

source: Warning: This will change the creator organisation of the event, tampering with the event's ownership and releasability and can lead to unexpected behaviour when synchronising the event with instances that have another creator for the same event.)
si_lk: අවවාදයයි: මෙය සිදුවීමේ නිර්මාතෘ සංවිධානය වෙනස් කරයි, සිද්ධියේ හිමිකාරිත්වය සහ මුදා හැරීමේ හැකියාවට බාධා කරයි සහ එම සිදුවීම සඳහා වෙනත් නිර්මාපකයෙකු සිටින අවස්ථා සමඟ සිදුවීම සමමුහුර්ත කිරීමේදී අනපේක්ෂිත හැසිරීමකට තුඩු දිය හැකිය.)

source: Publish imported events
si_lk: ආනයනික සිදුවීම් ප්‍රකාශ කරන්න

source: Add From MISP Export Result
si_lk: MISP අපනයන ප්‍රතිඵලයෙන් එක් කරන්න

source: Details
si_lk: විස්තර

source: Failed
si_lk: අසාර්ථකයි

source: Event created.
si_lk: සිදුවීම නිර්මාණය කරන ලදී.

source: Event with this UUID already exists.
si_lk: මෙම UUID සමඟ සිදුවීම දැනටමත් පවතී.

source: Event
si_lk: සිදුවීම

source: Check out the OpenAPI spec of the MISP Automation API <a href="%s">here</a>.
si_lk: MISP Automation API <a href="%s">හි OpenAPI පිරිවිතර මෙතැනින්</a>බලන්න.

source: Automation functionality is designed to automatically feed other tools and systems with the data in your MISP repository. To to make this functionality available for automated tools an authentication key is used.
si_lk: ස්වයංක්‍රීය ක්‍රියාකාරීත්වය සැලසුම් කර ඇත්තේ ඔබගේ MISP ගබඩාවේ ඇති දත්ත සමඟින් වෙනත් මෙවලම් සහ පද්ධති ස්වයංක්‍රීයව පෝෂණය කිරීමටය. ස්වයංක්‍රීය මෙවලම් සඳහා මෙම ක්‍රියාකාරීත්වය ලබා දීමට සත්‍යාපන යතුරක් භාවිත කෙරේ.

source: You can use the <a href="
si_lk: <html>ඔබට භාවිතා කළ හැකිය

source: Make sure you keep your API key secret as it gives access to the all of the data that you normally have access to in MISP.
si_lk: MISP හි ඔබට සාමාන්‍යයෙන් ප්‍රවේශය ඇති සියලුම දත්ත වෙත ප්‍රවේශය ලබා දෙන බැවින් ඔබේ API යතුර රහසිගතව තබා ගැනීමට වග බලා ගන්න.

source: To view the old MISP automation page, click <a href="
si_lk: <html>පැරණි MISP ස්වයංක්‍රීයකරණ පිටුව බැලීමට, ක්ලික් කරන්න

source: Your current key is: <code>%s</code>. You can %s this key.
si_lk: ඔබගේ වත්මන් යතුර: <code>%s</code>. ඔබට මෙම යතුර %s කළ හැක.

source: reset
si_lk: යළි පිහිටුවන්න

source: You can view and manage your API keys under your profile, found %s
si_lk: ඔබට ඔබගේ පැතිකඩ යටතේ ඔබගේ API යතුරු බැලීම සහ කළමනාකරණය කළ හැක, %sහමු විය

source: It is possible to search the database for attributes based on a list of criteria.
si_lk: නිර්ණායක ලැයිස්තුවක් මත පදනම්ව ගුණාංග සඳහා දත්ත සමුදාය සෙවිය හැකිය.

source: To return an event or a list of events in a desired format, use the following syntax
si_lk: සිදුවීමක් හෝ සිදුවීම් ලැයිස්තුවක් අපේක්ෂිත ආකෘතියකින් ආපසු ලබා දීමට, පහත වාක්‍ය ඛණ්ඩය භාවිතා කරන්න

source: Whilst a list of parameters is provided below, it isn't necessarily exhaustive, specific export formats could have additional parameters.
si_lk: පරාමිති ලැයිස්තුවක් පහත සපයා ඇති අතර, එය අනිවාර්යයෙන්ම සම්පූර්ණ නොවේ, නිශ්චිත අපනයන ආකෘති වලට අමතර පරාමිතීන් තිබිය හැක.

source: Set the return format of the search (Currently supported: json, xml, openioc, suricata, snort - more formats are being moved to restSearch with the goal being that all searches happen through this API). Can be passed as the first parameter after restSearch or via the JSON payload.
si_lk: සෙවුමේ ආපසු ආකෘතිය සකසන්න (දැනට සහය දක්වයි: json, xml, openioc, suricata, snort - මෙම API හරහා සියලු සෙවීම් සිදු වන ඉලක්කය සමඟ තවත් ආකෘති restSearch වෙත ගෙන යමින් පවතී). විවේක සෙවීමෙන් පසුව හෝ JSON ගෙවීම හරහා පළමු පරාමිතිය ලෙස සම්මත කළ හැක.

source: Limit the number of results returned, depending on the scope (for example 10 attributes or 10 full events).
si_lk: විෂය පථය මත පදනම්ව ආපසු ලබා දෙන ප්‍රතිඵල ගණන සීමා කරන්න (උදාහරණයක් ලෙස ගුණාංග 10ක් හෝ සම්පූර්ණ සිදුවීම් 10ක්).

source: If a limit is set, sets the page to be returned. page 3, limit 100 will return records 201->300).
si_lk: සීමාවක් සකසා ඇත්නම්, ආපසු ලබා දිය යුතු පිටුව සකසයි. පිටුව 3, සීමාව 100 වාර්තා 201->300 ලබා දෙනු ඇත).

source: Search for the given value in the attributes' value field.
si_lk: ගුණාංගවල අගය ක්ෂේත්‍රයේ දී ඇති අගය සොයන්න.

source: The attribute type, any valid MISP attribute type is accepted.
si_lk: උපලක්ෂණ වර්ගය, ඕනෑම වලංගු MISP උපලක්ෂණ වර්ගයක් පිළිගනු ලැබේ.

source: The attribute category, any valid MISP attribute category is accepted.
si_lk: ගුණාංග කාණ්ඩය, ඕනෑම වලංගු MISP ගුණාංග කාණ්ඩයක් පිළිගනු ලැබේ.

source: Search by the creator organisation by supplying the organisation identifier.
si_lk: ආයතන හැඳුනුම්කාරකය සැපයීම මගින් නිර්මාපක සංවිධානය විසින් සොයන්න.

source: To include a tag in the results just write its names into this parameter. To exclude a tag prepend it with a '!'.
si_lk: ප්‍රතිඵලවලට ටැගයක් ඇතුළත් කිරීමට එහි නම් මෙම පරාමිතියට ලියන්න. ටැගයක් බැහැර කිරීම සඳහා එය '!' සමඟින් පෙරන්න.

source: Enabling this (by passing "1" as the argument) will make the search ignore all of the other arguments, except for the auth key and value. MISP will return an xml / json (depending on the header sent) of all events that have a sub-string match on value in the event info, event orgc, or any of the attribute value1 / value2 fields, or in the attribute comment.
si_lk: මෙය සක්‍රීය කිරීමෙන් (තර්කය ලෙස "1" සම්මත කිරීමෙන්) සෙවීම සත්‍යාපන යතුර සහ අගය හැර අනෙකුත් සියලුම තර්ක නොසලකා හරිනු ඇත. MISP විසින් සිද්ධි තොරතුරු, සිද්ධි orgc, හෝ උපලක්ෂණ අගය1 / value2 ක්ෂේත්‍රවල, හෝ උපලක්ෂණ විවරණයෙහි අගය මත උප තන්තු ගැළපීමක් ඇති සියලුම සිදුවීම්වල xml / json (යවන ලද ශීර්ෂය මත පදනම්ව) ආපසු ලබා දෙනු ඇත.

source: Events with the date set to a date after the one specified in the from field (format: 2015-02-15). This filter will use the date of the event.
si_lk: සිට ක්‍ෂේත්‍රයේ නිශ්චිතව දක්වා ඇති දිනයට පසු දිනයක් නියම කර ඇති සිදුවීම් (ආකෘතිය: 2015-02-15). මෙම පෙරහන සිදුවීමේ දිනය භාවිතා කරනු ඇත.

source: Events with the date set to a date before the one specified in the to field (format: 2015-02-15). This filter will use the date of the event.
si_lk: ක්ෂේත්‍රයේ දක්වා ඇති දිනයට පෙර දිනයට සකසන ලද සිදුවීම් (ආකෘතිය: 2015-02-15). මෙම පෙරහන සිදුවීමේ දිනය භාවිතා කරනු ඇත.

source: The events that should be included / excluded from the search
si_lk: සෙවීමට ඇතුළත් කළ යුතු / බැහැර කළ යුතු සිදුවීම්

source: If set, encodes the attachments / zipped malware samples as base64 in the data field within each attribute
si_lk: සකසා ඇත්නම්, එක් එක් ගුණාංගය තුළ දත්ත ක්ෂේත්‍රයේ ඇමුණුම් / සිප් කළ අනිෂ්ට මෘදුකාංග සාම්පල base64 ලෙස කේතනය කරයි

source: Only the metadata (event, tags, relations) is returned, attributes and proposals are omitted.
si_lk: පාර-දත්ත (සිදුවීම, ටැග්, සම්බන්ධතා) පමණක් ආපසු ලබා දෙනු ලැබේ, ගුණාංග සහ යෝජනා මඟ හරිනු ලැබේ.

source: Restrict the results by uuid.
si_lk: uuid මගින් ප්‍රතිඵල සීමා කරන්න.

source: Restrict the results by the timestamp of the last publishing of the event. The input can be a timetamp or a short-hand time description (7d or 24h for example). You can also pass a list with two values to set a time range (for example ["14d", "7d"]).
si_lk: සිදුවීමේ අවසාන ප්‍රකාශනයේ වේලා මුද්‍රාව මගින් ප්‍රතිඵල සීමා කරන්න. ආදානය කාලසටහනක් හෝ කෙටි කාල විස්තරයක් විය හැකිය (උදාහරණයක් ලෙස 7d හෝ 24h). ඔබට කාල පරාසයක් සැකසීමට අගයන් දෙකක් සහිත ලැයිස්තුවක් ද සම්මත කළ හැක (උදාහරණයක් ලෙස ["14d", "7d"]).

source: (Deprecated synonym for publish_timestamp) Restrict the results by the timestamp of the last publishing of the event. The input can be a timetamp or a short-hand time description (7d or 24h for example). You can also pass a list with two values to set a time range (for example ["14d", "7d"]).
si_lk: (ප්‍රකාශන_කාලමුද්‍රාව සඳහා සමාන පදය අත්හරින ලදී) සිදුවීමේ අවසාන ප්‍රකාශනයේ වේලා මුද්‍රාව මගින් ප්‍රතිඵල සීමා කරන්න. ආදානය කාලසටහනක් හෝ කෙටි කාල විස්තරයක් විය හැකිය (උදාහරණයක් ලෙස 7d හෝ 24h). ඔබට කාල පරාසයක් සැකසීමට අගයන් දෙකක් සහිත ලැයිස්තුවක් ද සම්මත කළ හැක (උදාහරණයක් ලෙස ["14d", "7d"]).

source: Restrict the results by the timestamp (last edit). Any event with a timestamp newer than the given timestamp will be returned. In case you are dealing with /attributes as scope, the attribute's timestamp will be used for the lookup. The input can be a timetamp or a short-hand time description (7d or 24h for example). You can also pass a list with two values to set a time range (for example ["14d", "7d"]).
si_lk: කාල මුද්‍රාව මගින් ප්‍රතිඵල සීමා කරන්න (අවසන් සංස්කරණය). ලබා දී ඇති වේලා මුද්‍රාවට වඩා අලුත් වේලා මුද්‍රාවක් සහිත ඕනෑම සිදුවීමක් ආපසු ලබා දෙනු ඇත. ඔබ විෂය පථය ලෙස /ගුණාංග සමඟ කටයුතු කරන්නේ නම්, උපලක්ෂණයේ වේලා මුද්‍රාව සෙවීම සඳහා භාවිතා කරනු ඇත. ආදානය කාලසටහනක් හෝ කෙටි කාල විස්තරයක් විය හැකිය (උදාහරණයක් ලෙස 7d හෝ 24h). ඔබට කාල පරාසයක් සැකසීමට අගයන් දෙකක් සහිත ලැයිස්තුවක් ද සම්මත කළ හැක (උදාහරණයක් ලෙස ["14d", "7d"]).

source: Set whether published or unpublished events should be returned. Do not set the parameter if you want both.
si_lk: ප්‍රකාශිත හෝ ප්‍රකාශනය නොකළ සිදුවීම් ආපසු දිය යුතුද යන්න සකසන්න. ඔබට දෙකම අවශ්ය නම් පරාමිතිය සකස් නොකරන්න.

source: Remove any attributes from the result that would cause a hit on a warninglist entry.
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තු ප්‍රවේශයක පහරක් ඇති කරන ප්‍රතිඵලයෙන් යම් ගුණාංග ඉවත් කරන්න.

source: By default (0) all attributes are returned that match the other filter parameters, irregardless of their to_ids setting. To restrict the returned data set to to_ids only attributes set this parameter to 1. You can only use the special "exclude" setting to only return attributes that have the to_ids flag disabled.
si_lk: පෙරනිමියෙන් (0) to_ids සිටුවම් නොතකා, අනෙකුත් පෙරහන් පරාමිතිවලට ගැළපෙන සියලුම ගුණාංග ආපසු ලබා දෙනු ලැබේ. ආපසු ලබා දුන් දත්ත to_ids පමණක් උපලක්ෂණ වලට සීමා කිරීම සඳහා මෙම පරාමිතිය 1 ලෙස සකසන්න. ඔබට භාවිතා කළ හැක්කේ to_ids ධජය අක්‍රිය කර ඇති උපලක්ෂණ පමණක් ආපසු ලබා දීමට විශේෂ "බැහැර" සැකසීම පමණි.

source: Default value 0. If set to 1, only soft-deleted attributes will be returned. If set to [0,1] , both deleted and non-deleted attributes wil be returned.
si_lk: මෙම පරාමිතිය 1 ලෙස සකසා ඇත්නම්, එය සක්‍රිය ඒවා සමඟ මෘදු-මකා දැමූ ගුණාංග ලබා දෙනු ඇත. පරාමිතියක් ලෙස "පමණක්" භාවිතා කිරීමෙන් එය ආපසු ලබා දෙන දත්ත කට්ටලය මෘදු-මකා දැමූ දත්ත වලට පමණක් සීමා කරයි.

source: Instead of just including the event ID, also include the event UUID in each of the attributes.
si_lk: සිදුවීම් හැඳුනුම්පත ඇතුළත් කිරීම වෙනුවට, එක් එක් ගුණාංගයන් තුළ සිදුවීම් UUID ද ඇතුළත් කරන්න.

source: Only return attributes from events that have received a modification after the given timestamp. The input can be a timetamp or a short-hand time description (7d or 24h for example). You can also pass a list with two values to set a time range (for example ["14d", "7d"]).
si_lk: ලබා දී ඇති වේලා මුද්‍රාවෙන් පසුව වෙනස් කිරීමක් ලැබුණු සිදුවීම්වලින් පමණක් උපලක්ෂණ ආපසු ලබා දෙන්න. ආදානය කාලසටහනක් හෝ කෙටි කාල විස්තරයක් විය හැකිය (උදාහරණයක් ලෙස 7d හෝ 24h). ඔබට කාල පරාසයක් සැකසීමට අගයන් දෙකක් සහිත ලැයිස්තුවක් ද සම්මත කළ හැක (උදාහරණයක් ලෙස ["14d", "7d"]).

source: If this flag is set, sharing group objects will not be included, instead only the sharing group ID is set.
si_lk: මෙම ධජය සකසා ඇත්නම්, කණ්ඩායම් වස්තු බෙදාගැනීම ඇතුළත් නොවනු ඇත, ඒ වෙනුවට බෙදාගැනීමේ කණ්ඩායම් හැඳුනුම්පත පමණක් සකසා ඇත.

source: Filter on the event's info field.
si_lk: සිදුවීමේ තොරතුරු ක්ෂේත්‍රයේ පෙරහන් කරන්න.

source: Search for a full or a substring (delimited by % for substrings) in the event info, event tags, attribute tags, attribute values or attribute comment fields.
si_lk: සිදුවීම් තොරතුරු, සිදුවීම් ටැග්, උපලක්ෂණ ටැග්, උපලක්ෂණ අගයන් හෝ උපලක්ෂණ විවරණ ක්ෂේත්‍ර තුළ සම්පූර්ණ හෝ උප තන්තුවක් (උප පද සඳහා % කින් සීමා කළ) සොයන්න.

source: Select the ATT&CK matrix like galaxy to use when using returnFormat = attack. Defaults to the Mitre ATT&CK library via mitre-attack-pattern.
si_lk: returnFormat = attack භාවිතා කරන විට භාවිතා කිරීමට galaxy වැනි ATT&CK matrix තෝරන්න. mitre-attack-pattern හරහා Miter ATT&CK පුස්තකාලයට පෙරනිමි.

source: To export all attributes of types ip-src and ip-dst that have a TLP marking and are not marked TLP:red, use the syntax below. String searches are by default exact lookups, but you can use mysql style "%" wildcards to do substring searches.
si_lk: TLP ලකුණු කිරීමක් ඇති සහ TLP:රතු ලෙස සලකුණු නොකළ ip-src සහ ip-dst වර්ගවල සියලුම ගුණාංග අපනයනය කිරීමට, පහත වාක්‍ය ඛණ්ඩය භාවිතා කරන්න. තන්තු සෙවුම් පෙරනිමියෙන් නිවැරදි සෙවීම් වේ, නමුත් ඔබට උපස්ථර සෙවීම් කිරීමට mysql style "%" Wildcards භාවිතා කළ හැක.

source: It is possible to search the database for galaxy clustesrs based on a list of criteria.
si_lk: නිර්ණායක ලැයිස්තුවක් මත පදනම්ව මන්දාකිණි පොකුරු සඳහා දත්ත සමුදාය සෙවිය හැකිය.

source: To return an cluster or a list of clusters in the JSON format, use the following syntax
si_lk: JSON ආකෘතියෙන් පොකුරක් හෝ පොකුරු ලැයිස්තුවක් ආපසු ලබා දීමට, පහත සින්ටැක්ස් භාවිතා කරන්න

source: Whilst a list of parameters is provided below, it isn't necessarily exhaustive
si_lk: පරාමිති ලැයිස්තුවක් පහත දක්වා ඇති අතර, එය අනිවාර්යයෙන්ම සම්පූර්ණ නොවේ

source: Limit the number of results returned, depending on the scope (for example 10 clusters).
si_lk: විෂය පථය මත පදනම්ව ආපසු ලැබෙන ප්‍රතිඵල ගණන සීමා කරන්න (උදාහරණයක් ලෙස පොකුරු 10).

source: Specify the exact local ID the be returned
si_lk: ආපසු ලබා දිය යුතු නිශ්චිත දේශීය හැඳුනුම්පත සඳහන් කරන්න

source: Specify the exact local UUID the be returned
si_lk: ආපසු ලබා දිය යුතු නිශ්චිත දේශීය UUID සඳහන් කරන්න

source: Specify the exact local ID of the galaxy containing all the clusters the be returned
si_lk: ආපසු ලබා දිය යුතු සියලුම පොකුරු අඩංගු මන්දාකිනියේ නිශ්චිත දේශීය ID සඳහන් කරන්න

source: Specify the exact local UUID of the galaxy containing all the clusters the be returned
si_lk: ආපසු ලබා දිය යුතු සියලුම පොකුරු අඩංගු මන්දාකිනියේ නිශ්චිත දේශීය UUID සඳහන් කරන්න

source: Specify the publication state of the clusters to be returned
si_lk: ආපසු ලබා දිය යුතු පොකුරුවල ප්‍රකාශන තත්ත්වය සඳහන් කරන්න

source: Specify the value of the clusters to be returned
si_lk: ආපසු ලබා දිය යුතු පොකුරු වල අගය සඳහන් කරන්න

source: Specify the UUID of the cluster that was forked by the returned clusters
si_lk: ආපසු ලබා දුන් පොකුරු මගින් දෙබල කරන ලද පොකුරේ UUID සඳහන් කරන්න

source: Specify the version of the cluster that was forked by the returned clusters
si_lk: ආපසු ලබා දුන් පොකුරු මගින් දෙබල කරන ලද පොකුරේ අනුවාදය සඳහන් කරන්න

source: Specify the version to be returned
si_lk: ආපසු ලබා දිය යුතු අනුවාදය සඳහන් කරන්න

source: Specify the distribution to be returned
si_lk: ආපසු ලබා දිය යුතු බෙදා හැරීම සඳහන් කරන්න

source: Specify the org_id to get all clusters belonging to this organisation.
si_lk: මෙම සංවිධානයට අයත් සියලුම පොකුරු ලබා ගැනීමට org_id සඳහන් කරන්න.

source: Specify the orgc_id to get all clusters that were created by this organisation.
si_lk: මෙම සංවිධානය විසින් නිර්මාණය කරන ලද සියලුම පොකුරු ලබා ගැනීමට orgc_id සඳහන් කරන්න.

source: Specify the tag name of the cluster to be returned
si_lk: ආපසු ලබා දිය යුතු පොකුරේ ටැග් නම සඳහන් කරන්න

source: Specify if custom, default or both clusters should be returned
si_lk: අභිරුචි, පෙරනිමි හෝ පොකුරු දෙකම ආපසු ලබා දිය යුතුද යන්න සඳහන් කරන්න

source: Only return the UUID and the version of the returned clusters
si_lk: UUID සහ ආපසු ලබා දුන් පොකුරු අනුවාදය පමණක් ආපසු ලබා දෙන්න

source: CSV specific parameters for the restSearch APIs
si_lk: restSearch API සඳහා CSV විශේෂිත පරාමිති

source: CSV only, select the fields that you wish to include in the CSV export. By setting event level fields additionally, includeContext is not required to get event metadata.
si_lk: CSV පමණක්, ඔබ CSV අපනයනයට ඇතුළත් කිරීමට බලාපොරොත්තු වන ක්ෂේත්‍ර තෝරන්න. සිදුවීම් මට්ටමේ ක්ෂේත්‍ර අතිරේකව සැකසීමෙන්, සිදුවීම් පාර-දත්ත ලබා ගැනීමට ඇතුළත් සන්දර්භය අවශ්‍ය නොවේ.

source: CSV only, add additional event level data to the export. The additional fields can be added via requested_attributes too with more granularity.
si_lk: CSV පමණක්, අපනයනයට අමතර සිදුවීම් මට්ටමේ දත්ත එක් කරන්න. අමතර ක්ෂේත්‍ර ඉල්ලුම් කළ_උපරික්ෂණ හරහාද වැඩි කැටිති සහිතව එක් කළ හැක.

source: The CSV created when this setting is set to true will not contain the header row.
si_lk: මෙම සැකසුම සත්‍ය ලෙස සකසා ඇති විට සාදන ලද CSV හි ශීර්ෂ පේළිය අඩංගු නොවේ.

source: URL parameters
si_lk: URL පරාමිති

source: It is also possible to pass all of the above parameters via URL parameters, however this is HIGHLY discouraged. If you however have no other options, simply pass the parameters in the following fashion:
si_lk: ඉහත පරාමිති සියල්ල URL පරාමිති හරහා සම්මත කිරීමට ද හැකිය, කෙසේ වෙතත් මෙය බෙහෙවින් අධෛර්යමත් වේ. කෙසේ වෙතත් ඔබට වෙනත් විකල්ප නොමැති නම්, පහත දැක්වෙන ආකාරයෙන් පරාමිතීන් සම්මත කරන්න:

source: As you can see above, "||" can be used to add more values to a "list" and all parameters are passed as key:value components to the URL. Keep in mind, certain special characters in URLs can cause issues, your searches may end up being leaked to logs in transit and there are length limitations to take into account. Use this as a last resort.
si_lk: ඉහත ඔබට පෙනෙන පරිදි, "||" "ලැයිස්තුවක්" වෙත තවත් අගයන් එක් කිරීමට භාවිතා කළ හැකි අතර සියලුම පරාමිති URL වෙත යතුර:අගය සංරචක ලෙස යවනු ලැබේ. මතක තබා ගන්න, URL වල ඇති ඇතැම් විශේෂ අක්ෂර ගැටළු ඇති කළ හැක, ඔබගේ සෙවීම් ගමනාගමනයේ ලොග් වෙත කාන්දු වීම අවසන් විය හැකි අතර සැලකිල්ලට ගත යුතු දිග සීමාවන් ඇත. මෙය අවසාන විසඳුම ලෙස භාවිතා කරන්න.

source: RPZ specific parameters for the restSearch APIs
si_lk: restSearch API සඳහා RPZ විශේෂිත පරාමිති

source: >You can export RPZ zone files for DNS level firewalling by using the RPZ export functionality of MISP. The file generated will include all of the IDS flagged domain, hostname and IP-src/IP-dst attribute values that you have access to.
si_lk: MISP හි RPZ අපනයන ක්‍රියාකාරිත්වය භාවිතා කිරීමෙන් ඔබට DNS මට්ටමේ ෆයර්වෝලින් සඳහා RPZ කලාප ගොනු අපනයනය කළ හැක. උත්පාදනය කරන ලද ගොනුවේ IDS සලකුණු කළ වසම, සත්කාරක නාමය සහ ඔබට ප්‍රවේශය ඇති IP-src/IP-dst ගුණාංග අගයන් ඇතුළත් වේ.

source: MISP will inject header values into the zone file as well as define the action taken for each of the values that can all be overriden. By default these values are either the default values shipped with the application, or ones that are overriden by your site administrator. The values are as follows
si_lk: MISP විසින් කලාප ගොනුවට ශීර්ෂ අගයන් එන්නත් කරන අතරම සියල්ල අභිබවා යා හැකි එක් එක් අගයන් සඳහා ගන්නා ක්‍රියාමාර්ග නිර්වචනය කරයි. පෙරනිමියෙන් මෙම අගයන් යෙදුම සමඟ නැව්ගත කරන ලද පෙරනිමි අගයන් හෝ ඔබේ අඩවි පරිපාලක විසින් අභිබවා යන ඒවා වේ. අගයන් පහත පරිදි වේ

source: To override the above values, either use the url parameters as described below
si_lk: ඉහත අගයන් අභිබවා යාමට, එක්කෝ පහත විස්තර කර ඇති පරිදි url පරාමිති භාවිතා කරන්න

source: or POST an XML or JSON object with the above listed options
si_lk: හෝ ඉහත ලැයිස්තුගත කර ඇති විකල්ප සමඟ XML හෝ JSON වස්තුවක් පළ කරන්න

source: Bro IDS export
si_lk: Bro IDS අපනයනය

source: An export of all attributes of a specific bro type to a formatted plain text file. By default only published and IDS flagged attributes are exported.
si_lk: නිශ්චිත බ්‍රෝ වර්ගයක සියලුම ගුණාංග ආකෘතිගත සරල පෙළ ගොනුවකට අපනයනය කිරීම. පෙරනිමියෙන් පමණක් ප්‍රකාශිත සහ IDS සලකුණු කළ උපලක්ෂණ අපනයනය කෙරේ.

source: You can configure your tools to automatically download a file one of the Bro types.
si_lk: බ්‍රෝ වර්ගයේ ගොනුවක් ස්වයංක්‍රීයව බාගැනීමට ඔබට ඔබේ මෙවලම් වින්‍යාසගත කළ හැක.

source: To restrict the results by tags, use the usual syntax. Please be aware the colons (:) cannot be used in the tag search. Use semicolons instead (the search will automatically search for colons instead). To get ip values from events tagged tag1 but not tag2 use
si_lk: ටැග් මගින් ප්‍රතිඵල සීමා කිරීමට, සාමාන්‍ය වාක්‍ය ඛණ්ඩය භාවිතා කරන්න. ටැග් සෙවීමේදී තීරු (:) භාවිතා කළ නොහැකි බව කරුණාවෙන් සලකන්න. ඒ වෙනුවට semicolons භාවිතා කරන්න (සෙවීම ස්වයංක්‍රීයව ඒ වෙනුවට colon සඳහා සොයනු ඇත). tag1 ටැග් කර ඇති නමුත් tag2 භාවිතා නොකරන සිදුවීම් වලින් ip අගයන් ලබා ගැනීමට

source: It is possible to restrict the bro exports on based on a set of filters. POST a JSON object or an XML at the Bro API to filter the results.
si_lk: පෙරහන් කට්ටලයක් මත පදනම්ව බ්‍රෝ අපනයන සීමා කළ හැකිය. ප්‍රතිඵල පෙරීමට Bro API හි JSON වස්තුවක් හෝ XML එකක් පළ කරන්න.

source: Alternatively, it is also possible to pass the filters via the parameters in the URL, though it is highly advised to use POST requests with JSON objects instead. The format is as described below
si_lk: විකල්පයක් ලෙස, ඒ වෙනුවට JSON වස්තු සමඟ POST ඉල්ලීම් භාවිතා කිරීමට බෙහෙවින් උපදෙස් දෙනු ලැබුවද, URL හි ඇති පරාමිති හරහා පෙරහන් යැවීමටද හැකිය. ආකෘතිය පහත විස්තර කර ඇත

source: The Bro type, any valid Bro type is accepted. The mapping between Bro and MISP types is as follows
si_lk: Bro වර්ගය, ඕනෑම වලංගු Bro වර්ගයක් පිළිගනු ලැබේ. Bro සහ MISP වර්ග අතර සිතියම්ගත කිරීම පහත පරිදි වේ

source: To include a tag in the results just write its names into this parameter. To exclude a tag prepend it with a '!'. You can also chain several tag commands together with the '&amp;&amp;' operator. Please be aware the colons (:) cannot be used in the tag search. Use semicolons instead (the search will automatically search for colons instead).
si_lk: ප්‍රතිඵලවලට ටැගයක් ඇතුළත් කිරීමට එහි නම් මෙම පරාමිතියට ලියන්න. ටැගයක් බැහැර කිරීම සඳහා එය '!' සමඟින් පෙරන්න. ඔබට '&amp;&amp;' ක්‍රියාකරු සමඟ ටැග් විධාන කිහිපයක් දාමගත කළ හැක. ටැග් සෙවීමේදී තීරු (:) භාවිතා කළ නොහැකි බව කරුණාවෙන් සලකන්න. ඒ වෙනුවට අර්ධ කෝල භාවිතා කරන්න (සෙවීම ස්වයංක්‍රීයව ඒ වෙනුවට තීරු සඳහා සොයනු ඇත).

source: Restrict the results to the given event IDs.
si_lk: ලබා දී ඇති සිදුවීම් ID වලට ප්‍රතිඵල සීමා කරන්න.

source: Allow attributes to be exported that are not marked as "to_ids".
si_lk: "to_ids" ලෙස සලකුණු නොකළ ගුණාංග නිර්යාත කිරීමට ඉඩ දෙන්න.

source: Events published within the last x amount of time, where x can be defined in days, hours, minutes (for example 5d or 12h or 30m). This filter will use the published timestamp of the event.
si_lk: අවසාන x කාලය තුළ ප්‍රකාශිත සිදුවීම්, x දින, පැය, මිනිත්තු (උදාහරණයක් ලෙස 5d හෝ 12h හෝ 30m) වලින් අර්ථ දැක්විය හැක. මෙම පෙරහන සිදුවීමේ ප්‍රකාශිත වේලා මුද්‍රාව භාවිත කරනු ඇත.

source: All attributes that have a hit on a warninglist will be excluded.
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තුවක පහරක් ඇති සියලුම ගුණාංග බැහැර කරනු ලැබේ.

source: The keywords false or null should be used for optional empty parameters in the URL.
si_lk: URL හි විකල්ප හිස් පරාමිති සඳහා අසත්‍ය හෝ ශුන්‍ය මූල පද භාවිතා කළ යුතුය.

source: For example, to retrieve all attributes for event #5, including non IDS marked attributes too, use the following line
si_lk: උදාහරණයක් ලෙස, IDS සලකුණු නොකළ උපලක්ෂණ ද ඇතුළුව #5 ඉසව්ව සඳහා සියලුම ගුණාංග ලබා ගැනීමට, පහත පේළිය භාවිතා කරන්න

source: Export attributes of event with specified type as XML
si_lk: XML ලෙස නිශ්චිත වර්ගය සමඟ සිදුවීමේ ගුණාංග අපනයනය කරන්න

source: If you want to export all attributes of a pre-defined type that belong to an event, use the following syntax
si_lk: ඔබට සිදුවීමකට අයත් පෙර-නිර්චිත වර්ගයක සියලුම ගුණාංග නිර්යාත කිරීමට අවශ්‍ය නම්, පහත වාක්‍ය ඛණ්ඩය භාවිතා කරන්න

source: sigOnly is an optional flag that will block all attributes from being exported that don't have the IDS flag turned on. It is possible to search for several types with the '&amp;&amp;' operator and to exclude values with the '!' operator. For example, to get all IDS signature attributes of type md5 and sha256, but not filename|md5 and filename|sha256 from event 25, use the following
si_lk: sigOnly යනු IDS ධජය සක්‍රිය කර නොමැති සියලුම ගුණාංග නිර්යාත කිරීමෙන් අවහිර කරන විකල්ප ධජයකි. '&amp;&amp;' ක්‍රියාකරු සමඟ වර්ග කිහිපයක් සෙවීමට සහ '!' සමඟ අගයන් බැහැර කිරීමට හැකිය. ක්රියාකරු. උදාහරණයක් ලෙස, md5 සහ sha256 වර්ගයේ සියලුම IDS අත්සන ගුණාංග ලබා ගැනීමට, නමුත් ගොනු නාමය|md5 සහ ගොනු නාමය|sha256 නොවන සිදුවීම 25 වෙතින්, පහත සඳහන් භාවිතා කරන්න

source: Download attachment or malware sample
si_lk: ඇමුණුම හෝ අනිෂ්ට මෘදුකාංග සාම්පල බාගන්න
