Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: Each entry in the log happens during an action, such as the creation, modification or deletion of data and some special actions (such as accepting a proposal). This field shows which action caused the entry to be created.
si_lk: ලොගයේ සෑම ඇතුල්වීමක්ම සිදුවන්නේ දත්ත නිර්මාණය කිරීම, වෙනස් කිරීම හෝ මකා දැමීම සහ සමහර විශේෂ ක්‍රියා (යෝජනාවක් පිළිගැනීම වැනි) වැනි ක්‍රියාවක් අතරතුරදීය. මෙම ක්ෂේත්‍රය ප්‍රවේශය නිර්මාණය කිරීමට හේතු වූ ක්‍රියාව පෙන්වයි.

source: As described above, a log entry is generated on certain actions. This field shows which type of data was affected that caused the log entry to be created (such as a change to the event, the creation of an attribute, the discarding of a proposal, etc).
si_lk: ඉහත විස්තර කර ඇති පරිදි, ඇතැම් ක්‍රියාවන් මත ලොග් ප්‍රවේශයක් ජනනය වේ. මෙම ක්ෂේත්‍රය මඟින් ලොග් ප්‍රවේශය නිර්මාණය කිරීමට බලපෑ කුමන ආකාරයේ දත්තද යන්න පෙන්වයි (සිද්ධිය වෙනස් කිරීම, උපලක්ෂණයක් නිර්මාණය කිරීම, යෝජනාවක් ඉවත දැමීම යනාදිය).

source: This is a short description of the change itself and it is not nearly as detailed as the information administrators get in the audit logs. However, for attributes and proposals the category / type and value of the created or edited attribute is shown.
si_lk: මෙය වෙනස් කිරීම පිළිබඳ කෙටි විස්තරයක් වන අතර එය විගණන ලොගවල තොරතුරු පරිපාලකයින් ලබා ගන්නා තරම් සවිස්තරාත්මක නොවේ. කෙසේ වෙතත්, උපලක්ෂණ සහ යෝජනා සඳහා සාදන ලද හෝ සංස්කරණය කරන ලද ගුණාංගයේ ප්‍රවර්ගය / වර්ගය සහ අගය පෙන්වනු ලැබේ.

source: The date and time of the log entrys' creation.
si_lk: ලොග් සටහන් නිර්මාණය කළ දිනය සහ වේලාව.

source: Listing all attributes
si_lk: සියලු ගුණාංග ලැයිස්තුගත කිරීම

source: Apart from having a list of all the events, it is also possible to get a list of all the stored attributes in the system by clicking on the list attributes button. The produced list of attributes will include the followings fields
si_lk: සියලුම සිදුවීම් ලැයිස්තුවක් තිබීමට අමතරව, ලැයිස්තු ගුණාංග බොත්තම ක්ලික් කිරීමෙන් පද්ධතියේ ගබඩා කර ඇති සියලුම ගුණාංග ලැයිස්තුවක් ලබා ගත හැකිය. නිෂ්පාදනය කරන ලද ගුණාංග ලැයිස්තුවට පහත ක්ෂේත්‍ර ඇතුළත් වේ

source: Use the buttons to the right to view the event that this attribute belongs to or to modify/delete the attribute.
si_lk: මෙම ගුණාංගය අයත් වන සිදුවීම බැලීමට හෝ උපලක්ෂණ වෙනස් කිරීමට/මකා දැමීමට දකුණු පස ඇති බොත්තම් භාවිතා කරන්න.

source: This is the ID number of the event that the attribute is tied to. If an event belongs to your organisation, then this field will be coloured red.
si_lk: ගුණාංගය බැඳ ඇති සිදුවීමේ හැඳුනුම්පත මෙයයි. සිදුවීමක් ඔබේ සංවිධානයට අයත් නම්, මෙම ක්ෂේත්‍රය රතු පැහැයෙන් වර්ණගන්වනු ඇත.

source: The organisation that has created the event.
si_lk: උත්සවය නිර්මාණය කර ඇති සංවිධානය.

source: The category of the attribute, showing what the attribute describes (for example the malware's payload). For more information on categories, go to section xy
si_lk: ගුණාංගයේ ප්‍රවර්ගය, ගුණාංගය විස්තර කරන දේ පෙන්වයි (උදාහරණයක් ලෙස අනිෂ්ට මෘදුකාංගයේ ගෙවීම). කාණ්ඩ පිළිබඳ වැඩි විස්තර සඳහා, xy කොටස වෙත යන්න

source: The type of the value contained in the attribute (for example a source IP address). For more information on types, go to section xy
si_lk: ගුණාංගයේ අඩංගු අගයේ වර්ගය (උදාහරණයක් ලෙස මූලාශ්‍ර IP ලිපිනයක්). වර්ග පිළිබඳ වැඩි විස්තර සඳහා, xy කොටස වෙත යන්න

source: The actual value of the attribute, describing an aspect, defined by the category and type fields of the malware (for example 11.11.11.11).
si_lk: අනිෂ්ට මෘදුකාංගයේ ප්‍රවර්ග සහ වර්ග ක්ෂේත්‍ර මගින් නිර්වචනය කරන ලද අංගයක් විස්තර කරන ගුණාංගයේ සත්‍ය අගය (උදාහරණයක් ලෙස 11.11.11.11).

source: An optional contextual comment attached to the attribute.
si_lk: ගුණාංගයට අමුණා ඇති විකල්ප සන්දර්භාත්මක අදහසක්.

source: Shows whether the attribute has been flagged for NIDS signature generation or not.
si_lk: NIDS අත්සන් උත්පාදනය සඳහා ගුණාංගය සලකුණු කර තිබේද නැද්ද යන්න පෙන්වයි.

source: A set of buttons that allow you to view the event that the attribute is tied to, to edit the attribute (using the same view as what is used to set up attributes, but filled out with the attribute's current data) and a delete button.
si_lk: උපලක්ෂණයට බැඳී ඇති සිදුවීම බැලීමට, උපලක්ෂණ සංස්කරණය කිරීමට ඔබට ඉඩ සලසන බොත්තම් කට්ටලයක් (උලක්ෂණ සැකසීමට භාවිතා කරන දර්ශනයම භාවිතා කරමින්, නමුත් ගුණාංගයේ වත්මන් දත්ත වලින් පුරවා ඇත) සහ මකන්න බොත්තම.

source: Searching for attributes
si_lk: ගුණාංග සොයමින්

source: Apart from being able to list all events, it is also possible to search for data contained in the value field of an attribute, by clicking on the "Search Attributes" button.
si_lk: සියලුම සිදුවීම් ලැයිස්තුගත කිරීමට අමතරව, "සෙවුම් ගුණාංග" බොත්තම ක්ලික් කිරීමෙන්, ගුණාංගයක අගය ක්ෂේත්‍රයේ අඩංගු දත්ත සෙවීමටද හැකිය.

source: Search attribute
si_lk: සෙවුම් ගුණාංගය

source: This will bring up a form that lets you enter one or several search strings (separate search strings with line breaks) that will be compared to the values of all attributes, along with options to narrow down the search based on category and type. The entered search string has to be an exact match with (the sub-string of) a value. A second text field makes it possible to enter event IDs for events that should be excluded from the search (again, each line represents an event ID to be excluded). The third text field allows the user to restrict the results to attributes from certain organisations or to attributes not created by certain other organisations, using the above described syntax.
si_lk: මෙය ඔබට සෙවුම් තන්තු එකක් හෝ කිහිපයක් ඇතුළත් කිරීමට ඉඩ සලසන පෝරමයක් (රේඛා බිඳීම් සහිත වෙනම සෙවුම් තන්තු) සියලු ගුණාංගවල අගයන් සමඟ සංසන්දනය කරනු ඇත, ප්‍රවර්ගය සහ වර්ගය මත පදනම්ව සෙවීම පටු කිරීමට විකල්ප සමඟින්. ඇතුළත් කළ සෙවුම් තන්තුව අගයක් (හි උප තන්ත්‍රය) සමඟ හරියටම ගැළපීමක් විය යුතුය. දෙවන පෙළ ක්ෂේත්‍රයක් මඟින් සෙවුමෙන් බැහැර කළ යුතු සිදුවීම් සඳහා සිදුවීම් හැඳුනුම් ඇතුළත් කිරීමට හැකි වේ (නැවතත්, සෑම පේළියක්ම බැහැර කළ යුතු සිදුවීම් හැඳුනුම්පතක් නියෝජනය කරයි). තෙවන පෙළ ක්ෂේත්‍රය මඟින් ඉහත විස්තර කර ඇති වාක්‍ය ඛණ්ඩය භාවිතා කරමින්, ඇතැම් සංවිධානවල ගුණාංගවලට හෝ වෙනත් ඇතැම් සංවිධාන විසින් නිර්මාණය නොකළ ගුණාංගවලට ප්‍රතිඵල සීමා කිරීමට පරිශීලකයාට ඉඩ සලසයි.

source: The list generated by the search will look exactly the same as listing all attributes, except that only the attributes that matched the search criteria will be listed (to find out more about the list attributes view, %s.). The search parameters will be shown above the produced list and the search terms will be highlighted.
si_lk: සෙවුම් නිර්ණායකයට ගැළපෙන ගුණාංග පමණක් ලැයිස්තුගත කිරීම හැර, සෙවුම මගින් ජනනය කරන ලද ලැයිස්තුව සියලු ගුණාංග ලැයිස්තුගත කිරීම හා සමාන වනු ඇත (ලැයිස්තු ගුණාංග දර්ශනය පිළිබඳ වැඩි විස්තර දැන ගැනීමට, %s.). සෙවුම් පරාමිති නිෂ්පාදනය කරන ලද ලැයිස්තුවට ඉහළින් පෙන්වන අතර සෙවුම් පද උද්දීපනය කෙරේ.

source: The last option is a checkbox that restricts all of the results to attributes that are marked as IDS signatures.
si_lk: අවසාන විකල්පය IDS අත්සන් ලෙස සලකුණු කර ඇති ගුණාංග වලට ප්‍රතිඵල සියල්ල සීමා කරන පිරික්සුම් කොටුවකි.

source: You can view the event that an attribute belongs to with the view button, or you can edit/delete the attribute via the buttons on the right.
si_lk: ඔබට දර්ශණ බොත්තම සමඟින් උපලක්ෂණයක් අයත් වන සිදුවීම නැරඹිය හැක, නැතහොත් ඔබට දකුණු පස ඇති බොත්තම් හරහා උපලක්ෂණ සංස්කරණය/මකා දැමිය හැක.

source: Updating and modifying events and attributes
si_lk: සිදුවීම් සහ ගුණාංග යාවත්කාලීන කිරීම සහ වෙනස් කිරීම

source: Every event and attribute can easily be edited. First of all it is important to find the event or attribute that is to be edited, using any of the methods mentioned in the section on <a href="#browsing_events">browsing past events</a>.
si_lk: සෑම සිදුවීමක් සහ ගුණාංගයක්ම පහසුවෙන් සංස්කරණය කළ හැක. ප්‍රථමයෙන් <a href="#browsing_events">බ්‍රවුස් කිරීමේ අතීත සිදුවීම්</a>කොටසේ සඳහන් ඕනෑම ක්‍රමයක් භාවිතා කරමින් සංස්කරණය කිරීමට නියමිත සිදුවීම හෝ ගුණාංගය සොයා ගැනීම වැදගත් වේ.

source: Once it is found, the edit button (whether it be under actions when events/attributes get listed or simply on the event view) will bring up the same screen as what is used to create the entry of the same type (for an event it would be the event screen as <a href="#create">seen here</a>, for an attribute the attribute screen as <a href="#create_attribute">described here</a>).
si_lk: එය සොයාගත් පසු, සංස්කරණ බොත්තම (සිදුවීම්/ගුණාංග ලැයිස්තුගත වූ විට ක්‍රියාවන් යටතේ වේවා හෝ හුදෙක් සිදුවීම් දසුනෙහි වේවා) එකම ආකාරයේ ප්‍රවේශයක් නිර්මාණය කිරීමට භාවිතා කරන තිරයම (සිදුවීමක් සඳහා එය) ගෙන එනු ඇත. මෙහි</a>දක්නට ලැබෙන සිදුවීම් තිරය <a href="#create">ලෙස වනු ඇත, උපලක්ෂණයක් සඳහා ගුණාංග තිරය <a href="#create_attribute">ලෙස මෙහි විස්තර කර ඇත</a>).

source: Keep in mind that editing any event (either directly or indirectly through an attribute) will unpublish it, meaning that you'll have to publish it (through the event view) again once you are done.
si_lk: ඕනෑම සිදුවීමක් (සෘජුව හෝ වක්‍රව උපලක්ෂණයක් හරහා) සංස්කරණය කිරීමෙන් එය ප්‍රකාශනය නොකෙරෙන බව මතක තබා ගන්න, එනම් ඔබ අවසන් වූ පසු එය (සිදුවීම් දසුන හරහා) නැවත ප්‍රකාශයට පත් කිරීමට සිදුවනු ඇත.

source: As described earlier, users with tagging rights can arbitrarily tag events using tags chosen from a pool of available options. If you have tagging privileges and would like to create a new tag, navigate to Event Actions - Add Tag. You'll be presented with the following form
si_lk: කලින් විස්තර කර ඇති පරිදි, ටැග් කිරීමේ අයිතිය ඇති පරිශීලකයින්ට පවතින විකල්ප සංචිතයකින් තෝරාගත් ටැග් භාවිතයෙන් සිදුවීම් අත්තනෝමතික ලෙස ටැග් කළ හැකිය. ඔබට ටැග් කිරීමේ වරප්‍රසාද තිබේ නම් සහ නව ටැගයක් සෑදීමට කැමති නම්, සිදුවීම් ක්‍රියා වෙත සංචාලනය කරන්න - ටැගය එක් කරන්න. ඔබට පහත පෝරමය ඉදිරිපත් කරනු ඇත

source: Enter a name for the tag and click on the color field to be able to pick a colour for it.
si_lk: ටැගය සඳහා නමක් ඇතුළත් කර එය සඳහා වර්ණයක් තෝරා ගැනීමට හැකි වන පරිදි වර්ණ ක්ෂේත්රය මත ක්ලික් කරන්න.

source: Fill out the following fields
si_lk: පහත ක්ෂේත්‍ර පුරවන්න

source: Pick a name for the tag. Try to use consistent naming conventions across your instance, to avoid confusion.
si_lk: ටැගය සඳහා නමක් තෝරන්න. ව්‍යාකූලත්වය මඟහරවා ගැනීම සඳහා, ඔබේ අවස්ථාව හරහා ස්ථාවර නම් කිරීමේ සම්මුතීන් භාවිතා කිරීමට උත්සාහ කරන්න.

source: Colour
si_lk: වර්ණ

source: You can choose a colour for the tag by clicking on the colour field and using the colour picker tool. Try to avoid having duplicate or similar looking colours to help avoid confusion.
si_lk: ඔබට වර්ණ ක්ෂේත්‍රය මත ක්ලික් කිරීමෙන් සහ වර්ණ පිකර් මෙවලම භාවිතයෙන් ටැගය සඳහා වර්ණයක් තෝරාගත හැක. ව්‍යාකූලත්වය වළක්වා ගැනීම සඳහා අනුපිටපත් හෝ සමාන පෙනුමක් ඇති වර්ණ වළක්වා ගැනීමට උත්සාහ කරන්න.

source: Newer users can easily be overwhelmed by having to manually populate events with attributes without any guidance. What sort of information should go into the event? What should be the category and type of a C2 IP? Templates allow users to use simple forms to populate events.
si_lk: කිසිදු මඟ පෙන්වීමකින් තොරව ගුණාංග සමඟ සිදුවීම් අතින් ජනනය කිරීමට සිදුවීමෙන් නව පරිශීලකයින්ට පහසුවෙන් යටපත් විය හැක. සිදුවීමට යා යුත්තේ කුමන ආකාරයේ තොරතුරුද? C2 IP වර්ගය සහ වර්ගය කුමක් විය යුතුද? සිද්ධි ජනනය කිරීම සඳහා සරල ආකෘති භාවිතා කිරීමට සැකිලි පරිශීලකයින්ට ඉඩ දෙයි.

source: Even though MISP ships with a few default templates, it is possible for users (with the appropriate templating privilege) to create new templates for their users or for all users of the instance. Let's look at how you can create a template.
si_lk: MISP පෙරනිමි සැකිලි කිහිපයක් සමඟ නැව්ගත කළද, පරිශීලකයින්ට (සුදුසු සැකිලි වරප්‍රසාද සහිතව) ඔවුන්ගේ පරිශීලකයින් සඳහා හෝ එම අවස්ථාවෙහි සියලුම පරිශීලකයින් සඳහා නව සැකිලි නිර්මාණය කළ හැකිය. ඔබට සැකිල්ලක් සාදා ගන්නේ කෙසේදැයි බලමු.

source: First go to Event Actions - Add Template to go to the event creation view.
si_lk: මුලින්ම Event Actions වෙත යන්න - Event create view වෙත යාමට අච්චුව එක් කරන්න.

source: Create Template
si_lk: සැකිල්ල සාදන්න

source: Fill in the generic information about the template.
si_lk: අච්චුව පිළිබඳ පොදු තොරතුරු පුරවන්න.

source: The following fields have to be filled out
si_lk: පහත ක්ෂේත්‍ර පිරවිය යුතුය

source: The name of the template should describe what type of an event it should be used to generate attributes.
si_lk: අච්චුවේ නම එය ගුණාංග උත්පාදනය කිරීමට කුමන ආකාරයේ සිදුවීමක් භාවිතා කළ යුතුද යන්න විස්තර කළ යුතුය.

source: You can attach tags to the template - an event populated using the template would automatically receive the tag(s). Add new tags using the + button. If you change your mind about a tag you can remove it with the cross next to the tag name.
si_lk: ඔබට අච්චුවට ටැග් ඇමිණීමට හැකිය - අච්චුව භාවිතයෙන් ජනාකීර්ණ සිදුවීමක් ස්වයංක්‍රීයව ටැග්(ය) ලැබෙනු ඇත. + බොත්තම භාවිතයෙන් නව ටැග් එක් කරන්න. ඔබ ටැගයක් ගැන ඔබේ අදහස වෙනස් කරන්නේ නම්, ඔබට ටැග් නාමය අසල ඇති කුරුසය සමඟ එය ඉවත් කළ හැකිය.

source: A short description about the events that this template should be used for.
si_lk: මෙම අච්චුව භාවිතා කළ යුතු සිදුවීම් පිළිබඳ කෙටි විස්තරයක්.

source: Share this template with others
si_lk: මෙම අච්චුව අන් අය සමඟ බෙදා ගන්න

source: The template can be set to be usable by any organisation on the instance or only by the one that has created it.
si_lk: ආකෘතිය ඕනෑම ආයතනයකට භාවිතා කළ හැකි ලෙස සැකසිය හැක, නැතහොත් එය නිර්මාණය කළ තැනැත්තාට පමණි.

source: Once the skeleton template is created, you can start populating the template with data. There are 3 types of elements that can be used during the creation of a template: attribute, file and text elements. Text elements divide the template into sections with an information field, followed by all of the attribute/file fields until a new text field is read. Don't worry about the order of the elements during creation, they can be re-arranged using drag &amp; drop. Let's look at the 3 element types
si_lk: ඇටසැකිල්ල සැකිල්ල සෑදූ පසු, ඔබට දත්ත සමඟ අච්චුව පිරවීම ආරම්භ කළ හැක. සැකිල්ලක් නිර්මාණය කිරීමේදී භාවිතා කළ හැකි මූලද්‍රව්‍ය වර්ග 3ක් ඇත: attribute, file සහ text element. පෙළ මූලද්‍රව්‍ය මඟින් අච්චුව තොරතුරු ක්ෂේත්‍රයක් සහිත කොටස්වලට බෙදයි, නව පෙළ ක්ෂේත්‍රයක් කියවන තෙක් සියලු ගුණාංග/ගොනු ක්ෂේත්‍ර අනුගමනය කරයි. නිර්මාණය කිරීමේදී මූලද්‍රව්‍යවල අනුපිළිවෙල ගැන කරදර නොවන්න, drag &amp; drop භාවිතයෙන් ඒවා නැවත සකස් කළ හැක. මූලද්රව්ය වර්ග 3 දෙස බලමු

source: Attribute Element
si_lk: ගුණාංග මූලද්රව්යය

source: Template Attribute Element
si_lk: සැකිලි ගුණාංග මූලද්‍රව්‍යය

source: This element will generate regular attributes based on user entry.
si_lk: මෙම මූලද්‍රව්‍යය පරිශීලක ප්‍රවේශය මත පදනම්ව නිත්‍ය ගුණාංග ජනනය කරනු ඇත.

source: The field name that will be presented to the user.
si_lk: පරිශීලකයාට ඉදිරිපත් කරන ක්ෂේත්‍ර නාමය.

source: A brief description of the element. Make sure that you provide sufficient information to the user to make it obvious what is expected.
si_lk: මූලද්රව්යය පිළිබඳ කෙටි විස්තරයක්. ඔබ අපේක්ෂා කරන්නේ කුමක්ද යන්න පැහැදිලි කිරීමට පරිශීලකයාට ප්‍රමාණවත් තොරතුරු සපයන බවට වග බලා ගන්න.

source: The category used for any attributes created using this template element.
si_lk: මෙම අච්චු මූලද්‍රව්‍ය භාවිතයෙන් සාදන ලද ඕනෑම උපලක්ෂණයක් සඳහා භාවිතා කරන ප්‍රවර්ගය.

source: The type or complex type used for any attributes created using this template element. Complex types allow for several related types to be used on data entry. For example, a "file" complex type element allows for filenames and hashes.
si_lk: මෙම අච්චු මූලද්‍රව්‍ය භාවිතයෙන් සාදන ලද ඕනෑම උපලක්ෂණයක් සඳහා භාවිතා කරන වර්ගය හෝ සංකීර්ණ වර්ගය. සංකීර්ණ වර්ග දත්ත ඇතුළත් කිරීමේදී අදාළ වර්ග කිහිපයක් භාවිතා කිරීමට ඉඩ සලසයි. උදාහරණයක් ලෙස, "ගොනු" සංකීර්ණ ආකාරයේ මූලද්රව්යයක් ගොනු නාම සහ හැෂ් සඳහා ඉඩ ලබා දේ.

source: Use Complex types
si_lk: සංකීර්ණ වර්ග භාවිතා කරන්න

source: If the category permits it, switch to a complex type using this checkbox.
si_lk: ප්‍රවර්ගය එයට අවසර දෙන්නේ නම්, මෙම පිරික්සුම් කොටුව භාවිතයෙන් සංකීර්ණ වර්ගයකට මාරු වන්න.

source: Automatically mark for IDS
si_lk: IDS සඳහා ස්වයංක්‍රීයව ලකුණු කරන්න

source: If checked, any attributes generated using this element will be marked for IDS exporting.
si_lk: පරීක්‍ෂා කළහොත්, මෙම මූලද්‍රව්‍ය භාවිතයෙන් ජනනය කරන ලද ඕනෑම උපලක්ෂණයක් IDS අපනයනය සඳහා ලකුණු කරනු ලැබේ.

source: Mandatory element
si_lk: අනිවාර්ය අංගය

source: If the elemnt is marked as mandatory, then the template form can only be submitted by users if this field is filled out.
si_lk: මූලද්‍රව්‍යය අනිවාර්ය ලෙස සලකුණු කර ඇත්නම්, අච්චු පෝරමය ඉදිරිපත් කළ හැක්කේ මෙම ක්ෂේත්‍රය පුරවා ඇත්නම් පමණි.

source: Batch import element
si_lk: කණ්ඩායම් ආයාත අංගය

source: Allow for multiple values to be entered (separated by line breaks).
si_lk: බහු අගයන් ඇතුළත් කිරීමට ඉඩ දෙන්න (රේඛා බිඳීම් මගින් වෙන් කර ඇත).

source: File Element
si_lk: ගොනු මූලද්රව්යය

source: Template File Element
si_lk: සැකිලි ගොනු මූලද්‍රව්‍යය

source: This element will generate attachments based on user entry.
si_lk: මෙම මූලද්‍රව්‍යය පරිශීලක ප්‍රවේශය මත පදනම්ව ඇමුණුම් ජනනය කරනු ඇත.

source: The category to be used by all attachments uploaded through this element.
si_lk: මෙම මූලද්‍රව්‍යය හරහා උඩුගත කළ සියලුම ඇමුණුම් විසින් භාවිත කළ යුතු ප්‍රවර්ගය.

source: If the uploaded files are malicious and should be encrypted and password protected, mark this checkbox.
si_lk: උඩුගත කරන ලද ගොනු අනිෂ්ට නම් සහ සංකේතනය කර මුරපදය ආරක්ෂා කළ යුතු නම්, මෙම සලකුණු කොටුව සලකුණු කරන්න.

source: If it should be required to upload an attachment, check this checkbox.
si_lk: ඇමුණුමක් උඩුගත කිරීමට අවශ්‍ය නම්, මෙම සලකුණු කොටුව සලකුණු කරන්න.

source: Ticking this checkbox allows users to upload several files using this element.
si_lk: මෙම සලකුණු කොටුව සලකුණු කිරීමෙන් පරිශීලකයින්ට මෙම මූලද්‍රව්‍යය භාවිතයෙන් ගොනු කිහිපයක් උඩුගත කිරීමට ඉඩ ලබා දේ.

source: Text Element
si_lk: පෙළ මූලද්රව්යය

source: Template Text Element
si_lk: සැකිලි පෙළ මූලද්‍රව්‍යය

source: This element will start a section in the template, which continues until the next text element or the end of the template.
si_lk: මෙම මූලද්‍රව්‍යය අච්චුවේ කොටසක් ආරම්භ කරනු ඇත, එය ඊළඟ පෙළ මූලද්‍රව්‍යය හෝ අච්චුවේ අවසානය දක්වා පවතී.

source: The name of the section that will be presented to the user.
si_lk: පරිශීලකයාට ඉදිරිපත් කරනු ලබන කොටසෙහි නම.

source: The description of the section. Explain briefly to the user what the following attribute/file elements will be dealing with. There are several ways to split a template into sections, try to have ease of use in mind while creating it.
si_lk: කොටසේ විස්තරය. පහත ගුණාංග/ගොනු මූලද්‍රව්‍ය සමඟ ගනුදෙනු කරන්නේ කුමක් දැයි පරිශීලකයාට කෙටියෙන් පැහැදිලි කරන්න. අච්චුවක් කොටස් වලට බෙදීමට ක්‍රම කිහිපයක් තිබේ, එය නිර්මාණය කිරීමේදී භාවිතයේ පහසුව මතක තබා ගැනීමට උත්සාහ කරන්න.

source: Contacting the reporter
si_lk: වාර්තාකරු සම්බන්ධ කර ගැනීම

source: To get in touch with the reporter of a previously registered event, just find the event for which you would like to contact the reporter by either finding it on the list of events, by finding it through one of its attributes or by finding it through a related event.
si_lk: කලින් ලියාපදිංචි වූ සිදුවීමක වාර්තාකරු සමඟ සම්බන්ධ වීමට, ඔබ වාර්තාකරු සම්බන්ධ කර ගැනීමට කැමති සිදුවීම එක්කෝ සිදුවීම් ලැයිස්තුවෙන් සොයා ගැනීමෙන්, එහි එක් ගුණාංගයක් හරහා හෝ එය සොයා ගැනීමෙන් සොයා ගන්න. අදාළ සිදුවීම.

source: Once the event is found and the event view opened, click the button titled "Contact Reporter". This will bring up a view where you can enter your message that is to be e-mailed to all members of the reporting organisation that subscribe to receiving such reports or the reporting user himself. Along with your message, the detailed information about the event in question will be included in the e-mail.
si_lk: සිදුවීම සොයාගෙන සිදුවීම් දර්ශනය විවෘත කළ පසු, "සම්බන්ධතා වාර්තාකරු" යන මාතෘකාව ඇති බොත්තම ක්ලික් කරන්න. මෙය ඔබට ඔබේ පණිවිඩය ඇතුළත් කළ හැකි දර්ශනයක් ගෙන එනු ඇත, එය එවැනි වාර්තා ලබා ගැනීමට දායක වන වාර්තාකරණ සංවිධානයේ සියලුම සාමාජිකයින්ට හෝ වාර්තා කරන පරිශීලකයාට විද්‍යුත් තැපෑලෙන් එවිය යුතුය. ඔබගේ පණිවිඩය සමඟ, අදාළ සිදුවීම පිළිබඳ සවිස්තරාත්මක තොරතුරු විද්‍යුත් තැපෑලෙහි ඇතුළත් වේ.

source: Enter your message to the reporter and choose whether his/her entire organisation should get the message or not by ticking the check-box.
si_lk: ඔබේ පණිවිඩය වාර්තාකරුට ඇතුළත් කර ඔහුගේ/ඇයගේ මුළු සංවිධානයටම පණිවිඩය ලැබිය යුතුද නැද්ද යන්න තේරීම් කොටුව සලකුණු කිරීමෙන් තෝරන්න.

source: By default, the message will be sent to every member of the organisation that posted the event in the first place, but if you tick the check-box below the message field before sending the mail, only the person that reported the event will get e-mailed.
si_lk: පෙරනිමියෙන්, සිද්ධිය පළ කළ සංවිධානයේ සෑම සාමාජිකයෙකුටම පණිවිඩය යවනු ඇත, නමුත් ඔබ තැපෑල යැවීමට පෙර පණිවිඩ ක්ෂේත්‍රයට පහළින් ඇති සලකුණු කොටුව සලකුණු කළහොත්, සිදුවීම වාර්තා කළ පුද්ගලයාට පමණක් ලැබෙනු ඇත. -තැපැල් කර ඇත.

source: It is possible to quickly and conveniently export the data contained within the system using the automation features located in the main menu on the left (available to users with authentication key access only). There are various sets of data that can be exported, by using the authentication key provided by the system (also shown on the export page). If for whatever reason you would need to invalidate your current key and get a new one instead (for example due to the old one becoming compromised) just hit the reset link next to the authentication key in the export view or in your "my profile" view.
si_lk: වම් පස ඇති ප්‍රධාන මෙනුවේ (සත්‍යාපන යතුරු ප්‍රවේශය ඇති පරිශීලකයින්ට පමණක් ලබා ගත හැකි) ස්වයංක්‍රීයකරණ විශේෂාංග භාවිතයෙන් පද්ධතිය තුළ අඩංගු දත්ත ඉක්මනින් සහ පහසු ලෙස අපනයනය කළ හැකිය. පද්ධතිය විසින් සපයනු ලබන සත්‍යාපන යතුර භාවිතයෙන් අපනයනය කළ හැකි විවිධ දත්ත කට්ටල තිබේ (අපනයන පිටුවේ ද පෙන්වා ඇත). කුමන හේතුවක් නිසා හෝ ඔබට ඔබගේ වත්මන් යතුර අවලංගු කර ඒ වෙනුවට අලුත් එකක් ලබා ගැනීමට අවශ්‍ය නම් (උදාහරණයක් ලෙස පැරණි එක සම්මුතියකට ලක් වීම හේතුවෙන්) අපනයන දර්ශනයේ හෝ ඔබේ "මගේ පැතිකඩ" තුළ ඇති සත්‍යාපන යතුර අසල ඇති යළි පිහිටුවීමේ සබැඳිය ඔබන්න. දැක්ම.

source: To find out about the various export formats and the usage within the automation functions, please read the page on <a href="%s/events/automation">automation</a>.
si_lk: විවිධ නිර්යාත ආකෘති සහ ස්වයංක්‍රීයකරණ ශ්‍රිතවල භාවිතය ගැන දැන ගැනීමට කරුණාකර <a href="%s/events/automation">ස්වයංක්‍රීයකරණය</a>පිටුව කියවන්න.

source: For users that do not have authentication key access, an alternate export feature is available that relies on your interactive login to the site. To access these, just use the export menu button to the left and you'll be presented with a list of export options.
si_lk: සත්‍යාපන යතුරු ප්‍රවේශය නොමැති පරිශීලකයින් සඳහා, ඔබේ වෙබ් අඩවියට අන්තර්ක්‍රියාකාරී පිවිසුම මත රඳා පවතින විකල්ප අපනයන විශේෂාංගයක් තිබේ. මේවාට ප්‍රවේශ වීමට, වම් පස ඇති අපනයන මෙනු බොත්තම භාවිතා කරන්න, එවිට ඔබට අපනයන විකල්ප ලැයිස්තුවක් ඉදිරිපත් කරනු ඇත.

source: Depending on your server's configuration, you will be presented with one of two possible pages, depending on whether you have background processing enabled or not. (The setting on this instance is currently set to: <code>%s</code>)
si_lk: ඔබගේ සේවාදායකයේ වින්‍යාසය මත පදනම්ව, ඔබට පසුබිම් සැකසුම් සක්‍රීය කර තිබේද නැද්ද යන්න මත, ඔබට හැකි පිටු දෙකෙන් එකක් ඉදිරිපත් කරනු ඇත. (මෙම අවස්ථාවෙහි සැකසුම දැනට සකසා ඇත්තේ: <code>%s</code>)

source: On
si_lk: මත

source: Off
si_lk: අක්රියයි

source: Export page with background jobs
si_lk: පසුබිම් රැකියා සහිත පිටුව අපනයනය කරන්න

source: The page will list a set of export formats that you can immediately download as a file. Just click on the desired export format and MISP will start collecting all the data that you will receive in a file. Keep in mind that this can be a lengthy process. To avoid having to wait, consult with your instance's site administrator about enabling the background processing.
si_lk: පිටුව ඔබට වහාම ගොනුවක් ලෙස බාගත කළ හැකි අපනයන ආකෘති කට්ටලයක් ලැයිස්තුගත කරනු ඇත. අවශ්‍ය අපනයන ආකෘතිය මත ක්ලික් කරන්න, එවිට MISP මඟින් ඔබට ගොනුවක ලැබෙන සියලුම දත්ත රැස් කිරීම ආරම්භ කරයි. මෙය දිගු ක්රියාවලියක් විය හැකි බව මතක තබා ගන්න. බලා සිටීම වළක්වා ගැනීම සඳහා, පසුබිම සැකසීම සබල කිරීම පිළිබඳව ඔබේ උදාහරණයේ අඩවි පරිපාලකගෙන් විමසන්න.
