Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: <i>Deleted org #%s</i>
si_lk: <i>මකා දැමූ org #%s</i>

source: Event #%s: %s
si_lk: සිදුවීම #%s: %s

source: Page {:page} of {:pages}, showing {:current} records out of {:count} total, starting on record {:start}, ending on {:end}
si_lk: {:pages}හි {:page} පිටුව, මුළු වාර්තා {:count} න් {:current} ක් පෙන්වයි, වාර්තාගත {:start}න් ආරම්භ වී {:end}න් අවසන් වේ

source: Older logs
si_lk: පැරණි ලඝු-සටහන්

source: Auth keys are used for API access. A user can have more than one authkey, so if you would like to use separate keys per tool that queries MISP, add additional keys. Use the comment field to make identifying your keys easier.
si_lk: API ප්‍රවේශය සඳහා Auth යතුරු භාවිතා වේ. පරිශීලකයෙකුට authkey එකකට වඩා තිබිය හැක, එබැවින් MISP විමසන මෙවලමකට වෙනම යතුරු භාවිතා කිරීමට ඔබ කැමති නම්, අමතර යතුරු එක් කරන්න. ඔබේ යතුරු හඳුනා ගැනීම පහසු කිරීමට අදහස් ක්ෂේත්‍රය භාවිතා කරන්න.

source: Allowed IPs
si_lk: අවසර ලත් IPs

source: Expiration (%s)
si_lk: කල් ඉකුත්වීම (%s)

source: keep empty for maximal validity of %s days
si_lk: දින %s ක උපරිම වලංගුභාවය සඳහා හිස්ව තබන්න

source: keep empty for indefinite
si_lk: දින නියමයක් නොමැතිව හිස්ව තබන්න

source: Read only (it will be not possible to do any change operation with this token)
si_lk: කියවීමට පමණක් (මෙම ටෝකනය සමඟ කිසිදු වෙනස් කිරීමේ මෙහෙයුමක් කිරීමට නොහැකි වනු ඇත)

source: Auth key created
si_lk: Auth යතුර සාදන ලදී

source: Please make sure that you note down the auth key below, this is the only time the auth key is shown in plain text, so make sure you save it. If you lose the key, simply remove the entry and generate a new one.
si_lk: කරුණාකර ඔබ පහත සත්‍යාපන යතුර සටහන් කර ඇති බවට වග බලා ගන්න, සත්‍යාපන යතුර සරල පෙළකින් පෙන්වන එකම අවස්ථාව මෙයයි, එබැවින් ඔබ එය සුරැකීමට වග බලා ගන්න. ඔබට යතුර නැති වුවහොත්, ප්‍රවේශය ඉවත් කර නව එකක් උත්පාදනය කරන්න.

source: MISP will use the first and the last 4 characters for identification purposes.
si_lk: MISP හඳුනාගැනීමේ අරමුණු සඳහා පළමු සහ අවසාන අක්ෂර 4 භාවිතා කරනු ඇත.

source: I have noted down my key, take me back now
si_lk: මම මගේ යතුර සටහන් කර ගත්තා, දැන් මාව ආපසු ගන්න

source: Advanced auth keys are not enabled.
si_lk: උසස් සත්‍යාපන යතුරු සක්‍රීය කර නොමැත.

source: Add authentication key
si_lk: සත්‍යාපන යතුර එක් කරන්න

source: Enter value to search
si_lk: සෙවීමට අගය ඇතුළත් කරන්න

source: Auth Key
si_lk: සත්‍යාපන යතුර

source: Expiration
si_lk: කල් ඉකුත්වීම

source: Never
si_lk: කවදාවත් නැහැ

source: Authentication key Index
si_lk: සත්‍යාපන යතුරු දර්ශකය

source: A list of API keys bound to a user.
si_lk: පරිශීලකයෙකුට බැඳී ඇති API යතුරු ලැයිස්තුවක්.

source: Delete auth key
si_lk: සත්‍යාපන යතුර මකන්න

source: Created
si_lk: නිර්මාණය කළා

source: Read only
si_lk: කියවන්න විතරයි

source: Key usage
si_lk: ප්රධාන භාවිතය

source: Last used
si_lk: අවසන් වරට භාවිතා කරන ලදී

source: Not used yet
si_lk: තවමත් භාවිතා කර නැත

source: Unique IPs
si_lk: අද්විතීය IPs

source: Pull Organisations
si_lk: අදින්න සංවිධාන

source: Pull Sharing Groups
si_lk: බෙදාගැනීමේ කණ්ඩායම් අදින්න

source: Edit Cerebrate connection
si_lk: Cerebrate සම්බන්ධතාවය සංස්කරණය කරන්න

source: Add Cerebrate connection
si_lk: Cerebrate සම්බන්ධතාවය එක් කරන්න

source: Id
si_lk: හැඳුනුම්පත

source: Owner Org
si_lk: හිමිකරු සංවිධානය

source: Pull Orgs
si_lk: අදින්න අවයව

source: Pull SGs
si_lk: SGs අදින්න

source: Add Cerebrate
si_lk: Cerebrate එකතු කරන්න

source: Linked Cerebrates
si_lk: සම්බන්ධිත Cerebrates

source: You can connect your MISP to one or several Cerebrate instances to act as lookup directories for organisation and sharing group information.
si_lk: සංවිධානය සහ කණ්ඩායම් තොරතුරු බෙදාගැනීම සඳහා සෙවීම් නාමාවලි ලෙස ක්‍රියා කිරීමට ඔබට ඔබේ MISP එක Cerebrate අවස්ථා එකකට හෝ කිහිපයකට සම්බන්ධ කළ හැක.

source: Pull all organisations
si_lk: සියලුම සංවිධාන අදින්න

source: Pull all sharing groups
si_lk: සියලුම බෙදාගැනීමේ කණ්ඩායම් අදින්න

source: Status
si_lk: තත්ත්වය

source: Sector
si_lk: අංශය

source: Nationality
si_lk: ජාතිය

source: Organisations list via Cerebrate %s (%s)
si_lk: Cerebrate %s (%s) හරහා සංවිධාන ලැයිස්තුව

source: Preview of the organisations known to the remote Cerebrate instance.
si_lk: දුරස්ථ Cerebrate අවස්ථාවට දන්නා සංවිධානවල පෙරදසුන.

source: Fetch organisation object
si_lk: සංවිධාන වස්තුව ලබා ගන්න

source: Releasability
si_lk: මුදා හැරීමේ හැකියාව

source: # Member
si_lk: # සාමාජික

source: Sharing group list via Cerebrate %s (%s)
si_lk: Cerebrate %s (%s) හරහා කණ්ඩායම් ලැයිස්තුව බෙදා ගැනීම

source: Preview of the sharing group known to the remote Cerebrate instance.
si_lk: දුරස්ථ Cerebrate අවස්ථාවට දන්නා බෙදාගැනීමේ කණ්ඩායමේ පෙරදසුන.

source: Fetch sharing group object
si_lk: බෙදාගැනීමේ කණ්ඩායම් වස්තුව ලබා ගන්න

source: Owner Organisation
si_lk: හිමිකරු සංවිධානය

source: The Cerebrate Project
si_lk: Cerebrate ව්යාපෘතිය

source: Vetted by the MISP-project team
si_lk: MISP-ව්‍යාපෘති කණ්ඩායම විසින් පරීක්ෂා කරන ලදී

source: Unvetted
si_lk: පරීක්ෂා නොකළ

source: Vetted
si_lk: පරීක්ෂා කළා

source: Host org
si_lk: සත්කාරක සංවිධානය

source: Community name
si_lk: ප්රජාවගේ නම

source: Self-reg
si_lk: ස්වයං-රෙජි

source: This community allows for self-registration
si_lk: මෙම ප්රජාව ස්වයං-ලියාපදිංචියට ඉඩ සලසයි

source: Communities index
si_lk: ප්‍රජා දර්ශකය

source: You can find a list of communities below that chose to advertise their existence to the general MISP user-base. Requesting access to any of those communities is of course no guarantee of being permitted access, it is only meant to simplify the means of finding the various communities that one may be eligible for. Get in touch with the MISP project maintainers if you would like your community to be included in the list.
si_lk: සාමාන්‍ය MISP පරිශීලක පදනමට ඔවුන්ගේ පැවැත්ම ප්‍රචාරණය කිරීමට තෝරා ගත් ප්‍රජාවන්ගේ ලැයිස්තුවක් ඔබට පහතින් සොයාගත හැක. එම ඕනෑම ප්‍රජාවකට ප්‍රවේශය ඉල්ලා සිටීමෙන් ප්‍රවේශ වීමට අවසර ලබා දීම සහතිකයක් නොවේ, එයින් අදහස් කරන්නේ කෙනෙකුට සුදුසුකම් ලැබිය හැකි විවිධ ප්‍රජාවන් සොයා ගැනීමේ මාධ්‍යයන් සරල කිරීමට පමණි. ඔබේ ප්‍රජාව ලැයිස්තුවට ඇතුළත් කිරීමට ඔබ කැමති නම් MISP ව්‍යාපෘති නඩත්තු කරන්නන් සමඟ සම්බන්ධ වන්න.

source: Describe both yourself and your organisation as best as you can - keep in mind this information is to be used by the hosts of the community you are requesting access to in order to determine whether you're a good fit for their community. The sending server's basic metadata is included by default, you can opt out using the "anonymise" checkbox (server url, uuid, version are shared otherwise - though this can be a useful step in establishing trust.).
si_lk: ඔබ සහ ඔබේ සංවිධානය යන දෙකම ඔබට හැකි උපරිමයෙන් විස්තර කරන්න - මෙම තොරතුරු ඔබ ප්‍රවේශය ඉල්ලා සිටින ප්‍රජාවේ ධාරකයින් විසින් ඔවුන්ගේ ප්‍රජාවට සුදුසු දැයි තීරණය කිරීම සඳහා භාවිතා කළ යුතු බව මතක තබා ගන්න. යැවීමේ සේවාදායකයේ මූලික පාර-දත්ත පෙරනිමියෙන් ඇතුළත් වේ, ඔබට "නිර්නාමික" පිරික්සුම් කොටුව භාවිතයෙන් ඉවත් විය හැක (සේවාදායක url, uuid, අනුවාදය වෙනත් ආකාරයකින් බෙදා ඇත - මෙය විශ්වාසය තහවුරු කිරීමේ ප්‍රයෝජනවත් පියවරක් විය හැකි වුවද.).

source: Requestor E-mail address
si_lk: ඉල්ලුම්කරුගේ විද්‍යුත් තැපැල් ලිපිනය

source: Organisation name
si_lk: සංවිධානයේ නම

source: Organisation uuid
si_lk: සංවිධානය uuid

source: Description of the requestor organisation
si_lk: ඉල්ලුම්කරු සංවිධානයේ විස්තරය

source: Message to the community host organisation
si_lk: ප්‍රජා සත්කාරක සංවිධානයට පණිවිඩයක්

source: PGP public key
si_lk: PGP පොදු යතුර

source: Request sync access
si_lk: සමමුහුර්ත ප්‍රවේශය ඉල්ලන්න

source: Anonymise information on the server used to issue the request
si_lk: ඉල්ලීම නිකුත් කිරීමට භාවිතා කරන සේවාදායකයේ තොරතුරු නිර්නාමික කරන්න

source: Generate e-mail for later use, but do not send it
si_lk: පසුකාලීන භාවිතය සඳහා විද්‍යුත් තැපෑල ජනනය කරන්න, නමුත් එය නොයවන්න

source: Email to send in order to request access
si_lk: ප්‍රවේශය ඉල්ලා සිටීම සඳහා යැවීමට විද්‍යුත් තැපෑල

source: Emailing is currently disabled on the instance, but we have generated the e-mail that would normally be sent out below.
si_lk: මෙම අවස්ථාවෙහිදී විද්‍යුත් තැපැල් කිරීම දැනට අක්‍රිය කර ඇත, නමුත් අපි සාමාන්‍යයෙන් පහතින් යවනු ලබන විද්‍යුත් තැපෑල ජනනය කර ඇත.

source: Please find a generated e-mail below that you can use to contact the community in question
si_lk: ඔබට අදාළ ප්‍රජාව සම්බන්ධ කර ගැනීමට භාවිත කළ හැකි උත්පාදනය කරන ලද විද්‍යුත් තැපෑලක් පහතින් සොයා ගන්න

source: Headers:
si_lk: ශීර්ෂ:

source: Message:
si_lk: පණිවුඩය:

source: Host organisation
si_lk: සත්කාරක සංවිධානය

source: Vetted by MISP-project
si_lk: MISP-ව්‍යාපෘතිය මගින් පරීක්ෂා කරන ලදී

source: GnuPG key
si_lk: GnuPG යතුර

source: Community
si_lk: ප්රජාව

source: Request Access
si_lk: ප්රවේශය ඉල්ලන්න

source: Add Correlation Exclusion Entry
si_lk: සහසම්බන්ධතා බැහැර කිරීමේ ප්‍රවේශය එක් කරන්න

source: Edit Correlation Exclusion Entry
si_lk: සහසම්බන්ධතා බැහැර කිරීමේ ප්‍රවේශය සංස්කරණය කරන්න

source: If you wish to exclude certain entries from being correlated on, simply add an entry here.
si_lk: ඔබට ඇතැම් ඇතුළත් කිරීම් සහසම්බන්ධ වීමෙන් බැහැර කිරීමට අවශ්‍ය නම්, සරලව මෙහි ඇතුළත් කිරීමක් එක් කරන්න.

source: Add correlation exclusion entry
si_lk: සහසම්බන්ධතා බැහැර ප්‍රවේශය එක් කරන්න

source: Correlation Exclusions Index
si_lk: සහසම්බන්ධතා බැහැර කිරීම් දර්ශකය

source: A list of values to exclude from the correlation engine.
si_lk: සහසම්බන්ධ එන්ජිමෙන් බැහැර කළ යුතු අගයන් ලැයිස්තුවක්.

source: Edit exclusion entry
si_lk: බැහැර කිරීමේ ප්‍රවේශය සංස්කරණය කරන්න

source: Delete correlation exclusion entry
si_lk: සහසම්බන්ධතා බැහැර කිරීමේ ප්‍රවේශය මකන්න

source: The values with the most correlation entries.
si_lk: වඩාත්ම සහසම්බන්ධ ඇතුළත් කිරීම් සහිත අගයන්.

source: Add exclusion entry for value
si_lk: අගය සඳහා බැහැර කිරීම් ඇතුළත් කරන්න

source: Cache age: %s%s
si_lk: හැඹිලි වයස: %s%s

source: Regenerate cache
si_lk: හැඹිලිය නැවත උත්පාදනය කරන්න

source: Add Widget
si_lk: Widget එක් කරන්න

source: Config
si_lk: වින්යාසය

source: Edit Widget
si_lk: විජට් සංස්කරණය කරන්න

source: Export Dashboard Settings
si_lk: අපනයන උපකරණ පුවරු සැකසුම්

source: Simply copy and share your dashboard settings below. Make sure that you sanitise it so that you do not share anything sensitive. Simply click on the JSON below to select it.
si_lk: ඔබගේ උපකරණ පුවරු සැකසීම් පහතින් පිටපත් කර බෙදා ගන්න. ඔබ සංවේදී කිසිවක් බෙදා නොගන්නා ලෙස එය සනීපාරක්ෂාව කිරීමට වග බලා ගන්න. එය තේරීමට පහත JSON මත ක්ලික් කරන්න.

source: Dashboard settings
si_lk: උපකරණ පුවරු සැකසුම්

source: Import Dashboard Configuration
si_lk: ආයාත උපකරණ පුවරු වින්‍යාසය

source: Import a configuration JSON as exported from another MISP instance.
si_lk: වෙනත් MISP අවස්ථාවකින් අපනයනය කරන ලද JSON වින්‍යාසයක් ආයාත කරන්න.

source: Owner
si_lk: හිමිකරු

source: Widgets Used
si_lk: භාවිතා කරන ලද විජට්

source: Selectable
si_lk: තෝරාගත හැකි

source: Default
si_lk: පෙරනිමිය

source: Dashboard Templates Index
si_lk: උපකරණ පුවරු සැකිලි දර්ශකය

source: Users can create and save dashboard templates. Additionally, administrators can create selectable templates for the community and select a default to be used by new users.
si_lk: පරිශීලකයින්ට උපකරණ පුවරු සැකිලි නිර්මාණය කර සුරැකිය හැක. අතිරේකව, පරිපාලකයින්ට ප්‍රජාව සඳහා තෝරාගත හැකි සැකිලි නිර්මාණය කළ හැකි අතර නව පරිශීලකයින් විසින් භාවිතා කිරීමට පෙරනිමියක් තෝරාගත හැක.

source: Are you sure you want to remove this dashboard template?
si_lk: ඔබට මෙම උපකරණ පුවරු අච්චුව ඉවත් කිරීමට අවශ්‍ය බව විශ්වාසද?

source: Save Dashboard Template
si_lk: උපකරණ පුවරු අච්චුව සුරකින්න

source: Template Name
si_lk: සැකිල්ල නම

source: Restrict to organisation
si_lk: සංවිධානයට සීමා කරන්න

source: Restrict to role
si_lk: භූමිකාවට සීමා කරන්න

source: Restrict to role permission flag
si_lk: භූමිකාව අවසර ධජයට සීමා කරන්න

source: Save your current dashboard state as a template for others to reuse.
si_lk: ඔබගේ වර්තමාන උපකරණ පුවරුවේ තත්වය අන් අයට නැවත භාවිතා කිරීමට අච්චුවක් ලෙස සුරකින්න.

source: Decaying Model
si_lk: දිරාපත් වන ආකෘතිය

source: You are editing a Default Model, only restricted edition is allowed.
si_lk: ඔබ පෙරනිමි ආකෘතියක් සංස්කරණය කරයි, සීමා කළ සංස්කරණයට පමණක් අවසර ඇත.

source: Can other organization use this model
si_lk: වෙනත් ආයතනයකට මෙම ආකෘතිය භාවිතා කළ හැකිද?

source: days
si_lk: දින

source: The end of life of the indicator
si_lk: දර්ශකයේ ජීවිතයේ අවසානය

source: float
si_lk: පාවෙන

source: The decay speed of the indicator
si_lk: දර්ශකයේ ක්ෂය වීමේ වේගය

source: The model threshold of the indicator
si_lk: දර්ශකයේ ආදර්ශ සීමාව

source: Default base_score
si_lk: පෙරනිමි මූලික_ලකුණු

source: Default base_score value if no tags are attached to the indicator
si_lk: දර්ශකයට ටැග් අමුණා නොමැති නම් පෙරනිමි මූලික_ලකුණු අගය

source: The model default base_score of the indicator
si_lk: දර්ශකයේ ආදර්ශ පෙරනිමි පාදක_ලකුණු

source: Base Score configuration
si_lk: මූලික ලකුණු වින්‍යාසය

source: Model Settings
si_lk: ආදර්ශ සැකසුම්

source: Show All Types
si_lk: සියලුම වර්ග පෙන්වන්න

source: Show MISP Objects
si_lk: MISP වස්තු පෙන්වන්න

source: Search Attribute Type
si_lk: සෙවුම් ගුණාංග වර්ගය

source: Check all
si_lk: සියල්ල පරීක්ෂා කරන්න

source: Attribute Type
si_lk: ගුණාංග වර්ගය

source: Model ID
si_lk: ආදර්ශ හැඳුනුම්පත

source: Belong to a MISP Object
si_lk: MISP වස්තුවකට අයත් වේ

source: To IDS flag set
si_lk: IDS ධජ කට්ටලයට

source: Adjust base score
si_lk: මූලික ලකුණු සකසන්න

source: Simulate this model
si_lk: මෙම ආකෘතිය අනුකරණය කරන්න

source: Model's Settings
si_lk: මාදිලියේ සැකසුම්

source: Create
si_lk: නිර්මාණය කරන්න

source: All available models
si_lk: පවතින සියලුම මාදිලි

source: My models
si_lk: මගේ ආකෘති

source: Default models
si_lk: පෙරනිමි ආකෘති

source: Search Taxonomy
si_lk: වර්ගීකරණය සොයන්න

source: Clear search field
si_lk: සෙවුම් ක්ෂේත්‍රය හිස් කරන්න

source: not having numerical value
si_lk: සංඛ්‍යාත්මක අගයක් නොමැති වීම

source: Default basescore
si_lk: පෙරනිමි මූලික ලකුණු

source: Taxonomies
si_lk: වර්ගීකරණය

source: Weight
si_lk: බර

source: Numerical value overriden by userSetting.&#10;Original numerical_value = %s
si_lk: සංඛ්‍යාත්මක අගය userSetting මගින් අභිබවා යයි.&#10;මුල් සංඛ්‍යාත්මක_අගය = %s

source: Excluded
si_lk: බැහැර කර ඇත

source: Placeholder for `Organisation source confidence`
si_lk: 'සංවිධාන මූලාශ්‍ර විශ්වාසය' සඳහා ස්ථාන දරණුව

source: Example
si_lk: උදාහරණයක්

source: Pick a Taxonomy
si_lk: වර්ගීකරණයක් තෝරන්න

source: Computation steps
si_lk: ගණනය කිරීමේ පියවර

source: Apply base score
si_lk: මූලික ලකුණු යොදන්න

source: Event Tags
si_lk: සිදුවීම් ටැග්

source: Score
si_lk: ලකුණු

source: Failed to perform RestSearch
si_lk: RestSearch සිදු කිරීමට අසමත් විය

source: Decaying Model RestSearch
si_lk: ක්ෂය වෙමින් පවතින ආදර්ශ RestSearch

source: Search
si_lk: සොයන්න

source: Specific Attribute
si_lk: විශේෂිත ගුණාංගය

source: Attribute ID or UUID
si_lk: උපලක්ෂණ ID හෝ UUID

source: Simulate
si_lk: අනුකරණය කරන්න

source: Base score
si_lk: මූලික ලකුණු

source: Base score configuration
si_lk: මූලික ලකුණු වින්‍යාසය

source: not set. But default value sets.
si_lk: සකසා නැත. නමුත් default value sets.

source: not set
si_lk: සකසා නැත

source: Sighting
si_lk: පෙනීම

source: Current score
si_lk: වත්මන් ලකුණු

source: Basescore computation steps
si_lk: මූලික ලකුණු ගණනය කිරීමේ පියවර

source: Failed to perform the simulation
si_lk: අනුකරණය සිදු කිරීමට අපොහොසත් විය

source: Import model data
si_lk: ආකෘති දත්ත ආයාත කරන්න

source: Paste a MISP model JSON or provide a JSON file below to add models.
si_lk: MISP ආකෘතියක් JSON අලවන්න හෝ ආකෘති එක් කිරීමට පහත JSON ගොනුවක් සපයන්න.

source: Model JSON
si_lk: JSON ආකෘතිය

source: JSON file
si_lk: JSON ගොනුව

source: Decaying Models
si_lk: දිරාපත් වන ආකෘති

source: All Models
si_lk: සියලුම මාදිලි

source: My models only
si_lk: මගේ ආකෘති පමණි

source: My Models
si_lk: මගේ ආකෘති

source: Models available to everyone
si_lk: සෑම කෙනෙකුටම ලබා ගත හැකි මාදිලි

source: Shared Models
si_lk: හවුල් ආකෘති

source: Default models only
si_lk: පෙරනිමි ආකෘති පමණි

source: Default Models
si_lk: පෙරනිමි මාදිලි

source: Organization
si_lk: ආයතනය

source: Usable to everyone
si_lk: සෑම කෙනෙකුටම භාවිතා කළ හැකිය

source: Pretty print
si_lk: ලස්සන මුද්‍රණය

source: Formula
si_lk: සූත්රය

source: # Assigned Types
si_lk: # පවරා ඇති වර්ග

source: Version
si_lk: පිටපත

source: Enabled
si_lk: සබල කර ඇත

source: Actions
si_lk: ක්රියාවන්

source: Default Model from MISP Project
si_lk: MISP ව්‍යාපෘතියෙන් පෙරනිමි ආකෘතිය

source: Download model
si_lk: ආකෘතිය බාගත කරන්න

source: Are you sure you want to delete DecayingModel #
si_lk: ඔබට DecayingModel # මැකීමට අවශ්‍ය බව විශ්වාසද

source: Are you sure you want to disable DecayingModel #
si_lk: ඔබට DecayingModel # අබල කිරීමට අවශ්‍ය බව විශ්වාසද

source: Are you sure you want to enable DecayingModel #
si_lk: ඔබට DecayingModel # සබල කිරීමට අවශ්‍ය බව විශ්වාසද

source: Creator org
si_lk: නිර්මාපක සංවිධානය

source: All orgs
si_lk: සියලුම ආයතන

source: Reference(s)
si_lk: යොමු(ය)

source: Associated types
si_lk: ආශ්රිත වර්ග

source: Disable model
si_lk: ආකෘතිය අක්රිය කරන්න

source: Enable model
si_lk: ආකෘතිය සක්රිය කරන්න

source: Add DecayingModelMapping
si_lk: DecayingModelMapping එක් කරන්න

source: Add tag
si_lk: ටැගය එක් කරන්න

source: Missing taxonomies: <span class="red bold">%s</span><br>
si_lk: නැතිවූ වර්ගීකරණ: <span class="red bold">%s</span><br>

source: Local tag
si_lk: දේශීය ටැගය

source: Global tag
si_lk: ගෝලීය ටැගය

source: Remove tag %s
si_lk: ටැගය %sඉවත් කරන්න

source: Add a tag
si_lk: ටැග් එකක් එකතු කරන්න

source: Add a local tag
si_lk: දේශීය ටැගයක් එක් කරන්න

source: view all
si_lk: සියල්ල බලන්න

source: Select all
si_lk: සියල්ල තෝරන්න

source: Select all attributes/proposals on current page
si_lk: වත්මන් පිටුවේ ඇති සියලුම ගුණාංග/යෝජනා තෝරන්න

source: First seen
si_lk: මුලින්ම දැක්කේ

source: Last seen
si_lk: අන්තිමට දැක්කේ

source: Related Tags
si_lk: අදාළ ටැග්

source: Decaying Score
si_lk: දිරාපත් වන ලකුණු

source: Attribute warning: This event doesn't have any attributes visible to you. Either the owner of the event decided to have a specific distribution scheme per attribute and wanted to still distribute the event alone either for notification or potential contribution with attributes without such restriction. Or the owner forgot to add the attributes or the appropriate distribution level. If you think there is a mistake or you can contribute attributes based on the event meta-information, feel free to make a proposal
si_lk: උපලක්ෂණ අනතුරු ඇඟවීම: මෙම සිදුවීමට ඔබට දෘශ්‍යමාන කිසිදු උපලක්ෂණයක් නොමැත. එක්කෝ සිද්ධියේ හිමිකරු එක් එක් නිශ්චිත බෙදාහැරීමේ ක්‍රමයක් ඇති කිරීමට තීරණය කර ඇති අතර, දැනුම්දීම සඳහා හෝ එවැනි සීමාවකින් තොරව උපලක්ෂණ සමඟ විභව දායකත්වය සඳහා සිදුවීම පමණක් බෙදා හැරීමට අවශ්‍ය විය. නැතහොත් හිමිකරුට ගුණාංග හෝ සුදුසු බෙදාහැරීමේ මට්ටම එක් කිරීමට අමතක විය. ඔබ වරදක් ඇතැයි සිතන්නේ නම් හෝ ඔබට සිදුවීම් පාර-තොරතුරු මත පදනම්ව උපලක්ෂණ දායක විය හැකි නම්, යෝජනාවක් කිරීමට නිදහස් වන්න

source: Attribute warning: This event doesn't contain any attribute. It's strongly advised to populate the event with attributes (indicators, observables or information) to provide a meaningful event
si_lk: ගුණාංග අනතුරු ඇඟවීම: මෙම සිදුවීමෙහි කිසිදු ගුණාංගයක් අඩංගු නොවේ. අර්ථවත් සිදුවීමක් සැපයීම සඳහා ගුණාංග (දර්ශක, නිරීක්ෂණය කළ හැකි හෝ තොරතුරු) සමඟ සිදුවීම ජනනය කිරීමට දැඩි ලෙස උපදෙස් දෙනු ලැබේ.

source: Show all attributes
si_lk: සියලු ගුණාංග පෙන්වන්න

source: Only show %s related attributes
si_lk: අදාළ ගුණාංග %s පමණක් පෙන්වන්න

source: Only show proposals
si_lk: යෝජනා පමණක් පෙන්වන්න

source: Proposal
si_lk: යෝජනාව

source: Only show correlating attributes
si_lk: සහසම්බන්ධ ගුණාංග පමණක් පෙන්වන්න

source: Correlation
si_lk: සහසම්බන්ධය

source: Only show potentially false positive attributes
si_lk: ව්‍යාජ ධනාත්මක ගුණාංග පමණක් පෙන්වන්න

source: Warning
si_lk: අවවාදයයි

source: Add attribute
si_lk: ගුණාංගය එක් කරන්න

source: Add proposal
si_lk: යෝජනාව එකතු කරන්න

source: Edit selected Attributes
si_lk: තෝරාගත් ගුණාංග සංස්කරණය කරන්න

source: Tag selected Attributes
si_lk: තෝරාගත් ගුණාංග ටැග් කරන්න

source: Add new cluster to selected Attributes
si_lk: තෝරාගත් Attributes වෙත නව පොකුරක් එක් කරන්න

source: Group selected Attributes into an Object
si_lk: සමූහයක් තෝරාගත් ගුණාංග වස්තුවක් බවට පත් කරන්න

source: Delete selected Attributes
si_lk: තෝරාගත් ගුණාංග මකන්න

source: Accept selected Proposals
si_lk: තෝරාගත් යෝජනා පිළිගන්න

source: Discard selected Proposals
si_lk: තෝරාගත් යෝජනා ඉවතලන්න

source: Sightings display for selected attributes
si_lk: තෝරාගත් ගුණාංග සඳහා දර්ශන සංදර්ශනය

source: Populate using a template
si_lk: අච්චුවක් භාවිතයෙන් ජනගත කරන්න

source: Populate using the freetext import tool
si_lk: නිදහස් පෙළ ආයාත මෙවලම භාවිතයෙන් ජනගත කරන්න

source: Replace all attributes of a category/type combination within the event
si_lk: සිදුවීම තුළ ප්‍රවර්ග/වර්ග සංයෝජනයක සියලුම ගුණාංග ප්‍රතිස්ථාපනය කරන්න

source: Use a list of simple scopes to filter the data
si_lk: දත්ත පෙරීමට සරල විෂය පථ ලැයිස්තුවක් භාවිතා කරන්න

source: Scope toggle
si_lk: විෂය පථය මාරු කිරීම

source: Include deleted attributes
si_lk: මකා දැමූ ගුණාංග ඇතුළත් කරන්න

source: Deleted
si_lk: මකා දමන ලදී

source: Show attribute decaying score
si_lk: ගුණාංග දිරායන ලකුණු පෙන්වන්න

source: Decay score
si_lk: ක්ෂය ලකුණු

source: Show SightingDB lookup results
si_lk: SightingDB සෙවීම් ප්‍රතිඵල පෙන්වන්න

source: Show attribute context fields
si_lk: ගුණාංග සන්දර්භය ක්ෂේත්‍ර පෙන්වන්න

source: Context
si_lk: සන්දර්භය

source: Show related tags
si_lk: අදාළ ටැග් පෙන්වන්න

source: Advanced filtering tool
si_lk: උසස් පෙරහන මෙවලම

source: Filtering tool
si_lk: පෙරීමේ මෙවලම

source: %s active rule(s)
si_lk: %s ක්‍රියාකාරී රීති(ය)

source: Remove filters
si_lk: පෙරහන් ඉවත් කරන්න

source: Discussion
si_lk: සාකච්ඡා

source: Date:
si_lk: දිනය:

source: Top
si_lk: ඉහළට

source: Deactivated user
si_lk: අක්‍රිය කළ පරිශීලක

source: Message edited at %s
si_lk: පණිවිඩය %sට සංස්කරණය කරන ලදී

source: User
si_lk: පරිශීලක

source: Are you sure you want to delete this post?
si_lk: ඔබට මෙම පළ කිරීම මැකීමට අවශ්‍ය බව විශ්වාසද?

source: Reply
si_lk: පිලිතුරු

source: Insert a quote - just paste your quote between the [quote][/quote] tags.
si_lk: උද්ධෘතයක් ඇතුළු කරන්න - ඔබගේ උද්ධෘතය ටැග් [quote][/quote] අතර අලවන්න.

source: Quote
si_lk: උපුටා ගැනීම

source: Insert a link to an event - just enter the event ID between the [event][/event] tags.
si_lk: සිදුවීමකට සබැඳියක් ඇතුළු කරන්න - [event][/event] ටැග් අතර සිදුවීම් හැඳුනුම ඇතුළත් කරන්න.

source: Insert a link to a discussion thread - enter the thread's ID between the [thread][/thread] tags.
si_lk: සාකච්ඡා ත්‍රෙඩ් එකකට සබැඳියක් ඇතුළු කරන්න - [thread][/thread] ටැග් අතර නූල් හැඳුනුම්පත ඇතුළත් කරන්න.

source: Thread
si_lk: නූල්

source: Insert a link [link][/link] tags.
si_lk: සබැඳියක් [link][/link] ටැග් ඇතුළු කරන්න.

source: Link
si_lk: සබැඳිය

source: Insert a code [code][/code] tags.
si_lk: [code][/code] ටැග් කේතයක් ඇතුළු කරන්න.

source: Code
si_lk: කේතය

source: Send comment
si_lk: අදහස් එවන්න

source: Errors
si_lk: දෝෂ

source: Close
si_lk: වසන්න

source: Show keyboard shortcuts help
si_lk: යතුරුපුවරු කෙටිමං උදව් පෙන්වන්න

source: Keyboard shortcuts for this page
si_lk: මෙම පිටුව සඳහා යතුරුපුවරු කෙටිමං

source: none
si_lk: කිසිවක් නැත

source: Could not locate the PGP public key.
si_lk: PGP පොදු යතුර සොයා ගැනීමට නොහැකි විය.

source: S/MIME certificate
si_lk: S/MIME සහතිකය

source: Could not locate S/MIME certificate.
si_lk: S/MIME සහතිකය සොයා ගැනීමට නොහැකි විය.

source: First seen date
si_lk: මුලින්ම දුටු දිනය

source: Last seen date
si_lk: අවසන් වරට දුටු දිනය

source: First seen time
si_lk: මුලින්ම දුටු කාලය

source: Expected format: HH:MM:SS.ssssss+TT:TT
si_lk: අපේක්ෂිත ආකෘතිය: HH:MM:SS.ssssss+TT:TT

source: Last seen time
si_lk: අවසන් වරට දුටු කාලය

source: View details about this galaxy
si_lk: මෙම මන්දාකිණිය පිළිබඳ විස්තර බලන්න

source: View galaxy
si_lk: මන්දාකිණිය බලන්න

source: Local galaxy
si_lk: දේශීය මන්දාකිණිය

source: Global galaxy
si_lk: ගෝලීය මන්දාකිණිය

source: View details about this cluster
si_lk: මෙම පොකුර පිළිබඳ විස්තර බලන්න

source: View cluster
si_lk: පොකුර බලන්න

source: View all events containing this cluster
si_lk: මෙම පොකුර අඩංගු සියලුම සිදුවීම් බලන්න
