Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: The number of attributes that the event has.
si_lk: සිදුවීමට ඇති ගුණාංග ගණන.

source: The e-mail address of the event's reporter. This is not visible to regular users. Organisation administrators can see the e-mail addresses of their own organisation's users.
si_lk: සිද්ධිය වාර්තාකරුගේ ඊමේල් ලිපිනය. මෙය සාමාන්‍ය පරිශීලකයින්ට නොපෙනේ. සංවිධානයේ පරිපාලකයින්ට ඔවුන්ගේම සංවිධානයේ පරිශීලකයින්ගේ විද්‍යුත් තැපැල් ලිපිනයන් දැකිය හැක.

source: The date of the attack.
si_lk: ප්රහාරය සිදු වූ දිනය.

source: The risk level of the attack, the following levels are possible
si_lk: ප්රහාරයේ අවදානම් මට්ටම, පහත මට්ටම් හැකි ය

source: General Malware
si_lk: සාමාන්‍ය අනිෂ්ට මෘදුකාංග

source: Advanced Persistent Threats (APTs)
si_lk: උසස් ස්ථීර තර්ජන (APTs)

source: Sophisticated APTs and 0day exploits<
si_lk: නවීන APTs සහ 0day exploits<

source: This field can be left undefined and edited at a later date.
si_lk: මෙම ක්ෂේත්‍රය අර්ථ දැක්වීමකින් තොරව ඉතිරි කර පසු දිනකදී සංස්කරණය කළ හැක.

source: A short description of the event, starting with an internal reference number.
si_lk: අභ්‍යන්තර යොමු අංකයකින් ආරම්භ වන සිදුවීම පිළිබඳ කෙටි විස්තරයක්.

source: This field indicates what the sharing privileges of the event. The options are described <a href="#distribution">here</a>.
si_lk: මෙම ක්ෂේත්‍රයෙන් පෙන්නුම් කරන්නේ සිදුවීමේ බෙදාගැනීමේ වරප්‍රසාද මොනවාද යන්නයි. විකල්ප විස්තර කර ඇත <a href="#distribution">මෙහි</a>.

source: The controls that the user has to view or modify the event. The possible actions that are available (depending on user privileges - %s to find out more about privileges)
si_lk: පරිශීලකයාට සිදුවීම බැලීමට හෝ වෙනස් කිරීමට ඇති පාලන. ලබා ගත හැකි ක්‍රියා (පරිශීලක වරප්‍රසාද මත පදනම්ව - %s වරප්‍රසාද ගැන වැඩි විස්තර දැන ගැනීමට)

source: Publishing an event will have several effects: The system will e-mail all eligible users that have auto-alert turned on (and having the needed privileges for the event, depending on its private classification) with a description of your newly published event, it will be flagged as published and it will be pushed to all eligible servers (to read more about synchronisation between servers, have a look at the %s).
si_lk: සිදුවීමක් ප්‍රකාශයට පත් කිරීම ප්‍රතිවිපාක කිහිපයක් ඇති කරයි: පද්ධතිය ස්වයංක්‍රීය ඇඟවීම් ක්‍රියාත්මක කර ඇති (සහ එහි පුද්ගලික වර්ගීකරණය මත පදනම්ව, සිද්ධිය සඳහා අවශ්‍ය වරප්‍රසාද ඇති) සියලුම සුදුසුකම් ලත් පරිශීලකයින්ට ඔබේ අලුතින් ප්‍රකාශිත සිදුවීම පිළිබඳ විස්තරයක් සමඟ විද්‍යුත් තැපෑලෙන් එවනු ලැබේ. ප්‍රකාශිත ලෙස සලකුණු කරනු ලබන අතර එය සියලුම සුදුසුකම් ලත් සේවාදායකයන් වෙත තල්ලු කරනු ලැබේ (සේවාදායකයන් අතර සමමුහුර්තකරණය පිළිබඳ වැඩිදුර කියවීමට, %sදෙස බලන්න).

source: section on connecting servers
si_lk: සේවාදායක සම්බන්ධ කිරීම පිළිබඳ කොටස

source: Clicking on the edit button will bring up the same screen as the one used for creating new events, with the exception that all fields come filled out with the data of the event that is being edited. The distribution of an event can only be edited if you are a user of the creating organisation of the event. For more information on this view, refer to the section on <a href="#create">creating an event</a>.
si_lk: සංස්කරණ බොත්තම මත ක්ලික් කිරීමෙන් නව සිදුවීම් නිර්මාණය කිරීම සඳහා භාවිතා කරන තිරය හා සමාන තිරයක් ගෙන එනු ඇත, හැර සියලුම ක්ෂේත්‍ර සංස්කරණය කරනු ලබන සිදුවීමේ දත්ත වලින් පිරී ඇත. සිදුවීමක් බෙදා හැරීම සංස්කරණය කළ හැක්කේ ඔබ සිදුවීම නිර්මාණය කිරීමේ සංවිධානයේ පරිශීලකයෙකු නම් පමණි. මෙම දර්ශනය පිළිබඳ වැඩි විස්තර සඳහා, සිදුවීමක්</a>නිර්මාණය කිරීම පිළිබඳ <a href="#create">කොටස බලන්න.

source: The system will prompt you before erasing the unwanted event.
si_lk: අනවශ්‍ය සිදුවීම මකා දැමීමට පෙර පද්ධතිය ඔබෙන් විමසනු ඇත.

source: Will bring up the event view, which besides the basic information contained in the event list, will also include the following
si_lk: සිදුවීම් ලැයිස්තුවේ අඩංගු මූලික තොරතුරු වලට අමතරව පහත දෑ ද ඇතුළත් වන සිදුවීම් දසුන ගෙන එනු ඇත

source: It is also possible to filter the events shown by clicking on the small magnifying glass icons next to the field names and entering a filter term.
si_lk: ක්ෂේත්‍ර නාම අසල ඇති කුඩා විශාලන වීදුරු අයිකන මත ක්ලික් කර පෙරහන් පදයක් ඇතුළත් කිරීමෙන් පෙන්වන සිදුවීම් පෙරීමටද හැකිය.

source: Event view
si_lk: සිදුවීම් දසුන

source: This view includes the basic information about an event, a link to related events, all attributes and attachments with tools to modify or delete them and extra functions for publishing the event or getting in touch with the event's reporter.
si_lk: මෙම දර්ශනයට සිදුවීමක් පිළිබඳ මූලික තොරතුරු, අදාළ සිදුවීම් වෙත සබැඳියක්, ඒවා වෙනස් කිරීමට හෝ මකා දැමීමට මෙවලම් සහිත සියලු ගුණාංග සහ ඇමුණුම් සහ සිදුවීම ප්‍රකාශයට පත් කිරීම හෝ සිද්ධියේ වාර්තාකරු සමඟ සම්බන්ධ වීමට අමතර කාර්යයන් ඇතුළත් වේ.

source: General Event Information
si_lk: සාමාන්ය සිදුවීම් තොරතුරු

source: The ID of the event.
si_lk: සිද්ධියේ හැඳුනුම්පත.

source: In order to avoid collisions between events and attributes (during for example a sync) a Uuid is assigned that uniquely identifies each of them.
si_lk: සිදුවීම් සහ ගුණාංග අතර ගැටීම් වලක්වා ගැනීම සඳහා (උදාහරණයක් ලෙස සමමුහුර්ත කිරීමේදී) Uuid එකක් පවරනු ලබන අතර එය ඒ සෑම එකක්ම අනන්‍ය ලෙස හඳුනා ගනී.

source: The organisation that has originally created the event. The logo (if it exists on the server, alternatively a string) representing the organisation is also shown int he right upper corner.
si_lk: මෙම සිද්ධිය මුලින් නිර්මාණය කළ සංවිධානය. සංවිධානය නියෝජනය කරන ලාංඡනය (එය සේවාදායකයේ තිබේ නම්, විකල්ප වශයෙන් තන්තුවක්) දකුණු ඉහළ කෙළවරේ ද පෙන්වයි.

source: Shows a list of the organisations that have contributed to the event via proposals. If you click any of the logos listed here, you'll get redirected to a filtered event history view, including only the changes made by the organisation.
si_lk: යෝජනා හරහා උත්සවයට දායක වූ සංවිධාන ලැයිස්තුවක් පෙන්වයි. ඔබ මෙහි ලැයිස්තුගත කර ඇති ඕනෑම ලාංඡනයක් ක්ලික් කළහොත්, සංවිධානය විසින් සිදු කරන ලද වෙනස්කම් පමණක් ඇතුළුව පෙරහන් කළ සිදුවීම් ඉතිහාස දසුනකට ඔබව හරවා යවනු ලැබේ.

source: A list of tags associated with the event. Clicking a tag will show a list of events with the same tag attached. The little cross next to each tag allows you to remove the tag from the event, whilst the '+' button allows you to assign a tag. For the latter two options to be visible, you have to have tagging permission.
si_lk: සිදුවීම හා සම්බන්ධ ටැග් ලැයිස්තුවක්. ටැගයක් ක්ලික් කිරීමෙන් එකම ටැගය අමුණා ඇති සිදුවීම් ලැයිස්තුවක් පෙන්වනු ඇත. එක් එක් ටැගය අසල ඇති කුඩා කුරුසය ඔබට සිදුවීමෙන් ටැගය ඉවත් කිරීමට ඉඩ සලසයි, '+' බොත්තම ඔබට ටැගයක් පැවරීමට ඉඩ දෙයි. අවසාන විකල්ප දෙක දෘශ්‍යමාන වීමට නම්, ඔබට ටැග් කිරීමේ අවසරය තිබිය යුතුය.

source: The date of detection, set by the user that creates the event, not to be confused with the creation date of the event.
si_lk: සිද්ධිය නිර්මාණය කරන පරිශීලකයා විසින් සකසන ලද හඳුනාගැනීමේ දිනය, සිද්ධිය නිර්මාණය කළ දිනය සමඟ පටලවා නොගත යුතුය.

source: The assigned threat level of the event.
si_lk: සිදුවීමේ පවරන ලද තර්ජන මට්ටම.

source: The status of the analysis.
si_lk: විශ්ලේෂණයේ තත්ත්වය.

source: This shows the distribution rules applied to this event, controlling whether only the creating organisation can see (Your organisation only) it or everyone on the instance (This community only). The two remaining settings allow the event to be propagated to organisations on remote connected instances.
si_lk: නිර්මාණය කරන ආයතනයට පමණක් (ඔබේ සංවිධානයට පමණක්) එය හෝ එම අවස්ථාවෙහි සිටින සියල්ලන්ටම (මෙම ප්‍රජාවට පමණක්) දැකිය හැකිද යන්න පාලනය කරමින් මෙම සිදුවීමට අදාළ බෙදා හැරීමේ නීති මෙය පෙන්වයි. ඉතිරිව ඇති සිටුවම් දෙක දුරස්ථ සම්බන්ධිත අවස්ථාවන්හිදී ආයතන වෙත සිදුවීම ප්‍රචාරය කිරීමට ඉඩ සලසයි.

source: A short description of the event itself. Make sure not to put information in here that could be used for correlation purposes and be better suited as an Attribute.
si_lk: සිදුවීම පිළිබඳ කෙටි විස්තරයක්. සහසම්බන්ධතා අරමුණු සඳහා භාවිතා කළ හැකි සහ ගුණාංගයක් ලෙස වඩාත් සුදුසු තොරතුරු මෙහි ඇතුළත් නොකිරීමට වග බලා ගන්න.

source: Whether the event has been published or not. Publishing allows the attributes of the event to be used for all eligible exports and it notifies users that have subscribed to the event alerts. Also, a publish initiates a push to all eligible instances.
si_lk: සිදුවීම ප්‍රකාශයට පත් කර ඇතත් නැතත්. ප්‍රකාශනය සියලුම සුදුසුකම් ලත් අපනයන සඳහා සිදුවීමේ ගුණාංග භාවිතා කිරීමට ඉඩ දෙන අතර එය සිදුවීම් ඇඟවීම් සඳහා දායක වී ඇති පරිශීලකයින්ට දැනුම් දෙයි. එසේම, ප්‍රකාශනයක් සියලුම සුදුසුකම් ලත් අවස්ථා වෙත තල්ලුවක් ආරම්භ කරයි.

source: List of Related Events
si_lk: අදාළ සිදුවීම් ලැයිස්තුව

source: The list of relations is shown on the right hand side of the general event information. Events can be related by having one or more attributes that are exact matches. For example, if two events both contain a source IP attribute of 11.11.11.11 then they are related. The list of events that are related the currently shown one, are listed under "Related Events", as links (titled the related event's date and ID number) to the events themselves.
si_lk: සම්බන්ධතා ලැයිස්තුව සාමාන්‍ය සිද්ධි තොරතුරුවල දකුණු පැත්තේ පෙන්වා ඇත. හරියටම ගැළපෙන ගුණාංග එකක් හෝ කිහිපයක් තිබීමෙන් සිදුවීම් සම්බන්ධ කළ හැක. උදාහරණයක් ලෙස, සිදුවීම් දෙකෙහිම 11.11.11.11 හි මූලාශ්‍ර IP උපලක්ෂණයක් අඩංගු වේ නම් ඒවා සම්බන්ධ වේ. දැනට පෙන්වන එක හා සම්බන්ධ සිදුවීම් ලැයිස්තුව, "අදාළ සිදුවීම්" යටතේ ලැයිස්තුගත කර ඇත්තේ, සිදුවීම් වලටම සබැඳි (අදාළ සිදුවීමේ දිනය සහ හැඳුනුම්පත අංකය) ලෙසය.

source: Data Element Toggles
si_lk: දත්ත මූලද්‍රව්‍ය ටොගල්

source: You can control some of the data that is shown on this page using three toggles. The elements that can be disabled are the pivot threads, the attributes (and proposals) and the Discussions. You can collapse these elements and then expand them again using the same button.
si_lk: ටොගල් තුනක් භාවිතයෙන් ඔබට මෙම පිටුවේ පෙන්වන සමහර දත්ත පාලනය කළ හැක. අක්‍රිය කළ හැකි මූලද්‍රව්‍ය වන්නේ විවර්තන නූල්, ගුණාංග (සහ යෝජනා) සහ සාකච්ඡා ය. ඔබට මෙම මූලද්‍රව්‍ය හැකිලීමට සහ එම බොත්තම භාවිතයෙන් නැවත ඒවා පුළුල් කළ හැක.

source: Pivot Threads
si_lk: විවර්තන නූල්

source: While moving from event to event through the relation links (a process that we refer to as pivoting), you create a path that shows which events you have traversed. This path is reset by leaving the event view and navigating elsewhere in the application or by deleting the root pivot element.
si_lk: සම්බන්ධතා සබැඳි (අපි හැරවීම ලෙස හඳුන්වන ක්‍රියාවලියක්) හරහා සිදුවීමෙන් සිදුවීමට ගමන් කරන අතරතුර, ඔබ කුමන සිදුවීම් පසුකර ඇත්දැයි පෙන්වන මාර්ගයක් සාදන්න. මෙම මාර්ගය සිද්ධි දසුනෙන් ඉවත් වී යෙදුමේ වෙනත් ස්ථානයකට සංචාලනය කිරීමෙන් හෝ මූල විවර්තන මූලද්‍රව්‍යය මකා දැමීමෙන් නැවත සකසනු ලැබේ.

source: Each event visited is represented by a bubble in the pivot thread graph, connected by lines that show how the user has arrived at the next connected event. It is possible to jump back to an earlier relation and pivot to another event through that, creating branches in the graph.
si_lk: සංචාරය කරන ලද සෑම සිදුවීමක්ම විවර්තන නූල් ප්‍රස්ථාරයේ බුබුලකින් නියෝජනය වන අතර, ඊළඟ සම්බන්ධිත සිදුවීමට පරිශීලකයා පැමිණ ඇති ආකාරය පෙන්වන රේඛා මගින් සම්බන්ධ කර ඇත. ප්‍රස්ථාරයේ අතු ඇති කරමින් පෙර සම්බන්ධතාවයකට ආපසු පැන ඒ හරහා වෙනත් සිදුවීමකට හැරවිය හැකිය.

source: The currently selected event is coloured blue in the graph. If you would like to delete an element from the graph (including all of elements that branch off of it) just click on the small x within a pivot bubble. For a deletion to be possible the following conditions have to be met
si_lk: දැනට තෝරන ලද සිදුවීම ප්‍රස්ථාරයේ නිල් පැහැයෙන් වර්ණවත් කර ඇත. ඔබ ප්‍රස්ථාරයෙන් මූලද්‍රව්‍යයක් මකා දැමීමට කැමති නම් (එයින් අතු බෙදී යන සියලුම මූලද්‍රව්‍ය ඇතුළුව) විවර්තන බුබුලක් තුළ ඇති කුඩා x මත ක්ලික් කරන්න. මකාදැමීමක් සිදුකිරීමට නම් පහත කොන්දේසි සපුරාලිය යුතුය

source: The pivot element to be deleted cannot be on the path that leads to the currently selected event
si_lk: මකා දැමිය යුතු විවර්තන මූලද්‍රව්‍යය දැනට තෝරාගෙන ඇති සිදුවීමට යන මාර්ගයේ තිබිය නොහැක

source: The pivot element residing in the graph's root can always be deleted - this will simply reset the current pivot thread
si_lk: ප්‍රස්ථාරයේ මූලයේ පවතින විවර්තන මූලද්‍රව්‍යය සැම විටම මකා දැමිය හැක - මෙය සරලව වත්මන් විවර්තන නූල නැවත සකසනු ඇත

source: Attributes and Proposals
si_lk: ගුණාංග සහ යෝජනා

source: A list of all attributes and proposals attached to the event. The fields for each of them only differ in the available actions and the fact that for proposals to attributes all fields are blank that would stay unchanged if the proposal was accepted (for example, proposing a change to an attribute to turn the IDS flag on will have all fields apart from the IDS flag blank in the proposal. Here is a list of what each of the fields represents
si_lk: උත්සවයට අමුණා ඇති සියලුම ගුණාංග සහ යෝජනා ලැයිස්තුවක්. ඒ සෑම එකක් සඳහාම ක්ෂේත්‍ර වෙනස් වන්නේ පවතින ක්‍රියාවලින් පමණක් වන අතර යෝජනා සඳහා සියලු ක්ෂේත්‍ර හිස්ව ඇති අතර එය යෝජනාව පිළිගත්තේ නම් නොවෙනස්ව පවතිනු ඇත (උදාහරණයක් ලෙස, IDS ධජය ක්‍රියාත්මක කිරීම සඳහා ගුණාංගයකට වෙනස් කිරීමක් යෝජනා කිරීම කැමැත්ත යෝජනාවේ IDS ධජය හැරුණු විට සියලුම ක්ෂේත්‍ර හිස්ව තබන්න. එක් එක් ක්ෂේත්‍ර නියෝජනය කරන දේ ලැයිස්තුවක් මෙන්න

source: The date of the last modification to the attribute. Proposals don't have a date of last edit.
si_lk: ගුණාංගයට අවසාන වෙනස් කළ දිනය. යෝජනාවලට අවසන් සංස්කරණයේ දිනයක් නොමැත.

source: The category of the attribute or proposal. For a list of possible categories visit the section on <a href="%s/pages/display/doc/categories_and_types">categories and types</a>.
si_lk: ගුණාංගයේ හෝ යෝජනාවේ ප්‍රවර්ගය. හැකි ප්‍රවර්ග ලැයිස්තුවක් සඳහා <a href="%s/pages/display/doc/categories_and_types">කාණ්ඩ සහ වර්ග</a>කොටසට පිවිසෙන්න.

source: The type of the attribute or proposal. For a list of possible categories visit the section on <a href="%s/pages/display/doc/categories_and_types">categories and types</a>.
si_lk: ගුණාංගයේ හෝ යෝජනාවේ වර්ගය. හැකි ප්‍රවර්ග ලැයිස්තුවක් සඳහා <a href="%s/pages/display/doc/categories_and_types">කාණ්ඩ සහ වර්ග</a>කොටසට පිවිසෙන්න.

source: The value or value-pair of the attribute. This is the main payload of the attribute, which is described by the category and type columns. For certain types of attributes that are made up of value-pairs the two parts will be split by a pipe (|), such as for filename|md5. The value field(s) are used by the correlation engine to find relations between events. In value-pair attributes both values are correlated individually.
si_lk: ගුණාංගයේ අගය හෝ අගය යුගලය. ප්‍රවර්ගය සහ තීරු වර්ග අනුව විස්තර කෙරෙන ගුණාංගයේ ප්‍රධාන ගෙවීම මෙයයි. අගය-යුගල වලින් සෑදී ඇති ඇතැම් වර්ගවල ගුණාංග සඳහා, ගොනු නාමය|md5 වැනි පයිප්පයක් (|) මගින් කොටස් දෙක බෙදනු ලැබේ. සිදුවීම් අතර සම්බන්ධතා සෙවීමට සහසම්බන්ධතා එන්ජිම මගින් අගය ක්ෂේත්‍ර(ය) භාවිතා කරයි. අගය යුගල ගුණාංග වලදී අගයන් දෙකම තනි තනිව සහසම්බන්ධ වේ.

source: Attributes can have a contextual comment to further describe the attribute. These comments are not used for correlation and are purely informative.
si_lk: ගුණාංග තවදුරටත් විස්තර කිරීමට සන්දර්භාත්මක විවරණයක් තිබිය හැක. මෙම අදහස් සහසම්බන්ධය සඳහා භාවිතා නොකරන අතර සම්පූර්ණයෙන්ම තොරතුරු වේ.

source: A list of the event IDs that also contain an attribute with the same value.
si_lk: එකම අගයක් සහිත ගුණාංගයක් අඩංගු සිදුවීම් ID ලැයිස්තුවක්.

source: Flags an attribute as an indicator of compromise, allowing it to be included in all of the eligible exports.
si_lk: සම්මුතියේ දර්ශකයක් ලෙස ගුණාංගයක් සලකුණු කරයි, එය සුදුසුකම් ලත් සියලුම අපනයනවලට ඇතුළත් කිරීමට ඉඩ සලසයි.

source: Defines the distribution of the attribute individually. An attribute can have a different distribution level than the event. In any case, the lowest distribution level of the two is used.
si_lk: ගුණාංගයේ ව්‍යාප්තිය තනි තනිව නිර්වචනය කරයි. ගුණාංගයකට සිදුවීමට වඩා වෙනස් බෙදාහැරීමේ මට්ටමක් තිබිය හැක. ඕනෑම අවස්ථාවක, දෙකේ අඩුම බෙදාහැරීමේ මට්ටම භාවිතා වේ.

source: The user can interact with the events through these buttons, which will be further described in the next portion of the guide as they differ for attributes and proposals.
si_lk: පරිශීලකයාට මෙම බොත්තම් හරහා සිදුවීම් සමඟ අන්තර් ක්‍රියා කළ හැකි අතර, ඒවා ගුණාංග සහ යෝජනා සඳහා වෙනස් වන බැවින් මාර්ගෝපදේශයේ ඊළඟ කොටසේ තවදුරටත් විස්තර කෙරේ.

source: Depending on the colour coding of the row, you can have an attribute, a proposal to the event or a proposal to an attribute
si_lk: පේළියේ වර්ණ කේතීකරණය මත පදනම්ව, ඔබට ගුණාංගයක්, සිදුවීමට යෝජනාවක් හෝ ගුණාංගයකට යෝජනාවක් තිබිය හැකිය.

source: Each uncoloured line represents an Attribute.
si_lk: සෑම වර්ණ රහිත රේඛාවක්ම ගුණාංගයක් නියෝජනය කරයි.

source: Proposals to an Event
si_lk: සිදුවීමක් සඳහා යෝජනා

source: Each gray line at the end of the list represents a Proposal to an event. These are proposals for a new attribute, mostly unrelated to any of the currently existing attributes. If the creator of the event accepts one of these a new attribute will be created.
si_lk: ලැයිස්තුවේ අවසානයේ ඇති සෑම අළු රේඛාවක්ම සිදුවීමක් සඳහා යෝජනාවක් නියෝජනය කරයි. මේවා නව ගුණාංගයක් සඳහා වන යෝජනා වන අතර, බොහෝ දුරට දැනට පවතින ගුණාංගවලට සම්බන්ධ නොවේ. සිදුවීමේ නිර්මාතෘ මෙයින් එකක් පිළිගන්නේ නම් නව ගුණාංගයක් නිර්මාණය වේ.

source: Proposals to an Attribute
si_lk: ගුණාංගයක් සඳහා යෝජනා

source: Each attribute can have several edit proposals. These will be placed right below the attribute that the proposal affects and - as with the event proposals - is coloured grey. The original attribute's row is coloured blue if a proposal exists for it.
si_lk: සෑම ගුණාංගයකටම සංස්කරණ යෝජනා කිහිපයක් තිබිය හැක. මේවා යෝජනාව බලපාන ගුණාංගයට පහළින් තබනු ඇති අතර - සිදුවීම් යෝජනා මෙන් - අළු පාටයි. මුල් ගුණාංගයේ පේළිය සඳහා යෝජනාවක් තිබේ නම් එය නිල් පැහැයෙන් වර්ණාලේප කර ඇත.

source: Using the modify button will bring up the attribute creation view, with all data filled out with the attributes currently stored data.
si_lk: modify බොත්තම භාවිත කිරීම මගින් attribute create view ගෙන එනු ඇත, දැනට ගබඩා කර ඇති ගුණාංග වලින් සියලුම දත්ත පුරවා ඇත.

source: Event Discussion Thread
si_lk: සිදුවීම් සාකච්ඡා නූල්

source: Each event has its own assigned discussion where users (that are eligible to see the event) can participate in an open discussion. The users are anonymised in the messages, all that other users will see is their user ID number and their organisation. To post a message on the Event Discussion, either use the reply button on a previous post or use the quickresponse field at the bottom of the page. Each post is made up of the following
si_lk: සෑම සිදුවීමකටම පරිශීලකයින්ට (සිදුවීම බැලීමට සුදුසුකම් ඇති) විවෘත සාකච්ඡාවකට සහභාගී විය හැකි තමන්ගේම පවරා ඇති සාකච්ඡාවක් ඇත. පණිවිඩවල පරිශීලකයින් නිර්නාමිකව ඇත, අනෙකුත් පරිශීලකයින් දකිනු ඇත්තේ ඔවුන්ගේ පරිශීලක හැඳුනුම්පත අංකය සහ ඔවුන්ගේ සංවිධානය පමණි. සිදුවීම් සාකච්ඡාවට පණිවිඩයක් පළ කිරීමට, එක්කෝ පෙර පළ කිරීමක පිළිතුරු බොත්තම භාවිතා කරන්න, නැතහොත් පිටුවේ පහළ ඇති ඉක්මන් ප්‍රතිචාර ක්ෂේත්‍රය භාවිතා කරන්න. සෑම තනතුරක්ම පහත සඳහන් දෑ වලින් සමන්විත වේ

source: The date when the post was created.
si_lk: තනතුර නිර්මාණය කළ දිනය.

source: Post navigation
si_lk: පසු සංචලනය

source: This should the posts' ID as well as a link to jump to the top of the discussion thread on the page itself.
si_lk: මෙය පළ කිරීම් හැඳුනුම්පත මෙන්ම පිටුවේම සාකච්ඡා නූලෙහි ඉහළට පැනීමට සබැඳියක් විය යුතුය.

source: Organisation logo
si_lk: සංවිධානයේ ලාංඡනය

source: If such an image exists for the organisation that has posted the message, then the logo is shown.
si_lk: පණිවිඩය පළ කර ඇති සංවිධානය සඳහා එවැනි රූපයක් තිබේ නම්, ලාංඡනය පෙන්වනු ලැබේ.

source: The body of the post itself. This can also include automatically generated links to other events and threads as well as show quoted test in embedded bubbles. Editing an event will also append a post with a message indicating that it was edited together with the timestamp of the edit.
si_lk: කණුවේ ශරීරය ම ය. මෙයට වෙනත් සිදුවීම් සහ පොටවල් වෙත ස්වයංක්‍රීයව උත්පාදනය කරන ලද සබැඳි මෙන්ම කාවැද්දූ බුබුලු තුළ උද්ධෘත පරීක්ෂණය පෙන්වීමද ඇතුළත් විය හැක. සිදුවීමක් සංස්කරණය කිරීම සංස්කරණයේ වේලා මුද්‍රාව සමඟ එය සංස්කරණය කළ බවට පණිවිඩයක් සමඟ පළ කිරීමක් ද එකතු කරනු ඇත.

source: The e-mail address of the poster if he/she is from the organisation as the current user. Alternatively a generated sting is shown that includes the user ID of the user, so that his/her e-mail address could remain hidden whilst still being identifiable.
si_lk: ඔහු/ඇය වත්මන් පරිශීලකයා ලෙස සංවිධානයේ නම් පෝස්ටරයේ විද්‍යුත් තැපැල් ලිපිනය. විකල්පයක් ලෙස, පරිශීලකයාගේ පරිශීලක හැඳුනුම්පත ඇතුළත් උත්පාදනය කරන ලද දෂ්ට කිරීමක් පෙන්වනු ලැබේ, එවිට ඔහුගේ/ඇයගේ විද්‍යුත් තැපැල් ලිපිනය තවමත් හඳුනාගත හැකි අතර සඟවා තැබිය හැකිය.

source: Action buttons
si_lk: ක්රියාකාරී බොත්තම්

source: Edit, Delete and Reply. The first two of the three options are only available to the poster of the message or a site admin. Quoting a post will automatically include the original message in [quote] tags.
si_lk: සංස්කරණය කරන්න, මකන්න සහ පිළිතුරු දෙන්න. විකල්ප තුනෙන් පළමු දෙක ලබා ගත හැක්කේ පණිවිඩයේ පෝස්ටරයට හෝ අඩවි පරිපාලකයෙකුට පමණි. පළ කිරීමක් උපුටා දැක්වීමේදී මුල් පණිවිඩය ටැග් [quote] කින් ස්වයංක්‍රීයව ඇතුළත් වේ.

source: Here is a list of the various tools you can use while using this feature
si_lk: මෙම විශේෂාංගය භාවිතා කරන අතරතුර ඔබට භාවිතා කළ හැකි විවිධ මෙවලම් ලැයිස්තුවක් මෙන්න

source: Pagination
si_lk: පේජිනේෂන්

source: There are 5 posts visible on each event page, if there have been more messages posted, use the previous and next button to navigate through the thread. This will not reload the rest of the page.
si_lk: එක් එක් සිදුවීම් පිටුවෙහි පළ කිරීම් 5ක් දෘශ්‍යමාන වේ, තවත් පණිවිඩ පළ කර ඇත්නම්, නූල් හරහා සැරිසැරීමට පෙර සහ ඊළඟ බොත්තම භාවිතා කරන්න. මෙය පිටුවේ ඉතිරි කොටස නැවත පූරණය නොකරනු ඇත.

source: Discussion Tags
si_lk: සාකච්ඡා ටැග්

source: Users can quote something by encapsulating it in [quote][/quote] tags, they can create a link to another event with the [event][/event] tags or to another discussion thread with [thread][/thread].
si_lk: පරිශීලකයින්ට ටැග් [quote][/quote] කින් එය කැප්සියුලර් කිරීමෙන් යමක් උපුටා දැක්විය හැක, ඔවුන්ට ටැග් [event][/event] සහිත වෙනත් සිදුවීමකට හෝ [thread][/thread]සමඟ වෙනත් සාකච්ඡා නූලකට සබැඳියක් සෑදිය හැක.

source: Quick Post
si_lk: ඉක්මන් පෝස්ට්

source: Adding a post will take the user to a separate add Post page, something that can be a bit of an inconvenience. To avoid this, there is a quick post button, where users can add messages on the fly without having to reload the page. On top of the quick post field, 3 buttons allow users to generate quote, event and thread tags quickly.
si_lk: පළ කිරීමක් එකතු කිරීමෙන් පරිශීලකයා වෙනම add Post පිටුවකට ගෙන යනු ඇත, එය තරමක් අපහසුතාවයක් විය හැකිය. මෙය වළක්වා ගැනීම සඳහා, පරිශීලකයින්ට පිටුව නැවත පූරණය කිරීමකින් තොරව පියාසර කරන විට පණිවිඩ එක් කළ හැකි ඉක්මන් තැපැල් බොත්තමක් ඇත. ඉක්මන් පළ කිරීම් ක්ෂේත්‍රයට ඉහළින්, බොත්තම් 3ක් පරිශීලකයින්ට උද්ධෘත, සිදුවීම් සහ නූල් ටැග් ඉක්මනින් ජනනය කිරීමට ඉඩ සලසයි.

source: Event History
si_lk: සිදුවීම් ඉතිහාසය

source: View the logs of the event that show how the event has changed over time, including the contribution from other organisations in the form of proposals. There are two ways to get to this view, either by clicking on View Event History on the side menu of an event view, or by clicking on a contributing organisation's logo on the event view. The latter will show a restricted form of the logs, showing only Proposals created by the selected organisation. The fields shown in this view are as described as follows
si_lk: යෝජනා ආකාරයෙන් වෙනත් සංවිධානවල දායකත්වය ඇතුළුව, කාලයත් සමඟ සිදුවීම වෙනස් වී ඇති ආකාරය පෙන්වන සිදුවීමේ ලඝු බලන්න. සිදුවීම් දසුනක පැති මෙනුවේ View Event History මත ක්ලික් කිරීමෙන් හෝ සිද්ධි දසුන මත දායක වන සංවිධානයේ ලාංඡනයක් මත ක්ලික් කිරීමෙන් මෙම දර්ශනය වෙත යාමට ක්‍රම දෙකක් ඇත. දෙවැන්න ලොග් වල සීමා කළ ආකාරයක් පෙන්වයි, තෝරාගත් සංවිධානය විසින් නිර්මාණය කරන ලද යෝජනා පමණක් පෙන්වයි. මෙම දර්ශනයේ දැක්වෙන ක්ෂේත්‍ර පහත පරිදි විස්තර කෙරේ

source: The logo (or in the lack thereof a string representation) of the organisation.
si_lk: සංවිධානයේ ලාංඡනය (හෝ එහි නූල් නියෝජනයක් නොමැතිකම).
