Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: The info field, where the malware/incident can get a brief description starting with the internal reference. This field should be as brief and concise as possible, the more detailed description happens through attributes in the next stage of the event's creation. Keep in mind that the system will automatically replace detected text strings that match a regular expression entry set up by your server's administrator(s).
si_lk: අනිෂ්ට මෘදුකාංග/සිද්ධිය අභ්‍යන්තර යොමුවෙන් පටන් ගෙන කෙටි විස්තරයක් ලබා ගත හැකි තොරතුරු ක්ෂේත්‍රය. මෙම ක්ෂේත්‍රය හැකිතාක් කෙටි හා සංක්ෂිප්ත විය යුතුය, වඩාත් සවිස්තරාත්මක විස්තරය සිදුවීම නිර්මාණයේ මීළඟ අදියරේදී ගුණාංග හරහා සිදුවේ. ඔබේ සේවාදායකයේ පරිපාලක(ය) විසින් සකසන ලද සාමාන්‍ය ප්‍රකාශන ප්‍රවේශයකට ගැළපෙන හඳුනාගත් පෙළ තන්තු පද්ධතිය ස්වයංක්‍රීයව ප්‍රතිස්ථාපනය කරන බව මතක තබා ගන්න.

source: Add attributes to the event
si_lk: සිදුවීමට ගුණාංග එක් කරන්න

source: The second step of creating an event is to populate it with attributes and attachments. This can be done by adding them manually or importing the attributes from an external format (OpenIOC, ThreatConnect). To import from an external format or to upload an attachment use the options in the menu on the left.
si_lk: සිදුවීමක් නිර්මාණය කිරීමේ දෙවන පියවර වන්නේ ගුණාංග සහ ඇමුණුම් සමඟ එය ජනනය කිරීමයි. ඒවා අතින් එකතු කිරීමෙන් හෝ බාහිර ආකෘතියකින් (OpenIOC, ThreatConnect) ගුණාංග ආයාත කිරීමෙන් මෙය කළ හැක. බාහිර ආකෘතියකින් ආයාත කිරීමට හෝ ඇමුණුමක් උඩුගත කිරීමට වම් පස ඇති මෙනුවේ විකල්ප භාවිතා කරන්න.

source: Attribute tools
si_lk: ගුණාංග මෙවලම්

source: Use these tools to populate the event.
si_lk: සිදුවීම ජනනය කිරීමට මෙම මෙවලම් භාවිතා කරන්න.

source: Using the above shown buttons, you can populate an event using various tools that will be explained in the following section. Let's start with the Add Attribute button.
si_lk: ඉහත පෙන්වා ඇති බොත්තම් භාවිතයෙන්, ඔබට පහත කොටසේ පැහැදිලි කෙරෙන විවිධ මෙවලම් භාවිතයෙන් සිදුවීමක් ජනනය කළ හැක. Add Attribute බොත්තමෙන් පටන් ගනිමු.

source: Keep in mind that the system searches for regular expressions in the value field of all attributes when entered, replacing detected strings within it as set up by the server's administrator (for example to enforce standardised capitalisation in paths for event correlation or to bring exact paths to a standardised format). The following fields need to be filled out
si_lk: පද්ධතිය ඇතුල් කරන විට සියලුම ගුණාංගවල අගය ක්ෂේත්‍රයේ නිත්‍ය ප්‍රකාශන සොයන බව මතක තබා ගන්න, සේවාදායකයේ පරිපාලක විසින් පිහිටුවා ඇති පරිදි එය තුළ හඳුනාගත් තන්තු ප්‍රතිස්ථාපනය කරයි (උදාහරණයක් ලෙස සිදුවීම් සහසම්බන්ධතාවය සඳහා මාර්ගවල ප්‍රමිතිගත ප්‍රාග්ධනීකරණය බලාත්මක කිරීමට හෝ නිවැරදි මාර්ග ගෙන ඒමට සම්මත ආකෘතියක්). පහත ක්ෂේත්‍ර පිරවිය යුතුය

source: This form allows you to add attributes.
si_lk: මෙම පෝරමය ඔබට ගුණාංග එකතු කිරීමට ඉඩ සලසයි.

source: This drop-down menu explains the category of the attribute, meaning what aspect of the malware this attribute is describing. This could mean the persistence mechanisms of the malware or network activity, etc. For a list of valid categories, %s
si_lk: මෙම පතන මෙනුව මගින් ගුණාංගයේ ප්‍රවර්ගය පැහැදිලි කරයි, එනම් මෙම ගුණාංගය විස්තර කරන්නේ අනිෂ්ට මෘදුකාංගයේ කුමන අංශයද යන්නයි. මෙය අනිෂ්ට මෘදුකාංග හෝ ජාල ක්‍රියාකාරකම්වල නොනැසී පවතින යාන්ත්‍රණ ආදිය අදහස් විය හැක. වලංගු කාණ්ඩ ලැයිස්තුවක් සඳහා, %s

source: Whilst categories determine what aspect of an event they are describing, the Type explains by what means that aspect is being described. As an example, the source IP address of an attack, a source e-mail address or a file sent through an attachment can all describe the payload delivery of a malware. These would be the types of attributes with the category of payload deliver. For an explanation of what each of the types looks like together with the valid combinations of categories and types, %s.
si_lk: ප්‍රවර්ග විසින් ඔවුන් විස්තර කරන සිදුවීමක කුමන අංගයක්ද යන්න තීරණය කරන අතර, එම අංගය විස්තර කරන්නේ කුමන ආකාරයෙන්ද යන්න වර්ගය පැහැදිලි කරයි. උදාහරණයක් ලෙස, ප්‍රහාරයක මූලාශ්‍ර IP ලිපිනය, මූලාශ්‍ර විද්‍යුත් තැපැල් ලිපිනයක් හෝ ඇමුණුමක් හරහා යවන ලද ගොනුවක් යන සියල්ල අනිෂ්ට මෘදුකාංගයක ගෙවීම් භාරදීම විස්තර කළ හැකිය. මේවා ගෙවීමේ බෙදා හැරීමේ කාණ්ඩය සමඟ ගුණාංග වර්ග වනු ඇත. ප්‍රවර්ග සහ වර්ග වල වලංගු සංයෝජන සමග එක් එක් වර්ගය පෙනෙන්නේ කෙසේද යන්න පැහැදිලි කිරීම සඳහා, %s.

source: This drop-down list allows you to control who will be able to see this attribute. The distribution is inherited by attributes: the most restrictive setting wins. For more info <a href="#distribution">click here</a>.
si_lk: මෙම පතන ලැයිස්තුව ඔබට මෙම ගුණාංගය දැකිය හැක්කේ කාටද යන්න පාලනය කිරීමට ඉඩ සලසයි. බෙදාහැරීම ගුණාංග මගින් උරුම වේ: වඩාත්ම සීමා සහිත සැකසුම ජය ගනී. වැඩි විස්තර සඳහා <a href="#distribution">මෙතන ක්ලික් කරන්න</a>.

source: Add a comment to the attribute. This will not be used for correlation.
si_lk: ගුණාංගයට අදහසක් එක් කරන්න. මෙය සහසම්බන්ධය සඳහා භාවිතා නොකරනු ඇත.

source: The actual value of the attribute, enter data about the value based on what is valid for the chosen attribute type. For example, for an attribute of type ip-src (source IP address), 11.11.11.11 would be a valid value. For more information on types and values, %s.
si_lk: ගුණාංගයේ සත්‍ය අගය, තෝරාගත් උපලක්ෂණ වර්ගය සඳහා වලංගු වන්නේ කුමක්ද යන්න මත පදනම්ව අගය පිළිබඳ දත්ත ඇතුළත් කරන්න. උදාහරණයක් ලෙස, ip-src (මූලාශ්‍ර IP ලිපිනය) වර්ගයේ ගුණාංගයක් සඳහා, 11.11.11.11 වලංගු අගයක් වනු ඇත. වර්ග සහ අගයන් පිළිබඳ වැඩි විස්තර සඳහා, %s.

source: You can add some comments to the attribute that will not be used for correlation but instead serves as purely an informational field.
si_lk: සහසම්බන්ධය සඳහා භාවිතා නොකරන නමුත් ඒ වෙනුවට සම්පූර්ණයෙන්ම තොරතුරු ක්ෂේත්‍රයක් ලෙස ක්‍රියා කරන ගුණාංගයට ඔබට අදහස් කිහිපයක් එක් කළ හැකිය.

source: This option allows the attribute to be used as an IDS signature when exporting the NIDS data, unless it is being overruled by the white-list. For more information about the whitelist, head over to the %s section.
si_lk: මෙම විකල්පය NIDS දත්ත නිර්යාත කිරීමේදී IDS අත්සනක් ලෙස උපලක්ෂණය භාවිතා කිරීමට ඉඩ සලසයි, එය සුදු-ලැයිස්තුව මගින් අවලංගු කරන්නේ නම් මිස. සුදු ලැයිස්තුව පිළිබඳ වැඩි විස්තර සඳහා, %s කොටස වෙත යන්න.

source: administration
si_lk: පරිපාලනය

source: Batch import
si_lk: කණ්ඩායම් ආනයනය

source: If there are several attributes of the same type to enter (such as a list of IP addresses, it is possible to enter them all into the same value-field, separated by a line break between each line. This will allow the system to create separate lines for the each attribute.
si_lk: ඇතුළත් කිරීමට එකම වර්ගයේ ගුණාංග කිහිපයක් තිබේ නම් (IP ලිපින ලැයිස්තුවක් වැනි, ඒවා සියල්ලම එකම අගය-ක්ෂේත්‍රයකට ඇතුළු කළ හැකිය, එක් එක් පේළිය අතර රේඛා බිඳීමකින් වෙන් කර ඇත. මෙය පද්ධතියට නිර්මාණය කිරීමට ඉඩ සලසයි. එක් එක් ගුණාංගය සඳහා වෙනම රේඛා.

source: Populate from Template
si_lk: සැකිල්ලෙන් ජනප්‍රිය කරන්න

source: Templates allow users to rapidly populate events of a specific type by filling out a series of pre-defined fields. Users with template creation privileges can create new templates for their organisations or for all organisations on their instance. If you are interested in template creation, please refer to the templating section.<br /> For users trying to populate an event, after clicking on the populate from template button, you'll be presented with a list of all currently accessible templates. Pick the one that best describes the event that you are creating.
si_lk: සැකිලි පරිශීලකයින්ට පූර්ව නිර්වචනය කළ ක්ෂේත්‍ර මාලාවක් පිරවීමෙන් නිශ්චිත වර්ගයක සිදුවීම් වේගයෙන් ජනනය කිරීමට ඉඩ සලසයි. අච්චු නිර්මාණය කිරීමේ වරප්‍රසාද ඇති පරිශීලකයින්ට ඔවුන්ගේ ආයතන සඳහා හෝ ඔවුන්ගේ නිදසුන මත සියලුම ආයතන සඳහා නව සැකිලි සෑදිය හැක. ඔබ අච්චු නිර්මාණය කිරීමට කැමති නම්, කරුණාකර සැකිලි අංශය වෙත යොමු වන්න.<br /> සිදුවීමක් පුරවා ගැනීමට උත්සාහ කරන පරිශීලකයින් සඳහා, අච්චුවෙන් ජනප්‍රිය බොත්තම ක්ලික් කිරීමෙන් පසු, ඔබට දැනට ප්‍රවේශ විය හැකි සියලුම සැකිලි ලැයිස්තුවක් ඉදිරිපත් කරනු ඇත. ඔබ නිර්මාණය කරන සිදුවීම වඩාත් හොඳින් විස්තර කරන එකක් තෝරන්න.

source: Template Choice
si_lk: සැකිලි තේරීම

source: Choose the most appropriate template for your event.
si_lk: ඔබගේ සිදුවීම සඳහා වඩාත් සුදුසු අච්චුව තෝරන්න.

source: Once you have chosen a template, you'll be presented with the actual form contained within. Make sure you fill out as many fields as possible with the mandatory fields - marked by a star in a bracket such as this: (*) - are filled out.<br /> Templates are devided into sections, with each section having a title and a description in addition to a series of fields. Each field can be an attribute or a file attachment field. An attribute field has the following components
si_lk: ඔබ අච්චුවක් තෝරා ගත් පසු, එහි අඩංගු සත්‍ය පෝරමය ඔබට ඉදිරිපත් කරනු ඇත. ඔබ අනිවාර්ය ක්ෂේත්‍ර සමඟ හැකිතාක් ක්ෂේත්‍ර පිරවීමට වග බලා ගන්න - මෙවැනි වරහනක තරුවකින් සලකුණු කර ඇත: (*) - පුරවා ඇත.<br /> සැකිලි කොටස් වලට බෙදා ඇත, එක් එක් කොටසට ක්ෂේත්‍ර මාලාවකට අමතරව මාතෘකාවක් සහ විස්තරයක් ඇත. සෑම ක්ෂේත්‍රයක්ම ගුණාංගයක් හෝ ගොනු ඇමුණුම් ක්ෂේත්‍රයක් විය හැක. ගුණාංග ක්ෂේත්‍රයක පහත සංරචක ඇත

source: Template Field
si_lk: සැකිලි ක්ෂේත්‍රය

source: MISP will generate attributes based on the field's settings and the data that you provide.
si_lk: MISP විසින් ක්ෂේත්‍ර සැකසීම් සහ ඔබ සපයන දත්ත මත පදනම්ව උපලක්ෂණ උත්පාදනය කරනු ඇත.

source: The name of the field along with an indication if the field is mandatory.
si_lk: ක්ෂේත්‍රය අනිවාර්ය නම් ඇඟවීමක් සමඟ ක්ෂේත්‍රයේ නම.

source: A short description of the field.
si_lk: ක්ෂේත්රයේ කෙටි විස්තරයක්.

source: The value(s) that are valid for the field. In the case of several types being shown here, you can enter value(s) matching any one of the types, or in the case of a batch import field, any mixture of the given types.
si_lk: ක්ෂේත්‍රය සඳහා වලංගු වන අගය(ය) මෙහි දැක්වෙන වර්ග කිහිපයකදී, ඔබට ඕනෑම වර්ගයකට ගැළපෙන අගය(ය) ඇතුළත් කළ හැකිය, නැතහොත් කණ්ඩායම් ආනයන ක්ෂේත්‍රයකදී, ලබා දී ඇති වර්ගවල ඕනෑම මිශ්‍රණයක් ඇතුළත් කළ හැකිය.

source: Text field
si_lk: පෙළ ක්ෂේත්‍රය

source: This field can either be a single line textfield or a multi-line text area. For the former, enter a single value of the above indicated type, whilst for the latter you cna paste a list of values separated by line-breaks.
si_lk: මෙම ක්ෂේත්‍රය තනි පේළි පෙළ ක්ෂේත්‍රයක් හෝ බහු-පේළි පෙළ ප්‍රදේශයක් විය හැක. පළමුවැන්න සඳහා, ඉහත දක්වා ඇති ආකාරයේ තනි අගයක් ඇතුළත් කරන්න, දෙවැන්න සඳහා ඔබට රේඛා බිඳීම් වලින් වෙන් කරන ලද අගයන් ලැයිස්තුවක් ඇලවිය හැක.

source: Freetext
si_lk: නිදහස් පෙළ

source: Just paste a line-break separated list of indicators into the freetext import tool.
si_lk: ෆ්‍රී ටෙක්ස්ට් ආයාත මෙවලමට රේඛා-බිඳුණු දර්ශක ලැයිස්තුවක් අලවන්න.

source: If you have a list of indicators that you would like to quickly generate attributes out of then the Free-text import tool is just what you need. Simply paste a list of indicators (separated by line-breaks into this tool).
si_lk: ඔබට ඉක්මනින් ගුණාංග උත්පාදනය කිරීමට අවශ්‍ය දර්ශක ලැයිස්තුවක් තිබේ නම්, නිදහස් පෙළ ආයාත මෙවලම ඔබට අවශ්‍ය දේ පමණි. දර්ශක ලැයිස්තුවක් සරලව අලවන්න (මෙම මෙවලමට රේඛා බිඳීම් මගින් වෙන් කර ඇත).

source: MISP will often find several valid category/type combinations for the values. Do last minute adjustments on the result page.
si_lk: MISP බොහෝ විට අගයන් සඳහා වලංගු කාණ්ඩ/වර්ග සංයෝජන කිහිපයක් සොයා ගනී. ප්‍රතිඵල පිටුවේ අවසාන මොහොතේ ගැලපීම් කරන්න.

source: Since there are several category / type combinations that can be valid for a lot of values, MISP will suggest the most common settings. You can alter the category / type / IDS fields manually if you disagree with the results. The options will be restricted to valid category/type combinations for the value that you have entered.
si_lk: බොහෝ අගයන් සඳහා වලංගු විය හැකි ප්‍රවර්ග / වර්ග සංයෝජන කිහිපයක් ඇති බැවින්, MISP වඩාත් පොදු සැකසුම් යෝජනා කරනු ඇත. ඔබ ප්‍රතිඵල සමඟ එකඟ නොවන්නේ නම් ඔබට ප්‍රවර්ගය / වර්ගය / IDS ක්ෂේත්‍ර අතින් වෙනස් කළ හැක. ඔබ ඇතුළත් කර ඇති අගය සඳහා වලංගු ප්‍රවර්ග/වර්ග සංයෝජන සඳහා විකල්ප සීමා කෙරේ.

source: If you would like to create and maintain an event with a set of indicators that receives removals and additions over time, then the attribute replace tool might make this task easier for you.
si_lk: කාලයත් සමඟ ඉවත් කිරීම් සහ එකතු කිරීම් ලැබෙන දර්ශක සමූහයක් සමඟ සිදුවීමක් නිර්මාණය කිරීමට සහ පවත්වාගෙන යාමට ඔබ කැමති නම්, ගුණාංග ප්‍රතිස්ථාපන මෙවලම ඔබට මෙම කාර්යය පහසු කරයි.

source: Select a category/type combination and paste the updated list of indicators into the textarea.
si_lk: ප්‍රවර්ගයක්/වර්ග සංයෝජනයක් තෝරන්න සහ යාවත්කාලීන කළ දර්ශක ලැයිස්තුව textarea එකට අලවන්න.

source: Simply select the desired category / type combination, choose whether the attributes should be marked for IDS exports and paste the new list of indicators into the textarea. Attributes of the same category/type that are present in the event but not the new list will be removed, values in the pasted list that do not yet exist as attributes will be created as attributes and values that already have matching attributes will be left untouched.
si_lk: අවශ්‍ය ප්‍රවර්ගය/වර්ග සංයෝජනය සරලව තෝරන්න, IDS අපනයන සඳහා උපලක්ෂණ සලකුණු කළ යුතුද යන්න තෝරා නව දර්ශක ලැයිස්තුව textarea එකට අලවන්න. සිදුවීමේ පවතින නමුත් නව ලැයිස්තුවේ නොමැති එකම ප්‍රවර්ගයේ/වර්ගයේ උපලක්ෂණ ඉවත් කරනු ලැබේ, අලවන ලද ලැයිස්තුවේ තවමත් ගුණාංග ලෙස නොපවතින අගයන් උපලක්ෂණ ලෙස සාදනු ලබන අතර දැනටමත් ගැළපෙන ගුණාංග ඇති අගයන් ස්පර්ශ නොකර තබනු ඇත. .

source: Add attachments to the event
si_lk: සිදුවීමට ඇමුණුම් එක් කරන්න

source: You can also upload attachments, such as the malware itself, report files from external analysis or simply artifacts dropped by the malware. Clicking on the add attachment button brings up a form that allows you to quickly attach a file to the event. The following fields need to be filled out
si_lk: ඔබට අනිෂ්ට මෘදුකාංග වැනි ඇමුණුම් උඩුගත කළ හැකිය, බාහිර විශ්ලේෂණයෙන් ගොනු වාර්තා කිරීම හෝ අනිෂ්ට මෘදුකාංගය විසින් අතහැර දැමූ පුරාවස්තු. ඇඩ් ඇමිණුම් බොත්තම ක්ලික් කිරීමෙන් ඔබට සිදුවීමට ගොනුවක් ඉක්මනින් ඇමිණීමට ඉඩ සලසන පෝරමයක් ගෙන එයි. පහත ක්ෂේත්‍ර පිරවිය යුතුය

source: Add attachment
si_lk: ඇමුණුම එකතු කරන්න

source: Point the uploader to the file you want to upload. Make sure to mark it as malware if the uploaded file is harmful, that way it will be neutralised.
si_lk: ඔබට උඩුගත කිරීමට අවශ්‍ය ගොනුව වෙත උඩුගත කරන්නා යොමු කරන්න. උඩුගත කළ ගොනුව හානිකර නම් එය අනිෂ්ට මෘදුකාංගයක් ලෙස සලකුණු කිරීමට වග බලා ගන්න, එමඟින් එය උදාසීන වනු ඇත.

source: The category is the same as with the attributes, it answers the question of what the uploaded file is meant to describe.
si_lk: ප්‍රවර්ගය ගුණාංග වලට සමාන වේ, එය උඩුගත කළ ගොනුව විස්තර කිරීමට අදහස් කරන්නේ කුමක්ද යන ප්‍රශ්නයට පිළිතුරු සපයයි.

source: This drop-down list allows you to control who will be able to see this attachment. The distribution is inherited by attributes: the most restrictive setting wins. For more info <a href="#distribution">click here</a>.
si_lk: මෙම පතන ලැයිස්තුව ඔබට මෙම ඇමුණුම දැකිය හැක්කේ කාටද යන්න පාලනය කිරීමට ඉඩ සලසයි. බෙදාහැරීම ගුණාංග මගින් උරුම වේ: වඩාත්ම සීමා සහිත සැකසුම ජය ගනී. වැඩි විස්තර සඳහා <a href="#distribution">මෙතන ක්ලික් කරන්න</a>.

source: Upload field
si_lk: උඩුගත කිරීමේ ක්ෂේත්‍රය

source: By hitting browse, you can browse your file system and point the uploader to the file that you want to attach to the attribute. This will then be uploaded when the upload button is pushed.
si_lk: බ්‍රවුස් එබීමෙන්, ඔබට ඔබේ ගොනු පද්ධතිය බ්‍රවුස් කළ හැකි අතර ඔබට උපලක්ෂණයට ඇමිණීමට අවශ්‍ය ගොනුව වෙත උඩුගත කරන්නා යොමු කළ හැක. මෙය උඩුගත කිරීමේ බොත්තම එබූ විට උඩුගත වේ.

source: This check-box marks the file as malware and as such it will be zipped and passworded, to protect the users of the system from accidentally downloading and executing the file. Make sure to tick this if you suspect that the filed is infected, before uploading it.
si_lk: මෙම පිරික්සුම් පෙට්ටිය ගොනුව අනිෂ්ට මෘදුකාංග ලෙස සලකුණු කරන අතර, එම ගොනුව අහම්බෙන් බාගත කිරීමෙන් සහ ක්‍රියාත්මක කිරීමෙන් පද්ධතියේ පරිශීලකයින් ආරක්ෂා කිරීම සඳහා එය zip කර මුරපදයක් යොදනු ලැබේ. ගොනුව ආසාදනය වී ඇති බවට ඔබ සැක කරන්නේ නම්, එය උඩුගත කිරීමට පෙර මෙය සලකුණු කිරීමට වග බලා ගන්න.

source: Propose a change to an event that belongs to another organisation
si_lk: වෙනත් සංවිධානයකට අයත් සිදුවීමකට වෙනසක් යෝජනා කරන්න

source: If you would like to propose a modification to an attribute, or to propose some additional attributes to the creating organisation, you can do this with the buttons that replace the add attribute field on the left and the edit icon on the right end of each listed attribute in the event view. The creating organisation of the event will be able to see any proposals and discard or accept the changes.
si_lk: ඔබ උපලක්ෂණයකට වෙනස් කිරීමක් යෝජනා කිරීමට හෝ නිර්මාණය කරන ආයතනයට අමතර උපලක්ෂණ කිහිපයක් යෝජනා කිරීමට කැමති නම්, ලැයිස්තුගත කර ඇති එක් එක් ලැයිස්තුවේ වම් පස ඇති add attribute ක්ෂේත්‍රය සහ දකුණු කෙළවරේ ඇති සංස්කරණ නිරූපකය ප්‍රතිස්ථාපනය කරන බොත්තම් මඟින් ඔබට මෙය කළ හැක. සිද්ධි දසුන තුළ ඇති ගුණාංගය. උත්සවය නිර්මාණය කරන සංවිධානයට ඕනෑම යෝජනාවක් දැකීමට සහ වෙනස්කම් ඉවත දැමීමට හෝ පිළිගැනීමට හැකි වනු ඇත.

source: Propose attribute
si_lk: ගුණාංගය යෝජනා කරන්න

source: An attribute with a proposal attached will turn blue and the proposal itself will be grey. If there is a grey proposal without a blue attribute infront of it, it means that someone has proposed a new attribute
si_lk: යෝජනාවක් අමුණා ඇති ගුණාංගයක් නිල් පැහැයට හැරෙන අතර යෝජනාවම අළු වනු ඇත. එහි ඉදිරියෙන් නිල් ගුණාංගයක් නොමැති අළු යෝජනාවක් තිබේ නම්, එයින් අදහස් වන්නේ යමෙකු නව ගුණාංගයක් යෝජනා කර ඇති බවයි.

source: If the organisation that has created the event is on another connected server, they will be able to accept the proposal once they initiate a pull and receive your proposal. After this they can republish the event, sending the altered attribute back to your instance.
si_lk: සිදුවීම නිර්මාණය කර ඇති සංවිධානය වෙනත් සම්බන්ධිත සේවාදායකයක නම්, ඔවුන් ඇදීමක් ආරම්භ කර ඔබේ යෝජනාව ලැබුණු පසු ඔවුන්ට යෝජනාව පිළිගැනීමට හැකි වනු ඇත. මෙයින් පසු ඔවුන්ට එම සිදුවීම නැවත ප්‍රකාශනය කළ හැකි අතර, වෙනස් කළ ගුණාංගය ඔබේ නිදසුන වෙත ආපසු යවයි.

source: Populate from OpenIOC
si_lk: OpenIOC වෙතින් ජනප්‍රිය කරන්න

source: It is also possible to attempt to import the data contained in a .ioc file, The import tool will attempt to gather as many IndicatorItems within nested logical operators as possible without breaking their validity. After the procedure is done, you'll be presented with a list of successfully created attributes and a list of failed IndicatorItems as well as a graph of the .ioc file.
si_lk: .ioc ගොනුවක අඩංගු දත්ත ආයාත කිරීමට ද උත්සාහ කළ හැකිය, ආනයන මෙවලම ඔවුන්ගේ වලංගු භාවය නොබිඳී හැකිතාක් දර්ශක අයිතම කැදැලි තාර්කික ක්‍රියාකරුවන් තුළ රැස් කිරීමට උත්සාහ කරයි. ක්‍රියාපටිපාටිය අවසන් වූ පසු, ඔබට සාර්ථකව සාදන ලද උපලක්ෂණ ලැයිස්තුවක් සහ අසාර්ථක වූ දර්ශක අයිතම ලැයිස්තුවක් මෙන්ම .ioc ගොනුවේ ප්‍රස්ථාරයක් ඉදිරිපත් කරනු ඇත.

source: The import tool will list the successful and failed entries after the process is done.
si_lk: ක්‍රියාවලිය සිදු කිරීමෙන් පසු ආනයන මෙවලම සාර්ථක සහ අසාර්ථක ඇතුළත් කිරීම් ලැයිස්තුගත කරනු ඇත.

source: You'll also be able to see a graph of the imported .ioc file and how successful the import was.
si_lk: ඔබට ආනයනය කරන ලද .ioc ගොනුවේ ප්‍රස්ථාරයක් සහ ආයාත කිරීම කෙතරම් සාර්ථකද යන්න බැලීමටද හැකි වනු ඇත.

source: Populate from ThreatConnect
si_lk: ThreatConnect වෙතින් ජනප්‍රිය කරන්න

source: You can also import the data from a ThreatConnect export csv file. The following columns are used by the import tool (and are thus mandatory fields to select during the export)
si_lk: ඔබට ThreatConnect අපනයන csv ගොනුවකින් දත්ත ආයාත කළ හැක. පහත තීරු ආයාත මෙවලම විසින් භාවිතා කරනු ලැබේ (එමගින් අපනයනය අතරතුර තෝරා ගැනීමට අනිවාර්ය ක්ෂේත්‍ර වේ)

source: Confidence
si_lk: විශ්වාසය

source: The result will be a list of attributes that get added to the currently selected event, each of which will be marked with a comment that indicates that its origin being from a ThreatConnect import.
si_lk: ප්‍රතිඵලය වනුයේ දැනට තෝරාගත් සිදුවීමට එකතු වන ගුණාංග ලැයිස්තුවක් වන අතර, ඒ සෑම එකක්ම එහි මූලාරම්භය ThreatConnect ආයාත කිරීමකින් බව අඟවන අදහසකින් සලකුණු කරනු ලැබේ.

source: Publish an event
si_lk: සිදුවීමක් ප්‍රකාශ කරන්න

source: Once all the attributes and attachments that you want to include with the event are uploaded / set, it is time to finalise its creation by publishing the event (click on publish event in the event view). This will alert the eligible users of it (based on the private-controls of the event and its attributes/attachments and whether they have auto-alert turned on), push the event to instances that your instance connects to and propagate it further based on the distribution rules. It also readies the network related attributes for NIDS signature creation (through the NIDS signature export feature, for more information, go to the export section.).
si_lk: ඔබට සිදුවීම සමඟ ඇතුළත් කිරීමට අවශ්‍ය සියලුම උපලක්ෂණ සහ ඇමුණුම් උඩුගත කළ / සැකසූ පසු, එය සිදුවීම ප්‍රකාශයට පත් කිරීමෙන් එහි නිර්මාණය අවසන් කිරීමට කාලයයි (සිදුවීම් දර්ශනයේ ප්‍රකාශන සිදුවීම මත ක්ලික් කරන්න). මෙය එහි සුදුසුකම් ලත් පරිශීලකයින්ට අනතුරු අඟවයි (සිද්ධියෙහි පුද්ගලික-පාලන සහ එහි ගුණාංග/ඇමිණුම් සහ ඔවුන් ස්වයංක්‍රීය ඇඟවීම් ක්‍රියාත්මක කර තිබේද යන්න මත පදනම්ව), ඔබේ අවස්ථාව සම්බන්ධ වන අවස්ථා වෙත සිදුවීම තල්ලු කර එය පදනම් කරගෙන එය තවදුරටත් ප්‍රචාරණය කරයි. බෙදා හැරීමේ නීති. එය NIDS අත්සන නිර්මාණය සඳහා ජාල ආශ්‍රිත ගුණාංග ද සූදානම් කරයි (NIDS අත්සන අපනයන විශේෂාංගය හරහා, වැඩි විස්තර සඳහා, අපනයන අංශයට යන්න.).

source: There is an alternate way of publishing an event without alerting any other users, by using the "publish (no email)" button. This should only be used for minor edits (such as correcting a typo).
si_lk: "ප්‍රකාශනය කරන්න (ඊමේල් නැත)" බොත්තම භාවිතයෙන් වෙනත් කිසිදු පරිශීලකයෙකුට අනතුරු ඇඟවීමකින් තොරව සිදුවීමක් ප්‍රකාශ කිරීමේ විකල්ප ක්‍රමයක් තිබේ. මෙය භාවිතා කළ යුත්තේ සුළු සංස්කරණයන් සඳහා පමණි (අකුරු දෝෂයක් නිවැරදි කිරීම වැනි).

source: If your instance has background jobs enabled then the event might not get published immediately.
si_lk: ඔබගේ නිදසුනෙහි පසුබිම් රැකියා සක්‍රීය කර තිබේ නම්, එම සිදුවීම වහාම ප්‍රකාශනය නොවනු ඇත.

source: The MISP interface allows the user to have an overview over or to search for events and attributes of events that are already stored in the system in various ways.
si_lk: MISP අතුරුමුහුණත මඟින් පරිශීලකයාට දළ විශ්ලේෂණයක් ලබා ගැනීමට හෝ පද්ධතිය තුළ දැනටමත් විවිධ ආකාරවලින් ගබඩා කර ඇති සිදුවීම් සහ ගුණාංග සෙවීමට ඉඩ ලබා දේ.

source: To list all events
si_lk: සියලුම සිදුවීම් ලැයිස්තුගත කිරීමට

source: On the left menu bar, the option "List events" will generate a list of the last 60 events. While the attributes themselves aren't shown in this view, the following pieces of information can be seen
si_lk: වම් මෙනු තීරුවේ, "සිද්ධි ලැයිස්තුගත කරන්න" විකල්පය මඟින් අවසාන සිදුවීම් 60 ලැයිස්තුවක් ජනනය කරනු ඇත. මෙම දර්ශනයේ ගුණාංගයන්ම නොපෙන්වන අතර, පහත තොරතුරු කොටස් දැකිය හැක

source: List events
si_lk: සිදුවීම් ලැයිස්තුගත කරන්න

source: This is the list of events in the system. Use the buttons to the right to alter or view any of the events.
si_lk: පද්ධතියේ සිදුවීම් ලැයිස්තුව මෙයයි. ඕනෑම සිදුවීමක් වෙනස් කිරීමට හෝ බැලීමට දකුණු පස ඇති බොත්තම් භාවිතා කරන්න.

source: Already published events are marked by a checkmark. Unpublished events are marked by a cross.
si_lk: දැනටමත් ප්‍රකාශිත සිදුවීම් සලකුණු සලකුණකින් සලකුණු කර ඇත. ප්‍රකාශයට පත් නොකළ සිදුවීම් කුරුසයකින් සලකුණු කර ඇත.

source: The organisation that created the event.
si_lk: උත්සවය නිර්මාණය කළ සංවිධානය.

source: The organisation that owns the event on this instance. This field is only visible to administrators.
si_lk: මෙම අවස්ථාවෙහි සිදුවීම අයිති සංවිධානයයි. මෙම ක්ෂේත්‍රය පෙනෙන්නේ පරිපාලකයින්ට පමණි.

source: The event's ID number, assigned by the system when the event was first entered (or in the case of an event that was synchronized, when it was first copied over - more on synchronisation in chapter xy)
si_lk: සිදුවීම ප්‍රථම වරට ඇතුළු කළ විට පද්ධතිය විසින් පවරන ලද සිදුවීමේ හැඳුනුම්පත අංකය (හෝ සමමුහුර්ත වූ සිදුවීමක් නම්, එය ප්‍රථමයෙන් පිටපත් කළ විට - xy පරිච්ඡේදයේ සමමුහුර්තකරණය පිළිබඳ වැඩි විස්තර)

source: Tags that are assigned to this event.
si_lk: මෙම සිදුවීමට පවරා ඇති ටැග්.
