Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: You can post an XML or JSON object containing additional parameters in the following formats
si_lk: ඔබට පහත ආකෘතිවලින් අමතර පරාමිති අඩංගු XML හෝ JSON වස්තුවක් පළ කළ හැක

source: The xml download also accepts two additional the following optional parameters in the URL
si_lk: xml බාගැනීම URL හි පහත විකල්ප පරාමිතීන් දෙකක් ද පිළිගනී

source: Restrict the download to a single event
si_lk: බාගත කිරීම තනි සිදුවීමකට සීමා කරන්න

source: A boolean field that determines whether attachments should be encoded and a second parameter that controls the eligible tags.
si_lk: ඇමුණුම් සංකේතනය කළ යුතුද යන්න තීරණය කරන බූලියන් ක්ෂේත්‍රයක් සහ සුදුසුකම් ලත් ටැග් පාලනය කරන දෙවන පරාමිතිය.

source: To include a tag in the results just write its names into this parameter. To exclude a tag prepend it with a '!'. You can also chain several tag commands together with the '&amp;&amp;' operator. Please be aware the colons (:) cannot be used in the tag search. Use semicolons instead (the search will automatically search for colons instead). For example, to include tag1 and tag2 but exclude tag3 you would use
si_lk: ප්‍රතිඵලවලට ටැගයක් ඇතුළත් කිරීමට එහි නම් මෙම පරාමිතියට ලියන්න. ටැගයක් බැහැර කිරීම සඳහා එය '!' සමඟින් පෙරන්න. ඔබට '&amp;&amp;' ක්‍රියාකරු සමඟ ටැග් විධාන කිහිපයක් දාමගත කළ හැක. ටැග් සෙවීමේදී තීරු (:) භාවිතා කළ නොහැකි බව කරුණාවෙන් සලකන්න. ඒ වෙනුවට අර්ධ කෝල භාවිතා කරන්න (සෙවීම ස්වයංක්‍රීයව ඒ වෙනුවට තීරු සඳහා සොයනු ඇත). උදාහරණයක් ලෙස, tag1 සහ tag2 ඇතුළත් කිරීමට නමුත් ඔබ භාවිතා කරන tag3 බැහැර කරන්න

source: Also check out the %s to read about the REST API.
si_lk: REST API ගැන කියවීමට %s ද පරීක්ෂා කරන්න.

source: CSV Export
si_lk: CSV අපනයනය

source: An automatic export of attributes is available as CSV. Only attributes that are flagged "to_ids" will get exported.
si_lk: උපලක්ෂණ ස්වයංක්‍රීය අපනයනයක් CSV ලෙස ලබා ගත හැක. "to_ids" සලකුණු කර ඇති ගුණාංග පමණක් නිර්යාත කරනු ලැබේ.

source: You can specify additional flags for CSV exports as follows
si_lk: ඔබට පහත පරිදි CSV අපනයනය සඳහා අමතර කොඩි නියම කළ හැක

source: Setting this flag to true will include attributes that are not marked "to_ids".
si_lk: මෙම ධජය සත්‍ය ලෙස සැකසීමට "to_ids" ලෙස සලකුණු නොකළ ගුණාංග ඇතුළත් වේ.

source: For example, to only download a csv generated of the "domain" type and the "Network activity" category attributes all events except for the one and further restricting it to events that are tagged "tag1" or "tag2" but not "tag3", only allowing attributes that are IDS flagged use the following syntax
si_lk: උදාහරණයක් ලෙස, "වසම්" වර්ගය සහ "ජාල ක්‍රියාකාරකම්" කාණ්ඩයෙන් උත්පාදනය කරන ලද csv එකක් පමණක් බාගත කිරීම සඳහා, එකක් හැර අනෙකුත් සියලුම සිදුවීම් ආරෝපණය කර එය "tag1" හෝ "tag2" ලෙස ටැග් කර ඇති නමුත් "tag3" නොවන සිදුවීම් වලට තවදුරටත් සීමා කරයි. , IDS සලකුණු කර ඇති ගුණාංග වලට පමණක් පහත වාක්‍ය ඛණ්ඩය භාවිතා කිරීමට ඉඩ දෙයි

source: Include the event data with each attribute.
si_lk: එක් එක් ගුණාංගය සමඟ සිදුවීම් දත්ත ඇතුළත් කරන්න.

source: Events published within the last x amount of time, where x can be defined in days, hours, minutes (for example 5d or 12h or 30m).This filter will use the published timestamp of the event.
si_lk: අවසාන x කාල ප්‍රමාණය තුළ ප්‍රකාශනය කරන ලද සිදුවීම්, x දින, පැය, මිනිත්තු (උදාහරණයක් ලෙස 5d හෝ 12h හෝ 30m) වලින් අර්ථ දැක්විය හැක. මෙම පෙරහන සිදුවීමේ ප්‍රකාශිත වේලා මුද්‍රාව භාවිත කරනු ඇත.

source: The CSV created when this setting is set to true will not contain the header row. <b>enforceWarninglist</b>: All attributes that have a hit on a warninglist will be excluded.
si_lk: මෙම සැකසුම සත්‍ය ලෙස සකසා ඇති විට සාදන ලද CSV හි ශීර්ෂ පේළිය අඩංගු නොවේ. <b>enforceWarninglist</b>: අනතුරු ඇඟවීමේ ලැයිස්තුවක පහරක් ඇති සියලුම ගුණාංග බැහැර කරනු ලැබේ.

source: To export the attributes of all events that are of the type "domain", use the following syntax
si_lk: "වසම්" වර්ගයේ සියලුම සිදුවීම්වල ගුණාංග නිර්යාත කිරීමට, පහත සින්ටැක්ස් භාවිතා කරන්න

source: NIDS rules export
si_lk: NIDS නීති අපනයනය

source: Automatic export of all network related attributes is available under the Snort rule format. Only <em>published</em> events and attributes marked as <em>IDS Signature</em> are exported.
si_lk: Snort රීති ආකෘතිය යටතේ සියලුම ජාල ආශ්‍රිත ගුණාංග ස්වයංක්‍රීයව අපනයනය කළ හැක. ප්‍රකාශිත සිදුවීම්</em> ක් සහ IDS අත්සන <em>ක් ලෙස සලකුණු කර ඇති ගුණාංග <em></em> පමණක් අපනයනය කෙරේ.

source: The full API syntax is as follows
si_lk: සම්පූර්ණ API වාක්‍ය ඛණ්ඩය පහත පරිදි වේ

source: The export format, can be "suricata" or "snort"
si_lk: අපනයන ආකෘතිය, "suricata" හෝ "snort" විය හැක

source: Some commented out explanation framing the data. The reason to disable this would be if you would like to concatenate a list of exports from various select events in order to avoid unnecessary duplication of the comments.
si_lk: ඇතැමුන් දත්ත රාමු කරන පැහැදිලි කිරීම් ගැන අදහස් දැක්වූහ. මෙය අක්‍රිය කිරීමට හේතුව වනුයේ අදහස් අනවශ්‍ය ලෙස අනුපිටපත් වීම වැලැක්වීම සඳහා විවිධ තෝරාගත් සිදුවීම් වලින් අපනයන ලැයිස්තුවක් ඒකාබද්ධ කිරීමට ඔබ කැමති නම් ය.

source: Events published within the last x amount of time, where x can be defined in days, hours, minutes (for example 6d or 12h or 30m). This filter will use the published timestamp of the event.
si_lk: අවසාන x කාලය තුළ ප්‍රකාශිත සිදුවීම්, x දින, පැය, මිනිත්තු (උදාහරණයක් ලෙස 6d හෝ 12h හෝ 30m) වලින් අර්ථ දැක්විය හැක. මෙම පෙරහන සිදුවීමේ ප්‍රකාශිත වේලා මුද්‍රාව භාවිත කරනු ඇත.

source: Restrict the export to only use the given types.
si_lk: ලබා දී ඇති වර්ග පමණක් භාවිතා කිරීමට අපනයනය සීමා කරන්න.

source: All tags will be included even if not exportable.
si_lk: අපනයනය කළ නොහැකි වුවද සියලුම ටැග් ඇතුළත් වේ.

source: An example for a suricata export for all events excluding those tagged tag1, without all of the commented information at the start of the file would look like this:
si_lk: ටැග් 1 හැර අනෙකුත් සියලුම සිදුවීම් සඳහා suricata නිර්යාත කිරීම සඳහා උදාහරණයක්, ගොනුවේ ආරම්භයේ ඇති සියලුම අදහස් දැක්වීම් තොරතුරු නොමැතිව දිස් වනු ඇත:

source: Administration is able to maintain a white-list containing host, domain name and IP numbers to exclude from the NIDS export.
si_lk: NIDS අපනයනයෙන් බැහැර කිරීම සඳහා සත්කාරක, වසම් නාමය සහ IP අංක අඩංගු සුදු ලැයිස්තුවක් පවත්වා ගැනීමට පරිපාලනයට හැකි වේ.

source: Hash database export
si_lk: හැෂ් දත්ත සමුදාය අපනයනය

source: Automatic export of MD5/SHA1 checksums contained in file-related attributes. This list can be used to feed forensic software when searching for suspicious files. Only <em>published</em> events and attributes marked as <em>IDS Signature</em> are exported.
si_lk: ගොනු ආශ්‍රිත ගුණාංගවල අඩංගු MD5/SHA1 චෙක්සම් ස්වයංක්‍රීයව අපනයනය කිරීම. සැක සහිත ගොනු සෙවීමේදී අධිකරණ වෛද්‍ය මෘදුකාංගය පෝෂණය කිරීමට මෙම ලැයිස්තුව භාවිතා කළ හැක. ප්‍රකාශිත සිදුවීම්</em> ක් සහ IDS අත්සන <em>ක් ලෙස සලකුණු කර ඇති ගුණාංග <em></em> පමණක් අපනයනය කෙරේ.

source: You can configure your tools to automatically download the following files
si_lk: පහත ගොනු ස්වයංක්‍රීයව බාගැනීමට ඔබට ඔබගේ මෙවලම් වින්‍යාසගත කළ හැක

source: The API's full format is as follows
si_lk: API හි සම්පූර්ණ ආකෘතිය පහත පරිදි වේ

source: The export format, can be "md5" or "sha1"
si_lk: අපනයන ආකෘතිය, "md5" හෝ "sha1" විය හැක

source: For example, to only show sha1 values from events tagged tag1, use
si_lk: උදාහරණයක් ලෙස, tag1 ලෙස ටැග් කර ඇති සිදුවීම් වලින් sha1 අගයන් පමණක් පෙන්වීමට, භාවිතා කරන්න

source: STIX export
si_lk: STIX අපනයනය

source: You can export MISP events in Mitre's STIX format (to read more about STIX, click <a href="https://stix.mitre.org/">here</a>). The STIX XML export is currently very slow and can lead to timeouts with larger events or collections of events. The JSON return format does not suffer from this issue. Usage
si_lk: ඔබට Mitre හි STIX ආකෘතියෙන් MISP සිදුවීම් නිර්යාත කළ හැක (STIX ගැන වැඩිදුර කියවීමට, මෙහි <a href="https://stix.mitre.org/">ක්ලික් කරන්න</a>). STIX XML අපනයනය දැනට ඉතා මන්දගාමී වන අතර විශාල සිදුවීම් හෝ සිදුවීම් එකතු කිරීම් සමඟ කල් ඉකුත්වීමට හේතු විය හැක. JSON ආපසු ආකෘතිය මෙම ගැටලුවෙන් පීඩා විඳින්නේ නැත. භාවිතය

source: Search parameters can be passed to the function via URL parameters or by POSTing an XML or JSON object (depending on the return type). The following parameters can be passed to the STIX export tool: <code>id</code>, <code>withAttachments</code>, <code>tags</code>. Both <code>id</code> and <code>tags</code> can use the <code>&amp;&amp;</code> (and) and <code>!</code> (not) operators to build queries. Using the URL parameters, the syntax is as follows
si_lk: සෙවුම් පරාමිති URL පරාමිති හරහා හෝ XML හෝ JSON වස්තුවක් පළ කිරීමෙන් (ආපසු එන වර්ගය අනුව) ශ්‍රිතයට යැවිය හැක. පහත පරාමිතීන් STIX අපනයන මෙවලම වෙත ලබා දිය හැක: <code>id</code>, <code>ඇමුණුම්</code>, <code>ටැග්</code>සමඟ . <code>id</code> සහ <code>ටැග්</code> දෙකටම <code>&amp;&amp;</code> (සහ) සහ <code>භාවිතා කළ හැක! විමසුම් ගොඩනැගීමට ක්‍රියාකරුවන්</code> (නොවේ). URL පරාමිති භාවිතා කරමින්, වාක්‍ය ඛණ්ඩය පහත පරිදි වේ

source: The event's ID
si_lk: සිද්ධියේ හැඳුනුම්පත

source: Encode attachments where applicable
si_lk: අදාළ වන විට ඇමුණුම් සංකේත කරන්න

source: Various ways to narrow down the search results of the STIX export
si_lk: STIX අපනයනයේ සෙවුම් ප්‍රතිඵල අඩු කිරීමට විවිධ ක්‍රම

source: For example, to retrieve all events tagged "APT1" but excluding events tagged "OSINT" and excluding events #51 and #62 without any attachments
si_lk: උදාහරණයක් ලෙස, "APT1" ටැග් කර ඇති නමුත් "OSINT" ටැග් කර ඇති සිදුවීම් හැර සහ කිසිදු ඇමුණුමක් නොමැතිව සිදුවීම් #51 සහ #62 හැර සියලුම සිදුවීම් ලබා ගැනීමට

source: To export the same events using a POST request use
si_lk: POST ඉල්ලීමක් භාවිතයෙන් එකම සිදුවීම් අපනයනය කිරීමට

source: Together with this JSON object in the POST message
si_lk: POST පණිවිඩයේ මෙම JSON වස්තුව සමඟ එක්ව

source: XML is automagically assumed when using the stix export
si_lk: ස්ටික්ස් අපනයනය භාවිතා කරන විට XML ස්වයංක්‍රීයව උපකල්පනය කෙරේ

source: The same search could be accomplished using the following POSTed XML object (note that ampersands need to be escaped, or alternatively separate id and tag elements can be used)
si_lk: පහත පළ කරන ලද XML වස්තුව භාවිතයෙන් එකම සෙවීම සිදු කළ හැකිය (ඇම්පර්සන්ඩ් ගැලවිය යුතු බව සලකන්න, නැතහොත් විකල්ප වශයෙන් වෙනම හැඳුනුම්පත සහ ටැග් මූලද්‍රව්‍ය භාවිතා කළ හැක)

source: RPZ export
si_lk: RPZ අපනයනය

source: It is possible to further restrict the exported values using the following filters
si_lk: පහත ෆිල්ටර භාවිතයෙන් අපනයනය කරන ලද අගයන් තවදුරටත් සීමා කළ හැක

source: To include a tag in the results just write its names into this parameter. To exclude a tag prepend it with a '!'. You can also chain several tag commands together with the '&amp;&amp;' operator. Please be aware the colons (:) cannot be used in the tag search when passed through the url.
si_lk: ප්‍රතිඵලවලට ටැගයක් ඇතුළත් කිරීමට එහි නම් මෙම පරාමිතියට ලියන්න. ටැගයක් බැහැර කිරීම සඳහා එය '!' සමඟින් පෙරන්න. ඔබට '&amp;&amp;' ක්‍රියාකරු සමඟ ටැග් විධාන කිහිපයක් දාමගත කළ හැක. url එක හරහා ගිය විට ටැග් සෙවුමේ තීරු (:) භාවිතා කළ නොහැකි බව කරුණාවෙන් සලකන්න.

source: Use semicolons instead (the search will automatically search for colons instead)
si_lk: ඒ වෙනුවට අර්ධ කෝල භාවිතා කරන්න (සෙවීම ස්වයංක්‍රීයව ඒ වෙනුවට තීරු සඳහා සොයනු ඇත)

source: Events with the date set to a date after the one specified in the from field (format: 2015-02-03)
si_lk: සිට ක්‍ෂේත්‍රයේ නිශ්චිතව දක්වා ඇති දිනයට පසු දිනයක් නියම කර ඇති සිදුවීම් (ආකෘතිය: 2015-02-03)

source: Events with the date set to a date before the one specified in the to field (format: 2015-02-03)
si_lk: ක්ෂේත්‍රයේ දක්වා ඇති දිනයට පෙර දිනයට සකසන ලද සිදුවීම් (ආකෘතිය: 2015-02-03)

source: Text export
si_lk: පෙළ අපනයනය

source: >An export of all attributes of a specific type to a plain text file. By default only published and IDS flagged attributes are exported.
si_lk: >නිශ්චිත වර්ගයක සියලුම ගුණාංග සාමාන්‍ය පෙළ ගොනුවකට අපනයනය කිරීම. පෙරනිමියෙන් පමණක් ප්‍රකාශිත සහ IDS සලකුණු කළ උපලක්ෂණ අපනයනය කෙරේ.

source: To restrict the results by tags, use the usual syntax. Please be aware the colons (:) cannot be used in the tag search. Use semicolons instead (the search will automatically search for colons instead). To get ip-src values from events tagged tag1 but not tag2 use
si_lk: ටැග් මගින් ප්‍රතිඵල සීමා කිරීමට, සාමාන්‍ය වාක්‍ය ඛණ්ඩය භාවිතා කරන්න. ටැග් සෙවීමේදී තීරු (:) භාවිතා කළ නොහැකි බව කරුණාවෙන් සලකන්න. ඒ වෙනුවට semicolons භාවිතා කරන්න (සෙවීම ස්වයංක්‍රීයව ඒ වෙනුවට colon සඳහා සොයනු ඇත). tag1 ලෙස ටැග් කර ඇති නමුත් tag2 භාවිතා නොකරන සිදුවීම් වලින් ip-src අගයන් ලබා ගැනීමට

source: As of version 2.3.38, it is possible to restrict the text exports on two additional flags. The first allows the user to restrict based on event ID, whilst the second is a boolean switch allowing non IDS flagged attributes to be exported. Additionally, choosing "all" in the type field will return all eligible attributes.
si_lk: 2.3.38 අනුවාදයට අනුව, අමතර කොඩි දෙකක් මත පෙළ අපනයන සීමා කළ හැක. පළමුවැන්න සිදුවීම් හැඳුනුම්පත මත පදනම්ව සීමා කිරීමට පරිශීලකයාට ඉඩ සලසයි, දෙවැන්න IDS සලකුණු නොකළ ගුණාංග අපනයනය කිරීමට ඉඩ සලසන බූලියන් ස්විචයකි. අතිරේකව, වර්ග ක්ෂේත්‍රයේ "සියල්ල" තේරීමෙන් සියලුම සුදුසුකම් ලත් ගුණාංග ලබා දෙනු ඇත.

source: Only export the attributes of the given event ID
si_lk: ලබා දී ඇති සිදුවීම් ID හි ගුණාංග පමණක් නිර්යාත කරන්න

source: Include attributes that are not marked to_ids, even if they would normally be excluded. Also overrides the whitelist functionality.
si_lk: ඒවා සාමාන්‍යයෙන් බැහැර කළත්, to_ids වෙත සලකුණු නොකළ ගුණාංග ඇතුළත් කරන්න. සුදු ලැයිස්තු ක්‍රියාකාරීත්වය ද අභිබවා යයි.

source: Include not published Events.
si_lk: ප්‍රකාශිත නොවන සිදුවීම් ඇතුළත් කරන්න.

source: You can also chain several tag commands together with the '&amp;&amp;' operator. Please be aware the colons (:) cannot be used in the tag search. Use semicolons instead (the search will automatically search for colons instead). For example, to include tag1 and tag2 but exclude tag3 you would use
si_lk: ඔබට '&amp;&amp;' ක්‍රියාකරු සමඟ ටැග් විධාන කිහිපයක් දාමගත කළ හැක. ටැග් සෙවීමේදී තීරු (:) භාවිතා කළ නොහැකි බව කරුණාවෙන් සලකන්න. ඒ වෙනුවට semicolons භාවිතා කරන්න (සෙවීම ස්වයංක්‍රීයව ඒ වෙනුවට තීරු සඳහා සොයනු ඇත). උදාහරණයක් ලෙස, tag1 සහ tag2 ඇතුළත් කිරීමට නමුත් ඔබ භාවිතා කරන tag3 බැහැර කරන්න

source: Searches with JSON/XML/OpenIOC results
si_lk: JSON/XML/OpenIOC ප්‍රතිඵල සමඟින් සෙවුම්

source: Set the return format of the search (Currently supported: json, xml, openioc - more formats coming soon).
si_lk: සෙවුමේ ආපසු ආකෘතිය සකසන්න (දැනට සහය දක්වයි: json, xml, openioc - තවත් ආකෘති ළඟදීම පැමිණේ).

source: To include a tag in the results just write its names into this parameter. To exclude a tag prepend it with a '!'. To filter on several values for the same parameter, simply use arrays, such as in the following example
si_lk: ප්‍රතිඵලවලට ටැගයක් ඇතුළත් කිරීමට එහි නම් මෙම පරාමිතියට ලියන්න. ටැගයක් බැහැර කිරීම සඳහා එය '!' සමඟින් පෙරන්න. එකම පරාමිතිය සඳහා අගයන් කිහිපයක් මත පෙරීමට, පහත උදාහරණයේ වැනි අරා භාවිතා කරන්න

source: Restrict the results by the last publish timestamp (newer than).
si_lk: අවසාන ප්‍රකාශන කාල මුද්‍රාවෙන් ප්‍රතිඵල සීමා කරන්න (අලුත් වඩා).

source: Restrict the results by the timestamp (last edit). Any event with a timestamp newer than the given timestamp will be returned. In case you are dealing with /attributes as scope, the attribute's timestamp will be used for the lookup.
si_lk: කාල මුද්‍රාව මගින් ප්‍රතිඵල සීමා කරන්න (අවසන් සංස්කරණය). ලබා දී ඇති වේලා මුද්‍රාවට වඩා අලුත් වේලා මුද්‍රාවක් සහිත ඕනෑම සිදුවීමක් ආපසු ලබා දෙනු ඇත. ඔබ විෂය පථය ලෙස /ගුණාංග සමඟ කටයුතු කරන්නේ නම්, උපලක්ෂණයේ වේලා මුද්‍රාව සෙවීම සඳහා භාවිතා කරනු ඇත.

source: For example, to find any event with the term "red october" mentioned, use the following syntax (the example is shown as a POST request instead of a GET, which is highly recommended. GET requests are problematic and deprecated.)
si_lk: උදාහරණයක් ලෙස, සඳහන් කර ඇති "රතු ඔක්තෝම්බර්" යන යෙදුම සමඟ ඕනෑම සිදුවීමක් සොයා ගැනීමට, පහත වාක්‍ය ඛණ්ඩය භාවිතා කරන්න (උදාහරණ GET වෙනුවට POST ඉල්ලීමක් ලෙස පෙන්වා ඇත, එය බෙහෙවින් නිර්දේශ කෙරේ. GET ඉල්ලීම් ගැටළු සහගත සහ අත්හරින ලදී.)

source: To just return a list of attributes, use the following syntax
si_lk: ගුණාංග ලැයිස්තුවක් ලබා දීමට, පහත වාක්‍ය ඛණ්ඩය භාවිතා කරන්න

source: Events with the date set to a date after the one specified in the from field (format: 2015-02-15)
si_lk: සිට ක්ෂේත්‍රයේ දක්වා ඇති දිනයට පසු දිනයට සකසන ලද සිදුවීම් (ආකෘතිය: 2015-02-15)

source: Events with the date set to a date before the one specified in the to field (format: 2015-02-15)
si_lk: ක්ෂේත්‍රයේ දක්වා ඇති දිනයට පෙර දිනයට නියමිත දිනය සහිත සිදුවීම් (ආකෘතිය: 2015-02-15)

source: Restrict the results by the timestamp (of the attribute). Any attributes with a timestamp newer than the given timestamp will be returned.
si_lk: ප්‍රතිඵල වේලා මුද්‍රාවෙන් සීමා කරන්න (ගුණාංගයේ). ලබා දී ඇති වේලා මුද්‍රාවට වඩා අලුත් වේලා මුද්‍රාවක් සහිත ඕනෑම උපලක්ෂණයක් ආපසු ලබා දෙනු ඇත.

source: Only return attributes from events that have received a modification after the given timestamp.
si_lk: ලබා දී ඇති වේලා මුද්‍රාවෙන් පසුව වෙනස් කිරීමක් ලැබුණු සිදුවීම්වලින් පමණක් උපලක්ෂණ ආපසු ලබා දෙන්න.

source: The keywords false or null should be used for optional empty parameters in the URL. Keep in mind, this is only needed if you use the deprecated URL parameters.
si_lk: URL හි විකල්ප හිස් පරාමිති සඳහා අසත්‍ය හෝ ශුන්‍ය මූල පද භාවිතා කළ යුතුය. මතක තබා ගන්න, මෙය අවශ්‍ය වන්නේ ඔබ අත්හරින ලද URL පරාමිති භාවිතා කරන්නේ නම් පමණි.

source: value, type, category and org are optional. It is possible to search for several terms in each category by joining them with the '&amp;&amp;' operator. It is also possible to negate a term with the '!' operator. Please be aware the colons (:) cannot be used in the tag search. Use semicolons instead (the search will automatically search for colons instead). For example, in order to search for all attributes created by your organisation that contain 192.168 or 127.0 but not 0.1 and are of the type ip-src, excluding the events that were tagged tag1 use the following syntax
si_lk: අගය, වර්ගය, වර්ගය සහ org විකල්ප වේ. '&amp;&amp;' ක්‍රියාකරු සමඟ සම්බන්ධ වීමෙන් එක් එක් කාණ්ඩයේ පද කිහිපයක් සෙවිය හැක. '!' සමඟ පදයක් නිෂේධනය කිරීමට ද හැකිය. ක්රියාකරු. ටැග් සෙවීමේදී තීරු (:) භාවිතා කළ නොහැකි බව කරුණාවෙන් සලකන්න. ඒ වෙනුවට semicolons භාවිතා කරන්න (සෙවීම ස්වයංක්‍රීයව ඒ වෙනුවට colon සඳහා සොයනු ඇත). උදාහරණයක් ලෙස, 192.168 හෝ 127.0 අඩංගු නමුත් 0.1 නොවන සහ ip-src වර්ගයේ ඔබේ සංවිධානය විසින් නිර්මාණය කරන ලද සියලුම ගුණාංග සෙවීම සඳහා, ටැග් 1 ලෙස ටැග් කර ඇති සිදුවීම් හැර, පහත සින්ටැක්ස් භාවිතා කරන්න.

source: You can also use search for IP addresses using CIDR. Make sure that you use '|' (pipe) instead of '/' (slashes). Please be aware the colons (:) cannot be used in the tag search. Use semicolons instead (the search will automatically search for colons instead). See below for an example
si_lk: ඔබට CIDR භාවිතයෙන් IP ලිපින සෙවීමද භාවිතා කළ හැක. ඔබ '|' භාවිතා කරන බවට වග බලා ගන්න (පයිප්ප) '/' වෙනුවට (slashes). ටැග් සෙවීමේදී තීරු (:) භාවිතා කළ නොහැකි බව කරුණාවෙන් සලකන්න. ඒ වෙනුවට semicolons භාවිතා කරන්න (සෙවීම ස්වයංක්‍රීයව ඒ වෙනුවට colon සඳහා සොයනු ඇත). උදාහරණයක් සඳහා පහත බලන්න

source: Merge all objects, attributes and their respective tags from the selected event into event #%s
si_lk: තෝරාගත් සිදුවීමෙන් සියලුම වස්තු, ගුණාංග සහ ඒවාට අදාළ ටැග් #%sසිදුවීමට ඒකාබද්ධ කරන්න

source: Source event ID or UUID
si_lk: මූලාශ්‍ර සිදුවීම් ID හෝ UUID

source: ID or UUID of the event to merge from
si_lk: ඒකාබද්ධ කිරීමට සිදුවීමේ ID හෝ UUID

source: Event with proposals
si_lk: යෝජනා සමග උත්සවය

source: Contributors
si_lk: දායකයන්

source: Return to the event restoration index
si_lk: සිදුවීම් ප්‍රතිසාධන දර්ශකය වෙත ආපසු යන්න

source: Data
si_lk: දත්ත

source: Recovery process log
si_lk: ප්‍රතිසාධන ක්‍රියාවලි ලොගය

source: Below is a list of actions the recovery process would take in order to restore the event.
si_lk: සිදුවීම ප්‍රතිසාධනය කිරීම සඳහා ප්‍රතිසාධන ක්‍රියාවලිය විසින් ගනු ලබන ක්‍රියාමාර්ග ලැයිස්තුවක් පහත දැක්වේ.

source: Listing invalid event validations
si_lk: වලංගු නොවන සිදුවීම් වලංගු කිරීම් ලැයිස්තුගත කිරීම

source: Events analysed: %s
si_lk: විශ්ලේෂණය කළ සිදුවීම්: %s

source: Validation errors for event: %s
si_lk: සිදුවීම සඳහා වලංගු කිරීමේ දෝෂ: %s

source: Attribute details
si_lk: ගුණාංග විස්තර

source: Below you can see the %s that are to be created. Make sure that the categories and the types are correct, often several options will be offered based on an inconclusive automatic resolution.
si_lk: පහලින් ඔයාලට බලාගන්න පුලුවන් හදන්න යන %s . ප්‍රවර්ග සහ වර්ග නිවැරදි බවට වග බලා ගන්න, බොහෝ විට අවිනිශ්චිත ස්වයංක්‍රීය විභේදනයක් මත විකල්ප කිහිපයක් ඉදිරිපත් කරනු ඇත.

source: Warning: You are missing warninglist(s) that are used to recognise TLDs. Make sure your MISP has the warninglist submodule enabled and updated or else this tool might end up missing valid domains/hostnames/urls. The missing lists are: %s
si_lk: අවවාදයයි: TLDs හඳුනා ගැනීමට භාවිතා කරන අනතුරු ඇඟවීමේ ලැයිස්තුව(ය) ඔබට මග හැරී ඇත. ඔබගේ MISP හි අනතුරු ඇඟවීමේ ලැයිස්තු උප මොඩියුලය සක්‍රීය කර යාවත්කාලීන කර ඇති බවට වග බලා ගන්න, එසේ නොමැතිනම් මෙම මෙවලම වලංගු වසම්/ධාරක නාම/url අතුරුදහන් විය හැක. නැතිවූ ලැයිස්තු වන්නේ: %s

source: Proposals instead of attributes
si_lk: ගුණාංග වෙනුවට යෝජනා

source: Similar Attributes
si_lk: සමාන ගුණාංග

source: Disable Correlation
si_lk: සහසම්බන්ධය අබල කරන්න

source: Tags (separated by comma)
si_lk: ටැග් (කොමාවෙන් වෙන් කර ඇත)

source: 10 +more
si_lk: 10 + තවත්

source: Remove resolved attribute
si_lk: විසඳන ලද ගුණාංගය ඉවත් කරන්න

source: Submit %s
si_lk: %sඉදිරිපත් කරන්න

source: Apply changes to all applicable resolved attributes
si_lk: සියලුම අදාළ විසඳන ලද ගුණාංග සඳහා වෙනස්කම් යොදන්න

source: Change all
si_lk: සියල්ල වෙනස් කරන්න

source: Update all comment fields
si_lk: සියලුම අදහස් ක්ෂේත්‍ර යාවත්කාලීන කරන්න

source: Event UUID
si_lk: සිදුවීම UUID

source: Event creator org
si_lk: සිදුවීම් නිර්මාතෘ සංවිධානය

source: # of resolved Attributes
si_lk: විසඳන ලද ගුණාංග #

source: # of resolved Reports
si_lk: විසඳන ලද වාර්තා #

source: Import
si_lk: ආනයන

source: Content
si_lk: අන්තර්ගතය

source: Meta Category:
si_lk: මෙටා කාණ්ඩය:

source: %s (%s object)
si_lk: %s (%s වස්තුව)

source: Event Id
si_lk: සිදුවීම් හැඳුනුම්පත

source: Creation time
si_lk: නිර්මාණ කාලය

source: Deletion time
si_lk: මකාදැමීමේ කාලය

source: Event Creator
si_lk: සිදුවීම් නිර්මාතෘ

source: Event Owner
si_lk: සිදුවීම් හිමිකරු

source: Deleted By
si_lk: විසින් මකා දමන ලදී

source: Below are a list of events that can be recovered via the log entries. Make sure that your log table is well indexed (adding indeces to `model`, `model_id`, `created` and `action` highly recommended).
si_lk: ලොග් ඇතුළත් කිරීම් හරහා ප්‍රතිසාධනය කළ හැකි සිදුවීම් ලැයිස්තුවක් පහත දැක්වේ. ඔබගේ ලොග් වගුව හොඳින් සුචිගත කර ඇති බවට වග බලා ගන්න ('ආකෘතිය', 'model_id', `නිර්මාණය' සහ 'ක්‍රියාව' වෙත දර්ශක එකතු කිරීම ඉතා නිර්දේශිතයි).

source: Mock the recovery process and output the potential changes
si_lk: ප්‍රතිසාධන ක්‍රියාවලිය සමච්චල් කර විභව වෙනස්කම් ප්‍රතිදානය කරන්න

source: Are you sure you want to mock the recovery of the event? No data will be modified, but the request might take some time.
si_lk: ඔබට සිදුවීම ප්‍රතිසාධනය සමච්චල් කිරීමට අවශ්‍ය බව විශ්වාසද? දත්ත කිසිවක් වෙනස් නොකරනු ඇත, නමුත් ඉල්ලීමට යම් කාලයක් ගතවනු ඇත.

source: Execute the recovery process
si_lk: ප්රතිසාධන ක්රියාවලිය ක්රියාත්මක කරන්න

source: Are you sure you want to attempt to recover the event?
si_lk: ඔබට සිදුවීම ප්‍රතිසාධන කිරීමට උත්සාහ කිරීමට අවශ්‍ය බව විශ්වාසද?

source: >Results of the import
si_lk: >ආනයනයේ ප්රතිඵල

source: %s attributes created successfully, %s indicators could not be mapped and saved.
si_lk: උපලක්ෂණ %s ක් සාර්ථකව සාදන ලදී, දර්ශක %s ක් සිතියම්ගත කර සුරැකීමට නොහැකි විය.

source: Successfully added attributes
si_lk: උපලක්ෂණ සාර්ථකව එකතු කරන ලදී

source: Failed indicators
si_lk: අසාර්ථක දර්ශක

source: Search term
si_lk: සොයන්න කාලීන

source: Visualisation
si_lk: දෘශ්යකරණය

source: Import analysis file
si_lk: විශ්ලේෂණ ගොනුව ආයාත කරන්න

source: Create Objects
si_lk: වස්තූන් සාදන්න

source: Import %s file
si_lk: %s ගොනුවක් ආයාත කරන්න

source: %s file
si_lk: %s ගොනුව
