Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: Unhide all selected tags
si_lk: තෝරාගත් සියලුම ටැග් නොසඟවන්න

source: Expanded
si_lk: පුළුල් කර ඇත

source: Numerical Value
si_lk: සංඛ්යාත්මක අගය

source: Numerical value overridden by userSetting.&#10;Original numerical_value = %s
si_lk: සංඛ්‍යාත්මක අගය userSetting මගින් අභිබවා යයි.&#10;මුල් සංඛ්‍යාත්මක_අගය = %s

source: None
si_lk: කිසිවක් නැත

source: # Events
si_lk: # සිදුවීම්

source: # Attributes
si_lk: # ගුණාංග

source: Are you sure you want to create this tag?
si_lk: ඔබට මෙම ටැගය සෑදීමට අවශ්‍ය බව විශ්වාසද?

source: Create Tag
si_lk: ටැගය සාදන්න

source: Enable Tag
si_lk: ටැගය සක්රිය කරන්න

source: Update Tag
si_lk: ටැගය යාවත්කාලීන කරන්න

source: Disable Tag
si_lk: ටැගය අක්රිය කරන්න

source: Template Elements
si_lk: සැකිලි මූලද්රව්ය

source: Add a new template element
si_lk: නව අච්චු අංගයක් එක් කරන්න

source: Template Element Deletion
si_lk: සැකිලි මූලද්‍රව්‍ය මකාදැමීම

source: Are you sure you want to delete Template Element #%s?
si_lk: ඔබට සැකිලි මූලද්‍රව්‍ය #%sමැකීමට අවශ්‍ය බව විශ්වාසද?

source: Add Attribute Element To Template
si_lk: අච්චුවට Attribute Element එක් කරන්න

source: Select Category
si_lk: වර්ගය තෝරන්න

source: Select Type
si_lk: වර්ගය තෝරන්න

source: Some categories can use complex types. A complex type can define attributes that can be described by various different types, the system will parse the user's entry and determine the most suitable type for the found attributes. The list of valid types for the chosen complex type is shown below.
si_lk: සමහර කාණ්ඩ සංකීර්ණ වර්ග භාවිතා කළ හැක. සංකීර්ණ වර්ගයකට විවිධ විවිධ වර්ග වලින් විස්තර කළ හැකි ගුණාංග නිර්වචනය කළ හැකිය, පද්ධතිය පරිශීලකයාගේ ප්‍රවේශය විග්‍රහ කර සොයාගත් ගුණාංග සඳහා වඩාත් සුදුසු වර්ගය තීරණය කරයි. තෝරාගත් සංකීර්ණ වර්ගය සඳහා වලංගු වර්ග ලැයිස්තුව පහත දැක්වේ.

source: Use complex types
si_lk: සංකීර්ණ වර්ග භාවිතා කරන්න

source: Types allowed based on the above setting
si_lk: ඉහත සැකසුම මත පදනම්ව අවසර දී ඇති වර්ග

source: When checked, attributes created using this element will automatically be marked for IDSes.
si_lk: පරීක්ෂා කළ විට, මෙම මූලද්‍රව්‍ය භාවිතයෙන් සාදන ලද උපලක්ෂණ IDS සඳහා ස්වයංක්‍රීයව ලකුණු කරනු ලැබේ.

source: This setting will make this element mandatory.
si_lk: මෙම සැකසුම මෙම අංගය අනිවාර්ය කරයි.

source: If this checkbox is checked, then the resulting field in the form will allow several values to be entered (separated by a linebreak).
si_lk: මෙම පිරික්සුම් කොටුව සලකුණු කර ඇත්නම්, පෝරමයේ ඇති වන ක්ෂේත්‍රය අගයන් කිහිපයක් ඇතුළත් කිරීමට ඉඩ සලසයි (රේඛා බිඳීමකින් වෙන් කර ඇත).

source: Add attribute element
si_lk: ගුණාංග මූලද්රව්යය එක් කරන්න

source: Choose element type
si_lk: මූලද්රව්ය වර්ගය තෝරන්න

source: Add an attribute element
si_lk: ගුණාංග අංගයක් එක් කරන්න

source: Add a file element
si_lk: ගොනු අංගයක් එක් කරන්න

source: Add a text description to the elements that follow
si_lk: පහත සඳහන් අංග වලට පෙළ විස්තරයක් එක් කරන්න

source: Add File Element To Template
si_lk: සැකිල්ලට ගොනු මූලද්‍රව්‍ය එක් කරන්න

source: If a file is flagged as malicious then it will automatically be encrypted.
si_lk: ගොනුවක් අනිෂ්ට ලෙස සලකුණු කර ඇත්නම් එය ස්වයංක්‍රීයව සංකේතනය වේ.

source: If this checkbox is checked, then the resulting field in the form will allow several files to be uploaded.
si_lk: මෙම පිරික්සුම් කොටුව සලකුණු කර ඇත්නම්, පෝරමයේ ඇති ක්ෂේත්‍රය ගොනු කිහිපයක් උඩුගත කිරීමට ඉඩ සලසයි.

source: Submit the file element
si_lk: ගොනු අංගය ඉදිරිපත් කරන්න

source: Add Text Element To Template
si_lk: සැකිල්ලට පෙළ මූලද්‍රව්‍ය එක් කරන්න

source: Add text description element
si_lk: පෙළ විස්තර අංගය එක් කරන්න

source: Edit Attribute Element
si_lk: ගුණාංග මූලද්‍රව්‍යය සංස්කරණය කරන්න

source: Submit attribute element changes
si_lk: උපලක්ෂණ මූලද්‍රව්‍ය වෙනස්කම් ඉදිරිපත් කරන්න

source: Edit File Element
si_lk: ගොනු මූලද්‍රව්‍යය සංස්කරණය කරන්න

source: Submit file element changes
si_lk: ගොනු මූලද්‍රව්‍ය වෙනස්කම් ඉදිරිපත් කරන්න

source: Submit description changes
si_lk: විස්තර වෙනස්කම් ඉදිරිපත් කරන්න

source: A description of the template
si_lk: සැකිල්ල පිළිබඳ විස්තරයක්

source: Templates
si_lk: සැකිලි

source: Populate From Template Results
si_lk: සැකිලි ප්‍රතිඵල වලින් ජනප්‍රිය කරන්න

source: Below you can see the attributes that are to be created based on the data that you have entered into the template. If you are satisfied with the result, click "Finalise". Otherwise, click "Modify".
si_lk: ඔබ සැකිල්ලට ඇතුළත් කර ඇති දත්ත මත පදනම්ව නිර්මාණය කළ යුතු ගුණාංග පහතින් ඔබට දැක ගත හැකිය. ප්රතිඵලය ගැන ඔබ සෑහීමකට පත්වන්නේ නම්, "අවසන් කරන්න" ක්ලික් කරන්න. එසේ නොමැතිනම්, "වෙනස් කරන්න" ක්ලික් කරන්න.

source: Finalise
si_lk: අවසන් කරන්න

source: Upload Files
si_lk: ගොනු උඩුගත කරන්න

source: Replace File
si_lk: ගොනුව ප්‍රතිස්ථාපනය කරන්න

source: Upload File
si_lk: ගොනුව උඩුගත කරන්න

source: Shareable
si_lk: බෙදාගත හැකි

source: Last Post On
si_lk: අන්තිම පෝස්ට් එක

source: Last Post By
si_lk: අවසන් සටහන මගින්

source: Thread Started On
si_lk: ත්‍රෙඩ් එක පටන් ගත්තා

source: Me
si_lk: මට

source: User settings management
si_lk: පරිශීලක සැකසුම් කළමනාකරණය

source: Manage the individual user settings.
si_lk: තනි පරිශීලක සැකසුම් කළමනාකරණය කරන්න.

source: Are you sure you wish to delete this entry?
si_lk: ඔබට මෙම ප්‍රවේශය මැකීමට අවශ්‍ය බව විශ්වාසද?

source: No preference
si_lk: මනාප නැත

source: Conflicting requirements
si_lk: පරස්පර අවශ්යතා

source: Requested organisation not found.
si_lk: ඉල්ලූ සංවිධානය හමු නොවීය.

source: Create a new organisation
si_lk: නව සංවිධානයක් සාදන්න

source: known remote organisation, will be converted to local
si_lk: දන්නා දුරස්ථ සංවිධානය, දේශීය බවට පරිවර්තනය කරනු ඇත

source: The requested details were as follows Organisation: &nbsp;&nbsp;%s Role: %s
si_lk: ඉල්ලා සිටි විස්තර පහත පරිදි විය සංවිධානය: &nbsp;&nbsp;%s භූමිකාව: %s

source: Accept registrations
si_lk: ලියාපදිංචි කිරීම් පිළිගන්න

source: Role
si_lk: කාර්යභාරය

source: The selected Role does not satisfy the user request
si_lk: තෝරාගත් භූමිකාව පරිශීලක ඉල්ලීම තෘප්තිමත් නොකරයි

source: The selected Role satisfies the user request
si_lk: තෝරාගත් භූමිකාව පරිශීලක ඉල්ලීම තෘප්තිමත් කරයි

source: Admin Add User
si_lk: පරිපාලක පරිශීලක එකතු කරන්න

source: Set password
si_lk: මුරපදය සකසන්න

source: Minimal length
si_lk: අවම දිග

source: Complexity
si_lk: සංකීර්ණත්වය

source: Choose organisation
si_lk: සංවිධානය තෝරන්න

source: Sync user for
si_lk: සඳහා පරිශීලක සමමුහුර්ත කරන්න

source: PGP key
si_lk: PGP යතුර

source: Paste the user's PGP key here or try to retrieve it from the CIRCL key server by clicking on "Fetch PGP key" below.
si_lk: පරිශීලකයාගේ PGP යතුර මෙහි අලවන්න හෝ පහත "PGP යතුර ගෙන එන්න" මත ක්ලික් කිරීමෙන් CIRCL යතුරු සේවාදායකයෙන් එය ලබා ගැනීමට උත්සාහ කරන්න.

source: Fetch the user's PGP key
si_lk: පරිශීලකයාගේ PGP යතුර ලබා ගන්න

source: Fetch PGP key
si_lk: PGP යතුර ලබා ගන්න

source: S/MIME Public certificate (PEM format)
si_lk: S/MIME පොදු සහතිකය (PEM ආකෘතිය)

source: Paste the user's S/MIME public key in PEM format here.
si_lk: පරිශීලකයාගේ S/MIME පොදු යතුර PEM ආකෘතියෙන් මෙහි අලවන්න.

source: Receive email alerts when events are published
si_lk: සිදුවීම් ප්‍රකාශනය කරන විට ඊමේල් ඇඟවීම් ලබා ගන්න

source: Receive email alerts from "Contact reporter" requests
si_lk: "සම්බන්ධතා වාර්තාකරු" ඉල්ලීම් වලින් ඊමේල් ඇඟවීම් ලබා ගන්න

source: Immediately disable this user account
si_lk: මෙම පරිශීලක ගිණුම වහාම අක්‍රිය කරන්න

source: Send credentials automatically
si_lk: අක්තපත්‍ර ස්වයංක්‍රීයව යවන්න

source: Create user
si_lk: පරිශීලකයා සාදන්න

source: Admin Edit User
si_lk: පරිපාලක සංස්කරණ පරිශීලක

source: User login change is disabled on this instance
si_lk: මෙම අවස්ථාවේදී පරිශීලක පිවිසුම් වෙනස් කිරීම අබල කර ඇත

source: User password change is disabled on this instance
si_lk: මෙම අවස්ථාවේදී පරිශීලක මුරපද වෙනස් කිරීම අබල කර ඇත

source: Length
si_lk: දිග

source: (Reset)
si_lk: (නැවත සකසන්න)

source: Terms accepted
si_lk: කොන්දේසි පිළිගනු ලැබේ

source: User must change password
si_lk: පරිශීලක මුරපදය වෙනස් කළ යුතුය

source: Confirm with your current password
si_lk: ඔබගේ වත්මන් මුරපදය සමඟ තහවුරු කරන්න

source: Edit user
si_lk: පරිශීලක සංස්කරණය කරන්න

source: Contact User(s)
si_lk: පරිශීලක(න්) අමතන්න

source: Messaging - here's a quick guide on how this feature works
si_lk: පණිවිඩ යැවීම - මෙම විශේෂාංගය ක්‍රියා කරන ආකාරය පිළිබඳ ඉක්මන් මාර්ගෝපදේශයක් මෙන්න

source: You can use this view to send messages to your current or future users or send them a temporary password.
si_lk: ඔබගේ වත්මන් හෝ අනාගත පරිශීලකයින්ට පණිවිඩ යැවීමට හෝ ඔවුන්ට තාවකාලික මුරපදයක් යැවීමට ඔබට මෙම දර්ශනය භාවිතා කළ හැක.

source: When adding a new user to the system, or when you want to manually reset the password for a user, just use the "Send temporary password" setting.
si_lk: පද්ධතියට නව පරිශීලකයෙකු එක් කරන විට, හෝ ඔබට පරිශීලකයෙකු සඳහා මුරපදය අතින් නැවත සැකසීමට අවශ්‍ය වූ විට, "තාවකාලික මුරපදය යවන්න" සැකසීම භාවිතා කරන්න.

source: After selecting the action, choose who the target of the e-mails should be (all users, a single user or a user not yet in the system).
si_lk: ක්‍රියාව තේරීමෙන් පසු, විද්‍යුත් තැපෑලෙහි ඉලක්කය කවුරුන් විය යුතුද යන්න තෝරන්න (සියලු පරිශීලකයන්, තනි පරිශීලකයෙකු හෝ තවමත් පද්ධතිය තුළ නොමැති පරිශීලකයෙකු).

source: You can then specify (if eligible) what the e-mail address of the target is (for existing users you can choose from a dropdown menu).
si_lk: එවිට ඔබට ඉලක්කයේ විද්‍යුත් තැපැල් ලිපිනය කුමක්ද යන්න (සුදුසුකම් ඇත්නම්) සඳහන් කළ හැක (පවතින පරිශීලකයින් සඳහා ඔබට පතන මෙනුවකින් තෝරා ගත හැක).

source: In the case of a new user, you can specify the future user's PGP key, to send his/her new key in an encrypted e-mail.
si_lk: නව පරිශීලකයෙකු සම්බන්ධයෙන්, ඔබට ඔහුගේ/ඇයගේ නව යතුර සංකේතාත්මක විද්‍යුත් තැපෑලකින් යැවීමට අනාගත පරිශීලකයාගේ PGP යතුර නියම කළ හැක.

source: The system will automatically generate a message for you, but it is also possible to write a custom message if you tick the check-box, but don't worry about assigning a temporary password manually, the system will do that for you, right after your custom message.
si_lk: පද්ධතිය ඔබට ස්වයංක්‍රීයව පණිවිඩයක් ජනනය කරයි, නමුත් ඔබ සලකුණු කොටුව සලකුණු කළහොත් අභිරුචි පණිවිඩයක් ලිවීමටද හැකිය, නමුත් තාවකාලික මුරපදයක් අතින් පැවරීම ගැන කරදර නොවන්න, පද්ධතිය ඔබ වෙනුවෙන් එය කරනු ඇත. ඔබගේ අභිරුචි පණිවිඩයෙන් පසුව.

source: Custom message
si_lk: අභිරුචි පණිවිඩය

source: Welcome message
si_lk: පිළිගැනීමේ පණිවිඩය

source: Reset password
si_lk: මුරපදය නැවත සකසන්න

source: A single user
si_lk: තනි පරිශීලකයෙක්

source: All users
si_lk: සියලුම පරිශීලකයන්

source: All users of the same organisation
si_lk: එකම සංවිධානයේ සියලුම පරිශීලකයින්

source: Recipient Email
si_lk: ලබන්නාගේ ඊමේල්

source: Recipient Organisation Name
si_lk: ලබන්නාගේ සංවිධානයේ නම

source: Enter a custom message
si_lk: අභිරුචි පණිවිඩයක් ඇතුළත් කරන්න

source: New user registration
si_lk: නව පරිශීලක ලියාපදිංචිය

source: Password reset
si_lk: මුරපදය යළි පිහිටුවීම

source: Filter User Index
si_lk: පරිශීලක දර්ශකය පෙරහන් කරන්න

source: Remove filter
si_lk: පෙරහන ඉවත් කරන්න

source: Apply filters
si_lk: පෙරහන් යොදන්න

source: Click %s to reset the API keys of all sync and org admin users in one shot. This will also automatically inform them of their new API keys.
si_lk: සියලුම සමමුහුර්ත සහ org පරිපාලක පරිශීලකයින්ගේ API යතුරු එක පහරකින් නැවත සැකසීමට %s ක්ලික් කරන්න. මෙය ඔවුන්ගේ නව API යතුරු ගැන ස්වයංක්‍රීයව ඔවුන්ට දැනුම් දෙනු ඇත.

source: Reset all sync user API keys
si_lk: සියලුම සමමුහුර්ත පරිශීලක API යතුරු නැවත සකසන්න

source: Are you sure you wish to reset the API keys of all users with sync privileges?
si_lk: සමමුහුර්ත කිරීමේ වරප්‍රසාද සහිත සියලුම පරිශීලකයින්ගේ API යතුරු නැවත සැකසීමට අවශ්‍ය බව ඔබට විශ්වාසද?

source: Disable selected users
si_lk: තෝරාගත් පරිශීලකයින් අබල කරන්න

source: Enable selected users
si_lk: තෝරාගත් පරිශීලකයින් සබල කරන්න

source: Disable publish emailing
si_lk: ප්‍රකාශන විද්‍යුත් තැපෑල අබල කරන්න

source: Enable publish emailing
si_lk: ප්‍රකාශන විද්‍යුත් තැපෑල සබල කරන්න

source: Event alert
si_lk: සිදුවීම් අනතුරු ඇඟවීම

source: Contact alert
si_lk: ඇමතුම් ඇඟවීම

source: PGP Key
si_lk: PGP යතුර

source: Terms Accepted
si_lk: කොන්දේසි පිළිගනු ලැබේ

source: Last Login
si_lk: අවසාන පිවිසුම

source: External Auth
si_lk: බාහිර සහතිකය

source: Monitored
si_lk: නිරීක්ෂණය කරන ලදී

source: Users index
si_lk: පරිශීලක දර්ශකය

source: Create new credentials and inform user
si_lk: නව අක්තපත්‍ර සාදා පරිශීලකයාට දැනුම් දෙන්න

source: Are you sure you want to delete the user? It is highly recommended to never delete users but to disable them instead.
si_lk: ඔබට පරිශීලකයා මැකීමට අවශ්‍ය බව විශ්වාසද? කිසිවිටක පරිශීලකයන් මකා නොදැමීම, ඒ වෙනුවට ඒවා අක්‍රිය කිරීම නිර්දේශ කෙරේ.

source: Contact %s
si_lk: අමතන්න %s

source: WARNING: This user does not have an encryption key set. The security posture of this instance allows for the sending of clear-text e-mails, so this is what will happen if you proceed.
si_lk: අවවාදයයි: මෙම පරිශීලකයාට සංකේතන යතුරු කට්ටලයක් නොමැත. මෙම අවස්ථාවෙහි ආරක්‍ෂිත ඉරියව්ව මඟින් පැහැදිලි පෙළ ඊමේල් යැවීමට ඉඩ සලසයි, එබැවින් ඔබ ඉදිරියට ගියහොත් මෙය සිදුවනු ඇත.

source: %s key found for user, the e-mail will be sent encrypted using this key.
si_lk: පරිශීලකයා සඳහා %s යතුර හමු වී ඇත, මෙම යතුර භාවිතයෙන් ඊමේල් සංකේතනය කර යවනු ලැබේ.

source: Failed GnuPGs?
si_lk: අසාර්ථක GnuPGs?

source: No failed composites
si_lk: අසාර්ථක සංයුක්ත නොමැත

source: Your administrator has turned on an additional authentication step which requires you to enter a OTP (one time password) you have received via email.
si_lk: ඔබගේ පරිපාලක විසින් ඔබට විද්‍යුත් තැපෑලෙන් ලැබුණු OTP (එක් වර මුරපදයක්) ඇතුළත් කිරීමට අවශ්‍ය වන අමතර පියවරක් ක්‍රියාත්මක කර ඇත.

source: Make sure to check your SPAM folder.
si_lk: ඔබගේ SPAM ෆෝල්ඩරය පරීක්ෂා කිරීමට වග බලා ගන්න.

source: Resend
si_lk: නැවත යවන්න

source: Validate your OTP
si_lk: ඔබගේ OTP වලංගු කරන්න

source: One Time Password
si_lk: එක් වරක් මුරපදය

source: Enter your OTP here
si_lk: ඔබගේ OTP මෙහි ඇතුලත් කරන්න

source: Logo
si_lk: ලාංඡනය

source: Login
si_lk: ඇතුල් වන්න

source: Registration will be sent to the administrators of the instance for consideration.
si_lk: ලියාපදිංචිය සලකා බැලීම සඳහා උදාහරණයේ පරිපාලකයින් වෙත යවනු ලැබේ.

source: No account yet? Register now!
si_lk: තවම ගිණුමක් නැද්ද? දැන්ම ලියාපදිංචි වන්න!

source: Register for a new user account
si_lk: නව පරිශීලක ගිණුමක් සඳහා ලියාපදිංචි වන්න

source: Your email address
si_lk: ඔයාගේ ඊතැපැල් ලිපිනය

source: Your organisation's name (optional)
si_lk: ඔබේ සංවිධානයේ නම (විකල්ප)

source: Your MISP org uuid (optional)
si_lk: ඔබගේ MISP org uuid (විකල්ප)

source: Request custom role
si_lk: අභිරුචි භූමිකාව ඉල්ලන්න

source: Publish permission
si_lk: අවසරය පළ කරන්න

source: Org admin permission
si_lk: සංවිධානයේ පරිපාලක අවසරය

source: Sync permission
si_lk: සමමුහුර්ත අවසරය

source: PGP key (optional)
si_lk: PGP යතුර (විකල්ප)

source: Message to the admins
si_lk: පරිපාලකයින්ට පණිවිඩයක්

source: Process the selected registrations
si_lk: තෝරාගත් ලියාපදිංචි කිරීම් කටයුතු කරන්න

source: Discard the selected registrations
si_lk: තෝරාගත් ලියාපදිංචි කිරීම් ඉවතලන්න

source: Time
si_lk: කාලය

source: User Agent
si_lk: පරිශීලක නියෝජිතයා

source: Org uuid
si_lk: සංවිධානය uuid

source: Requested role
si_lk: භූමිකාව ඉල්ලා ඇත

source: PGP
si_lk: පීජීපී

source: Registrations index
si_lk: ලියාපදිංචි කිරීමේ දර්ශකය

source: Process registration
si_lk: ක්රියාවලිය ලියාපදිංචි කිරීම

source: Discard registration
si_lk: ලියාපදිංචිය ඉවතලන්න

source: Some statistics about this instance. The changes since the beginning of this month are noted in brackets wherever applicable
si_lk: මෙම අවස්ථාව පිළිබඳ සමහර සංඛ්යා ලේඛන. මෙම මාසයේ ආරම්භයේ සිට සිදු වූ වෙනස්කම් අදාළ ඕනෑම තැනක වරහන් තුළ සටහන් කර ඇත

source: Attributes / event
si_lk: ගුණාංග / සිදුවීම

source: Correlations found
si_lk: සහසම්බන්ධතා හමු විය

source: Proposals active
si_lk: යෝජනා සක්‍රීයයි

source: Users with PGP keys
si_lk: PGP යතුරු සහිත පරිශීලකයන්

source: Local Organisations
si_lk: ප්රාදේශීය සංවිධාන

source: Event creator orgs
si_lk: සිදුවීම් නිර්මාතෘ ආයතන

source: Average Users / Org
si_lk: සාමාන්‍ය පරිශීලකයින් / සංවිධානය

source: Discussion threads
si_lk: සාකච්ඡා නූල්

source: Discussion posts
si_lk: සාකච්ඡා තනතුරු

source: A heatmap showing user activity for each day during this month and the 4 months that preceded it. Use the buttons below to only show the heatmap of a specific organisation.
si_lk: මෙම මාසය තුළ සහ ඊට පෙර මාස 4 තුළ සෑම දිනකම පරිශීලක ක්‍රියාකාරකම් පෙන්වන තාප සිතියමක්. නිශ්චිත සංවිධානයක තාප සිතියම පමණක් පෙන්වීමට පහත බොත්තම් භාවිත කරන්න.

source: Go left
si_lk: වමට යන්න

source: Go right
si_lk: දකුණට යන්න

source: The above graph will not work correctly in Compatibility mode. Please make sure that it is disabled in your Internet Explorer settings.
si_lk: ඉහත ප්‍රස්ථාරය ගැළපෙන ප්‍රකාරයේදී නිවැරදිව ක්‍රියා නොකරනු ඇත. කරුණාකර එය ඔබගේ Internet Explorer සැකසුම් තුළ අක්‍රිය කර ඇති බව සහතික කර ගන්න.

source: The above graph will not work correctly on Internet Explorer 9.0 and earlier. Please download Chrome, Firefox or upgrade to a newer version of Internet Explorer.
si_lk: ඉහත ප්‍රස්ථාරය Internet Explorer 9.0 සහ ඊට පෙර නිවැරදිව ක්‍රියා නොකරනු ඇත. කරුණාකර Chrome, Firefox බාගන්න හෝ Internet Explorer හි නව අනුවාදයකට උත්ශ්‍රේණි කරන්න.

source: A heatmap showing the usage of %s.
si_lk: %sභාවිතය පෙන්වන තාප සිතියමක්.

source: Organisation list
si_lk: සංවිධාන ලැයිස්තුව

source: Quick overview over the organisations residing on or known by this instance.
si_lk: මෙම අවස්ථාවෙහි වාසය කරන හෝ දන්නා ආයතන පිළිබඳ ඉක්මන් දළ විශ්ලේෂණය.

source: Activity (1 year)
si_lk: ක්‍රියාකාරකම් (වසර 1)

source: A toplist of the top sources for the sightings of your organisation.
si_lk: ඔබේ සංවිධානයේ දර්ශන සඳහා ඉහළම මූලාශ්‍රවල ඉහළ ලැයිස්තුවක්.

source: #Entries
si_lk: #ඇතුල්වීම්

source: #Sighting
si_lk: #බැලීම

source: #False-positive
si_lk: #අසත්‍ය-ධනාත්මක

source: A treemap of the currently used event tags. Click on any of the taxonomies to hide it and click it again to show it.
si_lk: දැනට භාවිතා වන සිදුවීම් ටැග් වල ගස් සිතියමක්. එය සැඟවීමට ඕනෑම වර්ගීකරණයක් මත ක්ලික් කර එය පෙන්වීමට එය නැවත ක්ලික් කරන්න.

source: User and Organisation Statistics
si_lk: පරිශීලක සහ සංවිධාන සංඛ්‍යාලේඛන

source: MISP Terms and Conditions
si_lk: MISP නියමයන් සහ කොන්දේසි

source: Terms and Conditions file not found.
si_lk: නියම සහ කොන්දේසි ගොනුව හමු නොවීය.

source: Download Terms and Conditions
si_lk: බාගත කිරීමේ නියමයන් සහ කොන්දේසි

source: Accept Terms
si_lk: කොන්දේසි පිළිගන්න

source: Certificates validation
si_lk: සහතික වලංගු කිරීම

source: GnuPG key validation
si_lk: GnuPG යතුරු වලංගුකරණය

source: Send email to user
si_lk: පරිශීලකයාට ඊමේල් යවන්න

source: Event alert enabled
si_lk: සිදුවීම් ඇඟවීම සබල කර ඇත

source: Contact alert enabled
si_lk: සම්බන්ධතා ඇඟවීම සබල කර ඇත

source: Request API access
si_lk: API ප්‍රවේශය ඉල්ලන්න

source: Customauth header
si_lk: Customauth ශීර්ෂකය

source: Invited By
si_lk: විසින් ආරාධනා කරන ලදී

source: Org admin
si_lk: සංවිධානයේ පරිපාලක

source: NIDS Start SID
si_lk: NIDS SID ආරම්භ කරන්න

source: Must change password
si_lk: මුරපදය වෙනස් කළ යුතුය

source: PGP key fingerprint
si_lk: PGP යතුරු ඇඟිලි සලකුණ

source: PGP key status
si_lk: PGP ප්රධාන තත්ත්වය

source: S/MIME Public certificate
si_lk: S/MIME පොදු සහතිකය

source: News read at
si_lk: ප්‍රවෘත්ති කියෙව්වේ

source: User %s
si_lk: පරිශීලක %s

source: Download user profile for data portability
si_lk: දත්ත ගෙනයාම සඳහා පරිශීලක පැතිකඩ බාගන්න

source: Auth keys
si_lk: සත්‍යාපන යතුරු

source: Discard User Registrations
si_lk: පරිශීලක ලියාපදිංචි කිරීම් ඉවතලන්න

source: Are you sure you wish to remove the registration request(s) selected?
si_lk: තෝරාගත් ලියාපදිංචි ඉල්ලීම(ය) ඉවත් කිරීමට අවශ්‍ය බව ඔබට විශ්වාසද?

source: Confirm sending
si_lk: යැවීම තහවුරු කරන්න

source: You are about to send a mail to %s recipient(s)?
si_lk: ඔබ ලබන්නන් %s දෙනෙකුට තැපෑලක් යැවීමට සූදානම්ද?

source: Send
si_lk: යවන්න

source: Choose the key that you would like to use
si_lk: ඔබ භාවිතා කිරීමට කැමති යතුර තෝරන්න

source: Do not blindly trust fetched keys and check the fingerprint from other source.
si_lk: ලබාගත් යතුරු අන්ධ ලෙස විශ්වාස නොකරන්න සහ වෙනත් මූලාශ්‍රයකින් ඇඟිලි සලකුණ පරීක්ෂා කරන්න.

source: And do not check just Key ID, but whole fingerprint.
si_lk: යතුරු හැඳුනුම්පත පමණක් පරීක්ෂා නොකරන්න, නමුත් සම්පූර්ණ ඇඟිලි සලකුණු.

source: Key ID
si_lk: යතුරු හැඳුනුම්පත

source: Creation date
si_lk: නිර්මාණය කළ දිනය

source: Associated E-mail addresses
si_lk: සම්බන්ධිත ඊමේල් ලිපින

source: Select PGP key
si_lk: PGP යතුර තෝරන්න

source: WARNING: This user does not have an encryption key set. The security posture of this instance allows for the sending of clear text e-mails, so this is what will happen if you proceed.
si_lk: අවවාදයයි: මෙම පරිශීලකයාට සංකේතන යතුරු කට්ටලයක් නොමැත. මෙම අවස්ථාවෙහි ආරක්‍ෂිත ඉරියව්ව මඟින් පැහැදිලි කෙටි පණිවුඩ යැවීමට ඉඩ සලසයි, එබැවින් ඔබ ඉදිරියට ගියහොත් සිදු වන්නේ මෙයයි.

source: Send welcome message to user
si_lk: පරිශීලකයාට පිළිගැනීමේ පණිවිඩයක් යවන්න

source: Initiate password reset for user
si_lk: පරිශීලකයා සඳහා මුරපදය යළි පිහිටුවීම ආරම්භ කරන්න

source: Are you sure you want to reset the password of %s and send him/her a welcome message with the credentials?
si_lk: ඔබට %s හි මුරපදය යළි සැකසීමට සහ අක්තපත්‍ර සමඟ ඔහුට/ඇයට පිළිගැනීමේ පණිවිඩයක් යැවීමට අවශ්‍ය බව විශ්වාසද?

source: Are you sure you want to reset the password of %s and send him/her the temporary credentials?
si_lk: ඔබට %s හි මුරපදය යළි සැකසීමට සහ ඔහුට/ඇයට තාවකාලික අක්තපත්‍ර යැවීමට අවශ්‍ය බව විශ්වාසද?

source: First time registration
si_lk: පළමු වරට ලියාපදිංචි වීම

source: Submit password reset
si_lk: මුරපද යළි පිහිටුවීම ඉදිරිපත් කරන්න

source: Add warninglist
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තුව එක් කරන්න

source: Edit warninglist
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තුව සංස්කරණය කරන්න

source: Accepted attribute types
si_lk: පිළිගත් ගුණාංග වර්ග

source: Values (one value per line, for value comment use #)
si_lk: අගයන් (එක් පේළියකට එක් අගයක්, අගය අදහස් දැක්වීම සඳහා #)

source: Search in enabled Warninglists
si_lk: සබල කළ අනතුරු ඇඟවීමේ ලැයිස්තු තුළ සොයන්න

source: Enter a value to search for
si_lk: සෙවීමට අගයක් ඇතුළත් කරන්න

source: Result for <i>%s</i>:
si_lk: <i>%s</i>සඳහා ප්‍රතිඵලය:

source: No hits for: <i>%s</i>
si_lk: සඳහා පහර නැත: <i>%s</i>

source: Entries
si_lk: ඇතුළත් කිරීම්

source: Delete %s
si_lk: %sමකන්න

source: Are you sure you want to delete %s #%s?
si_lk: ඔබට %s #%sමැකීමට අවශ්‍ය බව විශ්වාසද?

source: Name not in the right format. Allowedlist entries have to be enclosed by a valid php delimiter (which can be most non-alphanumeric / non-whitespace character). Format: "/8.8.8.8/" Please double check the name.
si_lk: නම නිවැරදි ආකෘතියේ නැත. අවසර ලත් ලැයිස්තු ඇතුළත් කිරීම් වලංගු php පරිසීමකයක් මඟින් අමුණා තිබිය යුතුය (එය බොහෝ අක්ෂර සංඛ්‍යාත්මක නොවන / සුදු අවකාශය නොවන අක්ෂර විය හැක). ආකෘතිය: "/8.8.8.8/" කරුණාකර නම දෙවරක් පරීක්ෂා කරන්න.

source: A similar name already exists.
si_lk: සමාන නමක් දැනටමත් පවතී.

source: numeric
si_lk: සංඛ්යාත්මක

source: Options depend on the selected category.
si_lk: විකල්ප තෝරාගත් කාණ්ඩය මත රඳා පවතී.

source: Options : Payload delivery, Antivirus detection, Payload installation, Files dropped ...
si_lk: විකල්ප: Payload බෙදාහැරීම, ප්‍රති-වයිරස හඳුනාගැනීම, Payload ස්ථාපනය, ගොනු පහත වැටී ඇත ...

source: Value provided consists purely of control characters and is therefore considered to be empty.
si_lk: සපයා ඇති අගය තනිකරම පාලන අක්ෂර වලින් සමන්විත වන අතර එබැවින් හිස් ලෙස සලකනු ලැබේ.

source: Composite type found but the value not in the composite (value1|value2) format.
si_lk: සංයුක්ත වර්ගය හමු වූ නමුත් අගය සංයුක්ත (අගය1|අගය2) ආකෘතියෙන් නොවේ.

source: Value not in the right type/format. Please double check the value or select type "other".
si_lk: අගය නිවැරදි ආකාරයේ/ආකෘතියේ නැත. කරුණාකර අගය දෙවරක් පරීක්ෂා කරන්න නැතහොත් "වෙනත්" වර්ගය තෝරන්න.

source: A similar attribute already exists for this event.
si_lk: මෙම සිදුවීම සඳහා දැනටමත් සමාන ගුණාංගයක් පවතී.

source: boolean
si_lk: බූලියන්

source: Please provide a valid RFC 4122 UUID
si_lk: කරුණාකර වලංගු RFC 4122 UUID ලබා දෙන්න

source: The UUID provided is not unique
si_lk: ලබා දී ඇති UUID අද්විතීය නොවේ
