Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: If this is not set the default value will be used.
si_lk: මෙය සකසා නොමැති නම් පෙරනිමි අගය භාවිතා වේ.

source: This setting is deprecated and can be safely removed.
si_lk: මෙම සැකසුම අත්හරින ලද අතර ආරක්ෂිතව ඉවත් කළ හැක.

source: Cached exports can take up a considerable amount of space and can be disabled instance wide using this setting. Disabling the cached exports is not recommended as it's a valuable feature, however, if your server is having free space issues it might make sense to take this step.
si_lk: හැඹිලිගත නිර්යාත සඳහා සැලකිය යුතු ඉඩ ප්‍රමාණයක් ගත හැකි අතර මෙම සැකසුම භාවිතයෙන් පුළුල් ලෙස අක්‍රිය කළ හැක. හැඹිලිගත නිර්යාත අක්‍රිය කිරීම එය වටිනා විශේෂාංගයක් බැවින් නිර්දේශ නොකරයි, කෙසේ වෙතත්, ඔබගේ සේවාදායකයට නිදහස් ඉඩ ප්‍රශ්න තිබේ නම්, මෙම පියවර ගැනීම අර්ථවත් විය හැක.

source: Disable displaying / modifications to the threat level altogether on the instance (deprecated field).
si_lk: තර්ජන මට්ටමට ප්‍රදර්ශනය කිරීම / වෙනස් කිරීම් සම්පූර්ණයෙන්ම අබල කරන්න (අත් හරින ලද ක්ෂේත්‍රය).

source: Footer text prepending the "Powered by MISP" text.
si_lk: "MISP මගින් බලගන්වන ලද" පෙළට පෙරාතුව පාදක පෙළ.

source: Footer text following the "Powered by MISP" text.
si_lk: "MISP මගින් බලගන්වන ලද" පෙළට පසුව පාදක පෙළ.

source: If set, this setting allows you to display a logo on the right side of the footer. Upload it as a custom image in the file management tool.
si_lk: සකසා ඇත්නම්, මෙම සැකසුම ඔබට පාදකයේ දකුණු පැත්තේ ලාංඡනයක් පෙන්වීමට ඉඩ සලසයි. ගොනු කළමනාකරණ මෙවලමෙහි අභිරුචි රූපයක් ලෙස එය උඩුගත කරන්න.

source: If set, this setting allows you to display a logo as the home icon. Upload it as a custom image in the file management tool.
si_lk: සකසා ඇත්නම්, මෙම සිටුවම ඔබට මුල් පිටුව නිරූපකය ලෙස ලාංඡනයක් පෙන්වීමට ඉඩ සලසයි. ගොනු කළමනාකරණ මෙවලමෙහි අභිරුචි රූපයක් ලෙස එය උඩුගත කරන්න.

source: If set, the image specified here will replace the main MISP logo on the login screen. Upload it as a custom image in the file management tool.
si_lk: සකසා ඇත්නම්, මෙහි දක්වා ඇති රූපය පිවිසුම් තිරයේ ඇති ප්‍රධාන MISP ලාංඡනය ප්‍රතිස්ථාපනය කරයි. ගොනු කළමනාකරණ මෙවලමෙහි අභිරුචි රූපයක් ලෙස එය උඩුගත කරන්න.

source: The organisation tag of the hosting organisation. This is used in the e-mail subjects.
si_lk: සත්කාරක සංවිධානයේ සංවිධාන ටැගය. මෙය විද්‍යුත් තැපෑල විෂයයන් වල භාවිතා වේ.

source: The hosting organisation of this instance. If this is not selected then replication instances cannot be added.
si_lk: මෙම අවස්ථාවෙහි සත්කාරක සංවිධානය. මෙය තෝරා නොගතහොත් අනුරූ අවස්ථා එකතු කළ නොහැක.

source: The MISP instance UUID. This UUID is used to identify this instance.
si_lk: MISP අවස්ථාව UUID. මෙම UUID මෙම අවස්ථාව හඳුනා ගැනීමට භාවිතා කරයි.

source: No valid UUID set
si_lk: වලංගු UUID කට්ටලයක් නැත

source: Setting this setting to 'false' will hide all organisation names / logos.
si_lk: මෙම සැකසුම 'අසත්‍ය' ලෙස සැකසීමෙන් සියලුම සංවිධාන නම් / ලාංඡන සඟවනු ඇත.

source: Put the event threat level in the notification E-mail subject.
si_lk: දැනුම්දීම් විද්‍යුත් තැපෑල විෂයෙහි සිදුවීම් තර්ජන මට්ටම දමන්න.

source: This is the TLP string for e-mails when email_subject_tag is not found.
si_lk: email_subject_tag සොයාගත නොහැකි වූ විට විද්‍යුත් තැපෑල සඳහා TLP තන්තුව මෙයයි.

source: If this tag is set on an event it's value will be sent in the E-mail subject. If the tag is not set the email_subject_TLP_string will be used.
si_lk: මෙම ටැගය සිදුවීමක් මත සකසා ඇත්නම් එහි වටිනාකම විද්‍යුත් තැපෑල විෂයට යවනු ලැබේ. ටැගය සකසා නොමැති නම් email_subject_TLP_string භාවිතා වේ.

source: Include in name of the email_subject_tag in the subject. When false only the tag value is used.
si_lk: විෂයෙහි ඇති විද්‍යුත් තැපෑල_subject_tag හි නම ඇතුළත් කරන්න. අසත්‍ය වූ විට ටැග් අගය පමණක් භාවිතා වේ.

source: Notification e-mail sender name.
si_lk: දැනුම්දීමේ ඊමේල් යවන්නාගේ නම.

source: Enables the use of MISP's background processing.
si_lk: MISP හි පසුබිම් සැකසුම් භාවිතය සබල කරයි.

source: Directory where attachments are stored. MISP will NOT migrate the existing data if you change this setting. The only safe way to change this setting is in config.php, when MISP is not running, and after having moved/copied the existing data to the new location. This directory must already exist and be writable and readable by the MISP application.
si_lk: ඇමුණුම් ගබඩා කර ඇති නාමාවලිය. ඔබ මෙම සැකසුම වෙනස් කළහොත් MISP දැනට පවතින දත්ත සංක්‍රමණය නොකරනු ඇත. MISP ක්‍රියාත්මක නොවන විට සහ පවතින දත්ත නව ස්ථානයට ගෙන යාමෙන්/පිටපත් කිරීමෙන් පසුව මෙම සැකසුම වෙනස් කිරීමට ඇති එකම ආරක්ෂිත ක්‍රමය config.php වේ. මෙම නාමාවලිය දැනටමත් පැවතිය යුතු අතර MISP යෙදුම මඟින් ලිවිය හැකි සහ කියවිය හැකි විය යුතුය.

source: Always download attachments when loaded by a user in a browser
si_lk: පරිශීලකයෙකු විසින් බ්‍රවුසරයක පූරණය කරන විට සැමවිටම ඇමුණුම් බාගන්න

source: The Unix user MISP (php) is running as
si_lk: Unix පරිශීලක MISP (php) ලෙස ක්‍රියාත්මක වේ

source: The e-mail address that MISP should use for all notifications
si_lk: සියලුම දැනුම්දීම් සඳහා MISP භාවිතා කළ යුතු විද්‍යුත් තැපැල් ලිපිනය

source: You can disable all e-mailing using this setting. When enabled, no outgoing e-mails will be sent by MISP.
si_lk: ඔබට මෙම සැකසුම භාවිතයෙන් සියලුම විද්‍යුත් තැපෑල අක්‍රිය කළ හැක. සබල කළ විට, MISP මගින් පිටතට යන විද්‍යුත් තැපෑල යවන්නේ නැත.

source: This setting is deprecated. Please use `MISP.event_alert_metadata_only` instead.
si_lk: මෙම සැකසුම අත්හැර ඇත. කරුණාකර ඒ වෙනුවට `MISP.event_alert_metadata_only` භාවිත කරන්න.

source: The e-mail address that MISP should include as a contact address for the instance's support team.
si_lk: උදාහරණයේ සහාය කණ්ඩායම සඳහා සම්බන්ධතා ලිපිනයක් ලෙස MISP ඇතුළත් කළ යුතු විද්‍යුත් තැපැල් ලිපිනය.

source: Turn Vulnerability type attributes into links linking to the provided CVE lookup
si_lk: Vulnerability Type attributes සපයා ඇති CVE සෙවීමට සම්බන්ධ කරන සබැඳි බවට පත් කරන්න

source: Turn Weakness type attributes into links linking to the provided CWE lookup
si_lk: සපයා ඇති CWE සෙවීමට සම්බන්ධ වන සබැඳි බවට දුර්වලතා ආකාරයේ ගුණාංග හරවන්න

source: This setting controls whether notification e-mails will be sent when an event is created via the REST interface. It might be a good idea to disable this setting when first setting up a link to another instance to avoid spamming your users during the initial pull. Quick recap: True = Emails are NOT sent, False = Emails are sent on events published via sync / REST.
si_lk: REST අතුරුමුහුණත හරහා සිදුවීමක් සාදන විට දැනුම්දීම් විද්‍යුත් තැපෑල එවන්නේද යන්න මෙම සැකසුම පාලනය කරයි. ආරම්භක ඇදීමේදී ඔබේ පරිශීලකයින් අයාචිත තැපැල් කිරීම වැළැක්වීම සඳහා වෙනත් අවස්ථාවකට සබැඳියක් සැකසීමේදී මෙම සැකසීම අක්‍රිය කිරීම හොඳ අදහසක් විය හැකිය. ඉක්මන් පුනරාවර්තනය: සත්‍ය = විද්‍යුත් තැපෑල යවන්නේ නැත, අසත්‍ය = සමමුහුර්තකරණය / විවේකය හරහා ප්‍රකාශිත සිදුවීම් මත විද්‍යුත් තැපෑල යවනු ලැබේ.

source: Enabling this flag will allow the event description to be transmitted in the alert e-mail's subject. Be aware that this is not encrypted by GnuPG, so only enable it if you accept that part of the event description will be sent out in clear-text.
si_lk: මෙම ධජය සක්‍රීය කිරීමෙන් සිදුවීම් විස්තරය අනතුරු ඇඟවීමේ විද්‍යුත් තැපෑලෙහි විෂය තුළ සම්ප්‍රේෂණය කිරීමට ඉඩ සලසයි. මෙය GnuPG මගින් සංකේතනය කර නොමැති බව මතක තබා ගන්න, එබැවින් සිදුවීම් විස්තරයේ කොටසක් පැහැදිලි පෙළකින් යවනු ලබන බව ඔබ පිළිගන්නේ නම් පමණක් එය සක්‍රීය කරන්න.

source: If enabled, any requested URL before login will have their HTTP part replaced by HTTPS. This can be usefull if MISP is running behind a reverse proxy responsible for SSL and communicating unencrypted with MISP.
si_lk: සබල කර ඇත්නම්, පුරනය වීමට පෙර ඕනෑම ඉල්ලූ URL එකක HTTP කොටස HTTPS මගින් ප්‍රතිස්ථාපනය කරනු ඇත. MISP SSL සඳහා වගකිව යුතු ප්‍රතිලෝම ප්‍රොක්සියක් පිටුපසින් ක්‍රියා කරන්නේ නම් සහ MISP සමඟ සංකේතනය නොකළ සන්නිවේදනයක් කරන්නේ නම් මෙය ප්‍රයෝජනවත් විය හැක.

source: Send just event metadata (attributes and objects will be omitted) for event alert.
si_lk: සිදුවීම් ඇඟවීම් සඳහා හුදෙක් සිදුවීම් පාරදත්ත යවන්න (ගුණාංග සහ වස්තු ඉවත් කරනු ලැබේ).

source: The default distribution setting for events (0-3).
si_lk: සිදුවීම් සඳහා පෙරනිමි බෙදා හැරීමේ සැකසුම (0-3).

source: The default distribution setting for attributes, set it to 'event' if you would like the attributes to default to the event distribution level. (0-3 or "event")
si_lk: උපලක්ෂණ සඳහා පෙරනිමි බෙදා හැරීමේ සැකසුම, ඔබ උපලක්ෂණ සිදුවීම් බෙදා හැරීමේ මට්ටමට පෙරනිමි කිරීමට කැමති නම් එය 'සිදුවීම' ලෙස සකසන්න. (0-3 හෝ "සිදුවීම")

source: Inherit from event
si_lk: සිදුවීමෙන් උරුමය

source: The default threat level setting when creating events.
si_lk: සිදුවීම් නිර්මාණය කිරීමේදී පෙරනිමි තර්ජන මට්ටම සැකසීම.

source: The tag collection to be applied to all events created manually.
si_lk: අතින් සාදන ලද සියලුම සිදුවීම් සඳහා යෙදිය යුතු ටැග් එකතුව.

source: The default setting for publish alerts when creating users.
si_lk: පරිශීලකයන් නිර්මාණය කිරීමේදී ප්‍රකාශන ඇඟවීම් සඳහා පෙරනිමි සැකසුම.

source: Enable the tagging feature of MISP. This is highly recommended.
si_lk: MISP හි ටැග් කිරීමේ විශේෂාංගය සබල කරන්න. මෙය බෙහෙවින් නිර්දේශ කෙරේ.

source: Show the full tag names on the event index.
si_lk: සිදුවීම් දර්ශකයේ සම්පූර්ණ ටැග් නම් පෙන්වන්න.

source: Used on the login page, before the MISP logo
si_lk: MISP ලාංඡනයට පෙර පිවිසුම් පිටුවේ භාවිතා වේ

source: Used on the login page, after the MISP logo
si_lk: MISP ලාංඡනයට පසුව, පිවිසුම් පිටුවේ භාවිතා වේ

source: Used on the login page, to the left of the MISP logo, upload it as a custom image in the file management tool.
si_lk: පිවිසුම් පිටුවේ, MISP ලාංඡනයේ වම් පසින්, ගොනු කළමනාකරණ මෙවලමෙහි අභිරුචි රූපයක් ලෙස උඩුගත කරන්න.

source: Used on the login page, to the right of the MISP logo, upload it as a custom image in the file management tool.
si_lk: පිවිසුම් පිටුවේ, MISP ලාංඡනයේ දකුණට, ගොනු කළමනාකරණ මෙවලමෙහි අභිරුචි රූපයක් ලෙස උඩුගත කරන්න.

source: Used in the page title, after the name of the page
si_lk: පිටුවේ නමට පසුව, පිටු මාතෘකාවේ භාවිතා වේ

source: Allows users to take ownership of an event uploaded via the "Add MISP XML" button. This allows spoofing the creator of a manually imported event, also breaking possibly breaking the original intended releasability. Synchronising with an instance that has a different creator for the same event can lead to unwanted consequences.
si_lk: "MISP XML එක් කරන්න" බොත්තම හරහා උඩුගත කරන ලද සිදුවීමක හිමිකාරිත්වය ගැනීමට පරිශීලකයින්ට අවසර දෙන්න. මෙය අතින් ආනයනය කරන ලද සිදුවීමක නිර්මාතෘට වංචා කිරීමට ඉඩ සලසයි, සමහර විට මුල් අපේක්ෂිත මුදා හැරීමේ හැකියාව බිඳ දැමීමටද ඉඩ සලසයි. එකම සිදුවීම සඳහා වෙනත් නිර්මාපකයෙකු සිටින අවස්ථාවක් සමඟ සමමුහුර්ත කිරීම අනවශ්‍ය ප්‍රතිවිපාකවලට තුඩු දිය හැකිය.

source: Choose whether the terms and conditions should be displayed inline (false) or offered as a download (true)
si_lk: නියමයන් සහ කොන්දේසි පේළිගත කළ යුතුද (අසත්‍ය) හෝ බාගැනීමක් ලෙස පිරිනැමිය යුතුද (සත්‍ය) තෝරන්න.

source: The filename of the terms and conditions file. Make sure that the file is located in your MISP/app/files/terms directory
si_lk: නියමයන් සහ කොන්දේසි ගොනුවේ ගොනු නාමය. ගොනුව ඔබගේ MISP/app/files/terms නාමාවලියෙහි පිහිටා ඇති බවට වග බලා ගන්න

source: True enables the alternate org fields for the event index (source org and member org) instead of the traditional way of showing only an org field. This allows users to see if an event was uploaded by a member organisation on their MISP instance, or if it originated on an interconnected instance.
si_lk: org ක්ෂේත්‍රයක් පමණක් පෙන්වන සම්ප්‍රදායික ක්‍රමය වෙනුවට සත්‍ය සිදුවීම් දර්ශකය (මූලාශ්‍ර org සහ සාමාජික org) සඳහා විකල්ප org ක්ෂේත්‍ර සක්‍රීය කරයි. මෙය පරිශීලකයින්ට ඔවුන්ගේ MISP නිදසුන මත සාමාජික සංවිධානයක් විසින් සිදුවීමක් උඩුගත කර තිබේද, නැතහොත් එය අන්තර් සම්බන්ධිත අවස්ථාවක ආරම්භ වූවාදැයි බැලීමට ඉඩ සලසයි.

source: True will deny access to unpublished events to users outside the organization of the submitter except site admins.
si_lk: සත්‍ය විසින් අඩවි පරිපාලකයින් හැර ඉදිරිපත් කරන්නාගේ සංවිධානයෙන් පිටත පරිශීලකයින්ට ප්‍රකාශනය නොකළ සිදුවීම් වෙත ප්‍රවේශය ප්‍රතික්ෂේප කරනු ඇත.

source: The message sent to the user after account creation (has to be sent manually from the administration interface). Use \n for line-breaks. The following variables will be automatically replaced in the text: $password = a new temporary password that MISP generates, $username = the user's e-mail address, $misp = the url of this instance, $org = the organisation that the instance belongs to, as set in MISP.org, $contact = the e-mail address used to contact the support team, as set in MISP.contact. For example, "the password for $username is $password" would appear to a user with the e-mail address user@misp.org as "the password for user@misp.org is hNamJae81".
si_lk: ගිණුම සෑදීමෙන් පසු පරිශීලකයා වෙත යවන ලද පණිවිඩය (පරිපාලන අතුරුමුහුණතෙන් අතින් යැවිය යුතුය). රේඛා බිඳීම් සඳහා \n භාවිතා කරන්න. පහත විචල්‍යයන් පෙළ තුළ ස්වයංක්‍රීයව ප්‍රතිස්ථාපනය වනු ඇත: $password = MISP විසින් ජනනය කරන නව තාවකාලික මුරපදයක්, $username = පරිශීලකයාගේ විද්‍යුත් තැපැල් ලිපිනය, $misp = මෙම අවස්ථාවෙහි url, $org = සකසන ලද පරිදි එම අවස්ථාව අයත් වන සංවිධානය MISP.org හි, $contact = MISP.contact හි සකසා ඇති පරිදි උපකාරක කණ්ඩායම සම්බන්ධ කර ගැනීමට භාවිතා කරන විද්‍යුත් තැපැල් ලිපිනය. උදාහරණයක් ලෙස, " $username සඳහා මුරපදය $passwordවේ" පරිශීලකයාට user@misp.org යන විද්‍යුත් තැපැල් ලිපිනය සහිත පරිශීලකයෙකුට "user@misp.org සඳහා මුරපදය hNamJae81" ලෙස දිස්වනු ඇත.

source: The message sent to the users when a password reset is triggered. Use \n for line-breaks. The following variables will be automatically replaced in the text: $password = a new temporary password that MISP generates, $username = the user's e-mail address, $misp = the url of this instance, $contact = the e-mail address used to contact the support team, as set in MISP.contact. For example, "the password for $username is $password" would appear to a user with the e-mail address user@misp.org as "the password for user@misp.org is hNamJae81".
si_lk: මුරපද යළි පිහිටුවීම ක්‍රියාත්මක වූ විට පරිශීලකයින්ට පණිවිඩය යවනු ලැබේ. රේඛා බිඳීම් සඳහා \n භාවිතා කරන්න. පහත විචල්‍යයන් පෙළ තුළ ස්වයංක්‍රීයව ප්‍රතිස්ථාපනය වනු ඇත: $password = MISP ජනනය කරන නව තාවකාලික මුරපදයක්, $username = පරිශීලකයාගේ විද්‍යුත් තැපැල් ලිපිනය, $misp = මෙම අවස්ථාවෙහි url, $contact = සහාය සම්බන්ධ කර ගැනීමට භාවිතා කරන විද්‍යුත් තැපැල් ලිපිනය MISP.contact හි පිහිටුවා ඇති පරිදි කණ්ඩායම. උදාහරණයක් ලෙස, " $username සඳහා මුරපදය $passwordවේ" පරිශීලකයාට user@misp.org යන විද්‍යුත් තැපැල් ලිපිනය සහිත පරිශීලකයෙකුට "user@misp.org සඳහා මුරපදය hNamJae81" ලෙස දිස්වනු ඇත.

source: Since version 2.3.107 you can start blocklisting event UUIDs to prevent them from being pushed to your instance. This functionality will also happen silently whenever an event is deleted, preventing a deleted event from being pushed back from another instance.
si_lk: 2.3.107 අනුවාදයේ සිට, ඔබට සිදුවීම් UUID අවහිර කිරීම ආරම්භ කළ හැකි අතර, ඒවා ඔබේ අවස්ථාවට තල්ලු කිරීමෙන් වළක්වා ගත හැක. සිදුවීමක් මකා දැමූ සෑම අවස්ථාවකම මෙම ක්‍රියාකාරිත්වය නිහඬව සිදුවනු ඇත, මකා දැමූ සිදුවීමක් වෙනත් අවස්ථාවකින් පසුපසට තල්ලු වීම වළක්වයි.

source: Blocklisting organisation UUIDs to prevent the creation of any event created by the blocklisted organisation.
si_lk: වාරණ ලැයිස්තුගත සංවිධානය විසින් නිර්මාණය කරන ලද ඕනෑම සිදුවීමක් නිර්මාණය කිරීම වැළැක්වීම සඳහා UUIDs අවහිර කිරීම.

source: If enabled, all log entries will include the IP address of the user.
si_lk: සබල කර ඇත්නම්, සියලුම ලොග් ඇතුළත් කිරීම් පරිශීලකයාගේ IP ලිපිනය ඇතුළත් වේ.

source: If log_client_ip is enabled, you can customize which header field contains the client's IP address. This is generally used when you have a reverse proxy infront of your MISP instance.
si_lk: log_client_ip සක්‍රීය කර ඇත්නම්, ඔබට සේවාලාභියාගේ IP ලිපිනය අඩංගු ශීර්ෂ ක්ෂේත්‍රය අභිරුචිකරණය කළ හැක. මෙය සාමාන්‍යයෙන් භාවිතා වන්නේ ඔබේ MISP අවස්ථාවට ඉදිරියෙන් ප්‍රතිලෝම ප්‍රොක්සියක් ඇති විටය.

source: If enabled, MISP will log all successful authentications using API keys. The requested URLs are also logged.
si_lk: සබල කර ඇත්නම්, MISP විසින් API යතුරු භාවිතයෙන් සියලුම සාර්ථක සත්‍යාපනය ලොග් කරනු ඇත. ඉල්ලූ URL ද ලොග් වී ඇත.

source: This functionality allows you to completely disable any logs from being saved in your SQL backend. This is HIGHLY advised against, you lose all the functionalities provided by the audit log subsystem along with the event history (as these are built based on the logs on the fly). Only enable this if you understand and accept the associated risks.
si_lk: මෙම ක්‍රියාකාරීත්වය මඟින් ඔබගේ SQL පසුපෙළේ සුරැකීම සම්පූර්ණයෙන්ම අක්‍රිය කිරීමට ඔබට ඉඩ සලසයි. මෙයට එරෙහිව ඉතා ඉහළින් උපදෙස් දෙනු ලැබේ, ඔබට සිදුවීම් ඉතිහාසය සමඟින් විගණන ලොග් උප පද්ධතිය මඟින් සපයන සියලුම ක්‍රියාකාරීත්වයන් ඔබට අහිමි වේ (මේවා පියාසර කරන ලඝු-සටහන් මත පදනම්ව ගොඩනගා ඇත). ඔබ ආශ්‍රිත අවදානම් තේරුම් ගෙන පිළිගන්නේ නම් පමණක් මෙය සබල කරන්න.

source: Logging has now been disabled - your audit logs will not capture failed authentication attempts, your event history logs are not being populated and no system maintenance messages are being logged.
si_lk: ලොග් වීම දැන් අක්‍රිය කර ඇත - ඔබගේ විගණන ලොග අසාර්ථක සත්‍යාපන ප්‍රයත්න ග්‍රහණය නොකරනු ඇත, ඔබගේ සිදුවීම් ඉතිහාස ලොග පුරවා නැත සහ පද්ධති නඩත්තු පණිවිඩ ලොග් වී නොමැත.

source: If this functionality is enabled all page requests will be logged. Keep in mind this is extremely verbose and will become a burden to your database.
si_lk: මෙම ක්‍රියාකාරීත්වය සක්‍රීය කර ඇත්නම් සියලුම පිටු ඉල්ලීම් ලොග් වනු ඇත. මෙය අතිශයින්ම වාචික වන අතර ඔබේ දත්ත ගබඩාවට බරක් වනු ඇති බව මතක තබා ගන්න.

source: You can decide to skip the logging of the paranoid logs to the database.
si_lk: පරපීඩක ලඝු-සටහන් දත්ත සමුදායට ලොග් කිරීම මඟ හැරීමට ඔබට තීරණය කළ හැක.

source: If paranoid logging is enabled, include the POST body in the entries.
si_lk: ව්‍යාකූල ලොග් කිරීම සබල කර ඇත්නම්, ඇතුළත් කිරීම් තුළ POST ශරීරය ඇතුළත් කරන්න.

source: Log user IPs on each request. 30 day retention for lookups by IP to get the last authenticated user ID for the given IP, whilst on the reverse, indefinitely stores all associated IPs for a user ID.
si_lk: එක් එක් ඉල්ලීම මත පරිශීලක IPs ලොග් කරන්න. ලබා දී ඇති IP සඳහා අවසාන සත්‍යාපිත පරිශීලක හැඳුනුම්පත ලබා ගැනීම සඳහා IP මගින් සෙවීම් සඳහා දින 30ක් රඳවා තබා ගැනීම, ප්‍රතිලෝමව, පරිශීලක හැඳුනුම්පතක් සඳහා සියලු ආශ්‍රිත IPs දින නියමයක් නොමැතිව ගබඩා කරයි.

source: Log user IP and key usage on each API request. All logs for given keys are deleted after one year when this key is not used.
si_lk: එක් එක් API ඉල්ලීම මත පරිශීලක IP සහ යතුරු භාවිතය ලොග් කරන්න. මෙම යතුර භාවිතා නොකරන විට ලබා දී ඇති යතුරු සඳහා සියලුම ලොග් වසරකට පසුව මකා දමනු ලැබේ.

source: Enable new audit log system.
si_lk: නව විගණන ලොග් පද්ධතිය සබල කරන්න.

source: Compress log changes by brotli algorithm. This will reduce log database size.
si_lk: බ්‍රොට්ලි ඇල්ගොරිතම මගින් ලොග් වෙනස්කම් සම්පීඩනය කරන්න. මෙය ලොග් දත්ත සමුදායේ ප්‍රමාණය අඩු කරයි.

source: This feature allows users to create org only events and ask another organisation to take ownership of the event. This allows organisations to remain anonymous by asking a partner to publish an event for them.
si_lk: මෙම විශේෂාංගය පරිශීලකයින්ට org පමණක් සිදුවීම් නිර්මාණය කිරීමට සහ වෙනත් ආයතනයකට සිදුවීමේ හිමිකාරිත්වය ලබා ගැනීමට ඉඩ දෙයි. මෙමගින් සංවිධානවලට ඔවුන් වෙනුවෙන් සිදුවීමක් ප්‍රකාශ කිරීමට හවුල්කරුවෙකුගෙන් ඉල්ලා සිටීමෙන් නිර්නාමිකව සිටීමට ඉඩ සලසයි.

source: When enabled, the number of correlations visible to the currently logged in user will be visible on the event index UI. This comes at a performance cost but can be very useful to see correlating events at a glance.
si_lk: සබල කළ විට, දැනට පුරනය වී ඇති පරිශීලකයාට පෙනෙන සහසම්බන්ධතා සංඛ්‍යාව සිදුවීම් දර්ශක UI මත දෘශ්‍යමාන වේ. මෙය කාර්ය සාධන පිරිවැයකින් එන නමුත් බැලූ බැල්මට සහසම්බන්ධ සිදුවීම් බැලීමට ඉතා ප්‍රයෝජනවත් විය හැක.

source: When enabled, the number of proposals for the events are shown on the index.
si_lk: සබල කළ විට, සිදුවීම් සඳහා යෝජනා ගණන දර්ශකයේ පෙන්වනු ලැබේ.

source: When enabled, the aggregate number of attribute sightings within the event becomes visible to the currently logged in user on the event index UI.
si_lk: සබල කළ විට, සිදුවීම් දර්ශක UI මත දැනට ලොග් වී සිටින පරිශීලකයාට සිදුවීම තුළ ඇති ගුණාංග බැලීම් සංඛ්‍යාව දෘශ්‍යමාන වේ.

source: When enabled, the aggregate number of discussion posts for the event becomes visible to the currently logged in user on the event index UI.
si_lk: සබල කළ විට, සිදුවීම් දර්ශක UI මත දැනට ලොග් වී සිටින පරිශීලකයාට සිදුවීම සඳහා වූ සාකච්ඡා පළ කිරීම් සංඛ්‍යාව දෘශ්‍යමාන වේ.

source: When enabled, the aggregate number of event reports for the event becomes visible to the currently logged in user on the event index UI.
si_lk: සබල කළ විට, සිදුවීම් දර්ශක UI මත දැනට ලොග් වී සිටින පරිශීලකයාට සිදුවීම සඳහා සිදුවීම් වාර්තාවල සමස්ත සංඛ්‍යාව දෘශ්‍යමාන වේ.

source: When enabled only Org and Site admins can edit a user's profile.
si_lk: සබල කළ විට පරිශීලක පැතිකඩ සංස්කරණය කළ හැක්කේ Org සහ Site පරිපාලකයින්ට පමණි.

source: When enabled only Site admins can change user email. This should be enabled if you manage user logins by external system.
si_lk: සබල කළ විට පරිශීලක ඊමේල් වෙනස් කළ හැක්කේ අඩවි පරිපාලකයින්ට පමණි. ඔබ බාහිර පද්ධතිය මගින් පරිශීලක පිවිසුම් කළමනාකරණය කරන්නේ නම් මෙය සක්‍රීය කළ යුතුය.

source: When enabled only Site admins can change user password. This should be enabled if you manage user passwords by external system.
si_lk: සබල කළ විට පරිශීලක මුරපදය වෙනස් කළ හැක්කේ අඩවි පරිපාලකයින්ට පමණි. ඔබ බාහිර පද්ධතිය මගින් පරිශීලක මුරපද කළමනාකරණය කරන්නේ නම් මෙය සක්‍රීය කළ යුතුය.

source: When enabled, Org Admins could not add new users. This should be enabled if you manage users by external system.
si_lk: සබල කළ විට, Org Admins හට නව පරිශීලකයින් එක් කිරීමට නොහැකි විය. ඔබ බාහිර පද්ධතිය මගින් පරිශීලකයින් කළමනාකරණය කරන්නේ නම් මෙය සක්‍රීය කළ යුතුය.

source: Enable this setting to start blocking alert e-mails for events with a certain tag. Define the tag in MISP.block_event_alert_tag.
si_lk: යම් ටැගයක් සහිත සිදුවීම් සඳහා අනතුරු ඇඟවීමේ විද්‍යුත් තැපැල් අවහිර කිරීම ආරම්භ කිරීමට මෙම සැකසුම සබල කරන්න. MISP.block_event_alert_tag හි ටැගය නිර්වචනය කරන්න.

source: If the MISP.block_event_alert setting is set, alert e-mails for events tagged with the tag defined by this setting will be blocked.
si_lk: MISP.block_event_alert සැකසුම සකසා ඇත්නම්, මෙම සැකසුම මගින් අර්ථ දක්වා ඇති ටැගය සමඟ ටැග් කර ඇති සිදුවීම් සඳහා අනතුරු ඇඟවීමේ විද්‍යුත් තැපෑල අවහිර කරනු ලැබේ.

source: Enable this setting to start blocking alert e-mails for events that have already been published since a specified amount of time. This threshold is defined by MISP.event_alert_republish_ban_threshold
si_lk: නිශ්චිත කාලයක සිට දැනටමත් ප්‍රකාශයට පත් කර ඇති සිදුවීම් සඳහා අනතුරු ඇඟවීමේ විද්‍යුත් තැපැල් අවහිර කිරීම ආරම්භ කිරීමට මෙම සැකසුම සබල කරන්න. මෙම සීමාව MISP.event_alert_republish_ban_threshold මගින් අර්ථ දක්වා ඇත

source: If the MISP.event_alert_republish_ban setting is set, this setting will control how long no alerting by email will be done. Expected format: integer, in minutes
si_lk: MISP.event_alert_republish_ban සැකසුම සකසා ඇත්නම්, මෙම සැකසීම ඊමේල් මගින් දැනුම් දීමක් කොපමණ කාලයක් සිදු නොවේද යන්න පාලනය කරයි. අපේක්ෂිත ආකෘතිය: නිඛිල, මිනිත්තු වලින්

source: If the MISP.event_alert_republish_ban setting is set, this setting will control if a ban time should be reset if emails are tried to be sent during the ban.
si_lk: MISP.event_alert_republish_ban සැකසුම සකසා ඇත්නම්, තහනම අතරතුර ඊමේල් යැවීමට උත්සාහ කළහොත් තහනම් වේලාවක් යළි සැකසිය යුතුද යන්න මෙම සැකසීම පාලනය කරයි.

source: Enable this setting to start blocking users to send too many e-mails notification since a specified amount of time. This threshold is defined by MISP.user_email_notification_ban_threshold
si_lk: නිශ්චිත වේලාවක සිට බොහෝ විද්‍යුත් තැපැල් දැනුම්දීම් යැවීමට පරිශීලකයින් අවහිර කිරීම ආරම්භ කිරීමට මෙම සැකසුම සබල කරන්න. මෙම සීමාව MISP.user_email_notification_ban_threshold මගින් අර්ථ දක්වා ඇත
