Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: The following API documentation is derived directly from [MISP RestResponseComponent's source code](app/Controller/Component/RestResponseComponent.php)
si_lk: පහත API ප්‍රලේඛනය [MISP RestResponseComponent's source code](app/Controller/Component/RestResponseComponent.php) වෙතින් සෘජුවම ව්‍යුත්පන්න කර ඇත.

source: Successfully saved API documentation
si_lk: API ලේඛන සාර්ථකව සුරකින ලදී

source: Could not save API documentation
si_lk: API ලේඛන සුරැකීමට නොහැකි විය

source: URL Parameters
si_lk: URL පරාමිතීන්

source: Parameters
si_lk: පරාමිතීන්

source: Mandatory
si_lk: අනිවාර්යයි

source: Optional
si_lk: විකල්ප

source: API Documentation
si_lk: API ලේඛනගත කිරීම

source: Name
si_lk: නම

source: Type
si_lk: ටයිප් කරන්න

source: Description
si_lk: විස්තර

source: Update the JSON definitions of MISP.
si_lk: MISP හි JSON අර්ථ දැක්වීම් යාවත්කාලීන කරන්න.

source: Set setting in PHP config file.
si_lk: PHP වින්‍යාස ගොනුවේ සැකසුම් සකසන්න.

source: Setting name
si_lk: නම සැකසීම

source: Setting value
si_lk: අගය සැකසීම

source: Set if MISP instance is live and accessible for users.
si_lk: MISP අවස්ථාව සජීවී නම් සහ පරිශීලකයින් සඳහා ප්‍රවේශ විය හැකි නම් සකසන්න.

source: Set Live state
si_lk: සජීවී තත්ත්වය සකසන්න

source: Reencrypt encrypted values in database (authkeys and sensitive system settings).
si_lk: දත්ත සමුදායේ සංකේතාත්මක අගයන් නැවත සංකේතනය කරන්න (authkeys සහ සංවේදී පද්ධති සැකසුම්).

source: Old key. If not provided, current key will be used.
si_lk: පැරණි යතුර. සපයා නොමැති නම්, වත්මන් යතුර භාවිතා කරනු ඇත.

source: New key. If not provided, new key will be generated.
si_lk: නව යතුර. සපයා නොමැති නම්, නව යතුර උත්පාදනය වනු ඇත.

source: Remove orphaned correlations.
si_lk: අනාථ සහසම්බන්ධතා ඉවත් කරන්න.

source: Optimise database tables.
si_lk: දත්ත සමුදා වගු ප්‍රශස්ත කරන්න.

source: Get detailed information about Redis memory usage.
si_lk: Redis මතක භාවිතය පිළිබඳ සවිස්තර තොරතුරු ලබා ගන්න.

source: Check if it is possible connect to Redis.
si_lk: Redis වෙත සම්බන්ධ විය හැකිදැයි පරීක්ෂා කරන්න.

source: Database updated:
si_lk: දත්ත සමුදාය යාවත්කාලීන කරන ලදී:

source: Could not update the database:
si_lk: දත්ත සමුදාය යාවත්කාලීන කළ නොහැක:

source: Worker restarted.
si_lk: සේවකයා නැවත ආරම්භ විය.

source: Could not restart the worker. Reason: %s
si_lk: සේවකයා නැවත ආරම්භ කිරීමට නොහැකි විය. හේතුව: %s

source: Worker killed.
si_lk: කම්කරුවා මැරුවා.

source: Worker started.
si_lk: සේවකයා ආරම්භ කළේය.

source: %s updated.
si_lk: %s යාවත්කාලීන කරන ලදී.

source: Could not update %s.
si_lk: %sයාවත්කාලීන කිරීමට නොහැකි විය.

source: All taxonomies are up to date already.
si_lk: සියලුම වර්ගීකරණයන් දැනටමත් යාවත්කාලීනයි.

source: Could not update any of the taxonomies.
si_lk: වර්ගීකරණ කිසිවක් යාවත්කාලීන කළ නොහැකි විය.

source: Successfully updated %s taxonomies.
si_lk: වර්ගීකරණ %s ක් සාර්ථකව යාවත්කාලීන කරන ලදී.

source: However, could not update %s taxonomies.
si_lk: කෙසේ වෙතත්, වර්ගීකරණ %s යාවත්කාලීන කිරීමට නොහැකි විය.

source: All object templates are up to date already.
si_lk: සියලුම වස්තු සැකිලි දැනටමත් යාවත්කාලීන වේ.

source: Could not update any of the object templates.
si_lk: වස්තු සැකිලි කිසිවක් යාවත්කාලීන කළ නොහැක.

source: Successfully updated %s object templates.
si_lk: වස්තු සැකිලි %s ක් සාර්ථකව යාවත්කාලීන කරන ලදී.

source: However, could not update %s object templates.
si_lk: කෙසේ වෙතත්, %s වස්තු සැකිලි යාවත්කාලීන කිරීමට නොහැකි විය.

source: Setting change rejected.
si_lk: සැකසුම් වෙනස් කිරීම ප්‍රතික්ෂේප විය.

source: Setting "%s" changed to %s
si_lk: "%s" සැකසීම %sට වෙනස් විය

source: The setting change was rejected. MISP considers the requested setting value as invalid and would lead to the following error: "%s" If you still want to force this change, please supply the --force argument.
si_lk: සැකසුම් වෙනස් කිරීම ප්‍රතික්ෂේප විය. MISP විසින් ඉල්ලන ලද සැකසුම් අගය වලංගු නොවන ලෙස සලකන අතර පහත දෝෂයට තුඩු දෙනු ඇත: "%s" ඔබට තවමත් මෙම වෙනස් කිරීමට බල කිරීමට අවශ්‍ය නම්, කරුණාකර --force තර්කය සපයන්න.

source: Last DB num which was successfully executed:
si_lk: සාර්ථකව ක්‍රියාත්මක කළ අවසන් DB අංකය:

source: Something went wrong. Could not find the existing db version
si_lk: මොකක්හරි වැරැද්දක් වෙලා. පවතින db අනුවාදය සොයා ගැනීමට නොහැකි විය

source: DB was never successfully updated or we are on a fresh install
si_lk: DB කිසි විටෙකත් සාර්ථකව යාවත්කාලීන කර නැත, නැතහොත් අපි නැවුම් ස්ථාපනයක සිටිමු

source: MISP mass sync authkey reset command line tool
si_lk: MISP mass sync authkey reset command line මෙවලම

source: Invalid user.
si_lk: වලංගු නොවන පරිශීලක.

source: User has to be a site admin.
si_lk: පරිශීලකයා අඩවි පරිපාලකයෙකු විය යුතුය.

source: Error: %s
si_lk: දෝෂය: %s

source: %s events purged.
si_lk: සිදුවීම් %s ක් ඉවත් කරන ලදී.

source: > Database schema dumped on disk
si_lk: > දත්ත සමුදා ක්‍රමය තැටියට දමන ලදී

source: Something went wrong. Could not find the existing db version or fetch the current database schema.
si_lk: මොකක්හරි වැරැද්දක් වෙලා. පවතින db අනුවාදය සොයා ගැනීමට හෝ වත්මන් දත්ත සමුදා යෝජනා ක්‍රමය ලබා ගැනීමට නොහැකි විය.

source: %s orphaned correlation removed
si_lk: %s අනාථ සහසම්බන්ධය ඉවත් කරන ලදී

source: The upgrade process is complete, %s authkey(s) generated.
si_lk: උත්ශ්‍රේණි කිරීමේ ක්‍රියාවලිය සම්පූර්ණයි, %s authkey(s) ජනනය කර ඇත.

source: Please insert new key "%s" to config file manually.
si_lk: ගොනුව අතින් වින්‍යාස කිරීමට කරුණාකර නව යතුර "%s" ඇතුළු කරන්න.

source: New encryption key "%s" saved into config file.
si_lk: නව සංකේතාංකන යතුර "%s" වින්‍යාස ගොනුවේ සුරකින ලදී.

source: Massaging the feed metadata file.
si_lk: සංග්‍රහ පාරදත්ත ගොනුව සම්බාහනය කිරීම.

source: Could not read the defaults.json file at %s. Exiting
si_lk: %sට defaults.json ගොනුව කියවීමට නොහැකි විය. පිටවීම

source: Done. The feed definitions contain %s feeds and can be found at %s.
si_lk: කළා. සංග්‍රහ නිර්වචන වල සංග්‍රහ %s ක් අඩංගු වන අතර %sහි සොයා ගත හැක.

source: Something went wrong.
si_lk: මොකක්හරි වැරැද්දක් වෙලා.

source: Import event from file into MISP.
si_lk: සිදුවීම ගොනුවෙන් MISP වෙත ආයාත කරන්න.

source: User ID that will owner of uploaded event.
si_lk: උඩුගත කළ සිදුවීමේ හිමිකරු වන පරිශීලක හැඳුනුම්පත.

source: Path to JSON MISP file, can be gzipped or bz2 compressed.
si_lk: JSON MISP ගොනුව වෙත මාර්ගය, gzipped හෝ bz2 සම්පීඩනය කළ හැක.

source: Generate event notification email in EML format.
si_lk: EML ආකෘතියෙන් සිදුවීම් දැනුම්දීම් ඊමේල් ජනනය කරන්න.

source: Event ID
si_lk: සිදුවීම් හැඳුනුම්පත

source: User ID
si_lk: පරිශීලක ID

source: Show duplicate tags
si_lk: අනුපිටපත් ටැග් පෙන්වන්න

source: Merge tags
si_lk: ටැග් ඒකාබද්ධ කරන්න

source: Source tag ID or name. Source tag will be deleted.
si_lk: මූලාශ්‍ර ටැග් හැඳුනුම්පත හෝ නම. මූලාශ්‍ර ටැගය මකා දැමෙනු ඇත.

source: Destination tag ID or name.
si_lk: ගමනාන්ත ටැග් ID හෝ නම.

source: %s attribute or event tags changed
si_lk: %s ගුණාංග හෝ සිදුවීම් ටැග් වෙනස් කරන ලදී

source: Invalid event
si_lk: වලංගු නොවන සිදුවීමක්

source: Recovering event %s
si_lk: ප්‍රතිසාධන සිදුවීම %s

source: Recovery complete. Event #%s recovered, using %s log entries.
si_lk: ප්‍රතිසාධනය සම්පූර්ණයි. සිදුවීම් #%s ප්‍රතිසාධනය, ලොග් ඇතුළත් කිරීම් %s ක් භාවිතා කර ඇත.

source: Generating top correlations list.
si_lk: ඉහළ සහසම්බන්ධතා ලැයිස්තුව උත්පාදනය කිරීම.

source: Job done.
si_lk: වැඩේ ඉවරයි.

source: Show statistics from audit logs.
si_lk: විගණන ලොග වලින් සංඛ්‍යාලේඛන පෙන්වන්න.

source: Show statistics from logs.
si_lk: ලඝු-සටහන් වලින් සංඛ්‍යාලේඛන පෙන්වන්න.

source: Export logs to compressed file in JSON Lines format (one JSON encoded line per entry).
si_lk: JSON රේඛා ආකෘතියෙන් සම්පීඩිත ගොනුවට ලොග නිර්යාත කරන්න (එක් ප්‍රවේශයකට JSON කේතන රේඛාවක්).

source: Path to output file
si_lk: ප්‍රතිදාන ගොනුව වෙත මාර්ගය

source: Count:
si_lk: ගණන්:

source: First:
si_lk: පළමුවන:

source: Last:
si_lk: අවසන්:

source: Data size:
si_lk: දත්ත ප්රමාණය:

source: Index size:
si_lk: දර්ශක ප්රමාණය:

source: Reclaimable size:
si_lk: ආපසු ලබාගත හැකි ප්රමාණය:

source: Compressed items:
si_lk: සම්පීඩිත අයිතම:

source: Uncompressed size:
si_lk: සම්පීඩනය නොකළ ප්රමාණය:

source: Compressed size:
si_lk: සම්පීඩිත ප්රමාණය:

source: override password change
si_lk: මුරපදය වෙනස් කිරීම අභිබවා යන්න

source: Pull completed. %s events pulled, %s events could not be pulled, %s proposals pulled, %s sightings pulled, %s clusters pulled.
si_lk: අදින්න සම්පූර්ණයි. සිද්ධි %s ක් ඇද, සිදුවීම් %s ක් අදින්නට නොහැකි විය, යෝජනා %s ඇද, දර්ශන %s ඇද, පොකුරු %s ඇද ඇත.

source: ERROR: %s
si_lk: දෝෂය: %s

source: Job failed. See error logs for more details.
si_lk: රැකියාව අසාර්ථක විය. වැඩි විස්තර සඳහා දෝෂ ලඝු බලන්න.

source: See error logs for more details.
si_lk: වැඩි විස්තර සඳහා දෝෂ ලඝු බලන්න.

source: %s feed from %s cached. Failed: %s
si_lk: හැඹිලි %s කින් සංග්‍රහ %s ක්. අසාර්ථකයි: %s

source: Processing organisation %s / %s.%s
si_lk: %sසංවිධානය %s .%s

source: Total local orgs: %s%s
si_lk: මුළු දේශීය ආයතන: %s%s

source: Local orgs with event creations: %s%s
si_lk: සිදුවීම් නිර්මාණ සහිත දේශීය ආයතන: %s%s

source: Average days until first event: %s
si_lk: පළමු සිදුවීම දක්වා සාමාන්‍ය දින: %s

source: Year over year growth of organisation count.
si_lk: සංවිධානයේ සංඛ්‍යාව වසරින් වසර වර්ධනය.

source: verbose mode
si_lk: වාචික මාදිලිය

source: interactive mode
si_lk: අන්තර් ක්රියාකාරී මාදිලිය

source: Get list of user accounts.
si_lk: පරිශීලක ගිණුම් ලැයිස්තුවක් ලබා ගන්න.

source: Output as JSON.
si_lk: JSON ලෙස ප්‍රතිදානය කරන්න.

source: Get information about given authkey.
si_lk: ලබා දී ඇති authkey පිළිබඳ තොරතුරු ලබා ගන්න.

source: Authentication key. If not provide, it will be read from STDIN.
si_lk: සත්‍යාපන යතුර. ලබා නොදෙන්නේ නම්, එය STDIN වෙතින් කියවනු ලැබේ.

source: Check if given authkey by STDIN is valid.
si_lk: STDIN විසින් ලබා දී ඇති authkey වලංගු දැයි පරීක්ෂා කරන්න.

source: Immediately block user.
si_lk: පරිශීලකයා වහාම අවහිර කරන්න.

source: User ID or e-mail address.
si_lk: පරිශීලක හැඳුනුම්පත හෝ ඊමේල් ලිපිනය.

source: Unblock blocked user.
si_lk: අවහිර කළ පරිශීලකයා අවහිර නොකරන්න.

source: Change user password.
si_lk: පරිශීලක මුරපදය වෙනස් කරන්න.

source: New user password.
si_lk: නව පරිශීලක මුරපදය.

source: Do not require password change.
si_lk: මුරපදය වෙනස් කිරීම අවශ්ය නොවේ.

source: Change authkey. When advanced authkeys are enabled, old authkeys will be disabled.
si_lk: Autkey වෙනස් කරන්න. උසස් authkeys සබල කළ විට, පැරණි autkey අක්‍රිය වනු ඇත.

source: Show IP addresses that user uses to access MISP.
si_lk: MISP වෙත පිවිසීමට පරිශීලකයා භාවිතා කරන IP ලිපින පෙන්වන්න.

source: Get user ID for user IP. If multiple users use the same IP, only last user ID will be returned.
si_lk: පරිශීලක IP සඳහා පරිශීලක හැඳුනුම්පත ලබා ගන්න. බහු පරිශීලකයින් එකම IP භාවිතා කරන්නේ නම්, අවසාන පරිශීලක හැඳුනුම්පත පමණක් ආපසු ලබා දෙනු ඇත.

source: IPv4 or IPv6 address.
si_lk: IPv4 හෝ IPv6 ලිපිනය.

source: Authentication key for user %s (%s) updated.
si_lk: පරිශීලක %s (%s) සඳහා සත්‍යාපන යතුර යාවත්කාලීන කරන ලදී.

source: WARNING: This functionality is deprecated and will be removed in the near future.
si_lk: අවවාදයයි: මෙම ක්‍රියාකාරීත්වය අත්හරින ලද අතර නුදුරු අනාගතයේදී ඉවත් කරනු ලැබේ.

source: WARNING: MISP is currently running under PHP 8.0, which is unsupported. Background jobs will fail, so please contact your administrator to run a supported PHP version (such as 7.4)
si_lk: අවවාදයයි: MISP දැනට PHP 8.0 යටතේ ධාවනය වේ, එය සහාය නොදක්වයි. පසුබිම් රැකියා අසාර්ථක වනු ඇත, එබැවින් කරුණාකර සහාය දක්වන PHP අනුවාදයක් ධාවනය කිරීමට ඔබේ පරිපාලක අමතන්න (7.4 වැනි)

source: Something went wrong. Your user account that you are authenticated with doesn't exist anymore.
si_lk: මොකක්හරි වැරැද්දක් වෙලා. ඔබ සත්‍යාපනය කර ඇති ඔබගේ පරිශීලක ගිණුම තවදුරටත් නොපවතී.

source: Warning: MISP is currently disabled for all users. Enable it in Server Settings (Administration -> Server Settings -> MISP tab -> live). An update might also be in progress, you can see the progress in
si_lk: අවවාදයයි: MISP දැනට සියලුම පරිශීලකයින් සඳහා අබල කර ඇත. එය සේවාදායක සැකසීම් තුළ සබල කරන්න (පරිපාලනය -> සේවාදායක සැකසීම් -> MISP ටැබය -> සජීවී). යාවත්කාලීන කිරීමක් ද සිදු වෙමින් පවතී, ඔබට ප්‍රගතිය දැකිය හැකිය

source: Update Progress
si_lk: යාවත්කාලීන ප්‍රගතිය

source: Your user account has been disabled.
si_lk: ඔබගේ පරිශීලක ගිණුම අබල කර ඇත.

source: This authentication key is not authorized to be used for exports. Contact your administrator.
si_lk: මෙම සත්‍යාපන යතුර අපනයන සඳහා භාවිතා කිරීමට අවසර නැත. ඔබේ පරිපාලක අමතන්න.

source: You have to be logged in to do that.
si_lk: එය කිරීමට ඔබ ලොග් විය යුතුය.

source: Either specify the search terms in the url, or POST a json with the filter parameters.
si_lk: එක්කෝ url හි සෙවුම් පද සඳහන් කරන්න, නැතහොත් පෙරහන් පරාමිති සමඟ json එකක් POST කරන්න.

source: RestSearch is not implemented (yet) for this scope.
si_lk: RestSearch මෙම විෂය පථය සඳහා (තවමත්) ක්‍රියාත්මක කර නොමැත.

source: Restsearch queries using GET and no parameters are not allowed. If you have passed parameters via a JSON body, make sure you use POST requests.
si_lk: GET භාවිතයෙන් නැවත සෙවුම් විමසුම් සහ කිසිදු පරාමිතියකට ඉඩ නොදේ. ඔබ JSON ශරීරයක් හරහා පරාමිති සමත් වී ඇත්නම්, ඔබ POST ඉල්ලීම් භාවිතා කරන බවට වග බලා ගන්න.

source: No event ID set.
si_lk: සිදුවීම් හැඳුනුම්පතක් සකසා නැත.

source: You do not have permission to do that.
si_lk: එසේ කිරීමට ඔබට අවසර නැත.

source: Invalid Sharing Group or not authorised.
si_lk: වලංගු නොවන බෙදාගැනීමේ කණ්ඩායමක් හෝ අවසරයක් නැත.

source: Attribute does not exist or you do not have the permission to download this attribute.
si_lk: උපලක්ෂණයක් නොපවතී හෝ ඔබට මෙම උපලක්ෂණ බාගැනීමට අවසර නැත.

source: Attribute not an attachment or malware-sample
si_lk: ඇමුණුමක් හෝ අනිෂ්ට මෘදුකාංග නියැදියක් නොවේ ආරෝපණය කරන්න

source: Invalid Event.
si_lk: වලංගු නොවන සිදුවීමක්.

source: PHP says file was not uploaded. Are you attacking me?
si_lk: PHP පවසන්නේ ගොනුව උඩුගත නොකළ බවයි. ඔබ මට පහර දෙනවාද?

source: Some of the attachments failed to upload. The failed files were: %s - This can be caused by the attachments already existing in the event.
si_lk: සමහර ඇමුණුම් උඩුගත කිරීමට අසමත් විය. අසාර්ථක ගොනු වූයේ: %s - මෙය සිදුවීමේ දැනටමත් පවතින ඇමුණුම් නිසා විය හැක.

source: The attachment(s) could not be saved. Please contact your administrator.
si_lk: ඇමුණුම්(ය) සුරැකීමට නොහැකි විය. කරුණාකර ඔබේ පරිපාලක අමතන්න.

source: There was a problem to upload the file.
si_lk: ගොනුව උඩුගත කිරීමේ ගැටලුවක් ඇති විය.

source: The ThreatConnect data has been imported.
si_lk: ThreatConnect දත්ත ආයාත කර ඇත.

source: %s entries imported.
si_lk: ඇතුළත් කිරීම් %s ක් ආනයනය කරන ලදී.

source: %s entries could not be imported.
si_lk: ඇතුළත් කිරීම් %s ක් ආයාත කළ නොහැකි විය.

source: Invalid attribute
si_lk: වලංගු නොවන ගුණාංගය

source: Attribute could not be saved: Attribute in the request not newer than the local copy.
si_lk: උපලක්ෂණ සුරැකිය නොහැක: ඉල්ලීමෙහි ඇති ගුණාංගය දේශීය පිටපතට වඩා අලුත් නොවේ.

source: Invalid attribute.
si_lk: වලංගු නොවන ගුණාංගය.

source: The attribute has been saved
si_lk: ගුණාංගය සුරැකී ඇත

source: The attribute could not be saved. Please, try again.
si_lk: ගුණාංගය සුරැකීමට නොහැකි විය. කරුණාකර නැවත උත්සාහ කරන්න.

source: Invalid input.
si_lk: වලංගු නොවන ආදානය.

source: Invalid field.
si_lk: වලංගු නොවන ක්ෂේත්‍රය.

source: This function is only accessible via POST requests.
si_lk: මෙම කාර්යයට ප්‍රවේශ විය හැක්කේ POST ඉල්ලීම් හරහා පමණි.

source: Attribute deleted
si_lk: ගුණාංගය මකා ඇත

source: Attribute was not deleted
si_lk: ගුණාංගය මකා නැත

source: Invalid Attribute
si_lk: වලංගු නොවන ගුණාංගය

source: Could not restore the attribute
si_lk: ගුණාංගය ප්‍රතිසාධනය කළ නොහැකි විය

source: No matching attributes found.
si_lk: ගැළපෙන ගුණාංග කිසිවක් හමු නොවීය.

source: This method can only be accessed via AJAX and POST.
si_lk: මෙම ක්‍රමයට ප්‍රවේශ විය හැක්කේ AJAX සහ POST හරහා පමණි.

source: No event ID provided.
si_lk: සිදුවීම් ID සපයා නැත.

source: You are not authorized to edit this event.
si_lk: මෙම සිදුවීම සංස්කරණය කිරීමට ඔබට අවසර නැත.

source: No attributes selected
si_lk: ගුණාංග කිසිවක් තෝරා නැත

source: Synonyms:
si_lk: සමාන පද:

source: This method can only be accessed via POST.
si_lk: මෙම ක්‍රමයට ප්‍රවේශ විය හැක්කේ POST හරහා පමණි.

source: You are not authorized. Please send the Authorization header with your auth key along with an Accept header for application/xml.
si_lk: ඔබට අවසර නැත. යෙදුම/xml සඳහා පිළිගන්න ශීර්ෂයක් සමඟ කරුණාකර ඔබගේ සත්‍යාපන යතුර සමඟ අවසර ශීර්ෂය යවන්න.

source: All done.
si_lk: ඔක්කොම කරලා.

source: Job queued. You can view the progress if you navigate to the active jobs view (administration -> jobs).
si_lk: රැකියාව පෝලිමේ. ඔබ සක්‍රිය රැකියා දසුනට (පරිපාලනය -> රැකියා) සැරිසැරුවහොත් ඔබට ප්‍රගතිය නැරඹිය හැක.

source: Invalid field requested.
si_lk: වලංගු නොවන ක්ෂේත්‍රයක් ඉල්ලා ඇත.

source: This function can only be accessed via AJAX.
si_lk: මෙම කාර්යයට ප්‍රවේශ විය හැක්කේ AJAX හරහා පමණි.

source: You do not have permission to do that
si_lk: එසේ කිරීමට ඔබට අවසර නැත

source: Event not found or you don't have permissions to create attributes
si_lk: සිදුවීම හමු නොවීය හෝ ඔබට උපලක්ෂණ සෑදීමට අවසර නැත

source: This action can only be accessed via AJAX.
si_lk: මෙම ක්‍රියාවට ප්‍රවේශ විය හැක්කේ AJAX හරහා පමණි.

source: You are not authorised to do that.
si_lk: එසේ කිරීමට ඔබට අවසර නැත.

source: This functionality requires API key access.
si_lk: මෙම ක්‍රියාකාරීත්වයට API යතුරු ප්‍රවේශය අවශ්‍ය වේ.

source: This action is for the API only. Please refer to the automation page for information on how to use it.
si_lk: මෙම ක්‍රියාව API සඳහා පමණි. එය භාවිතා කරන ආකාරය පිළිබඳ තොරතුරු සඳහා කරුණාකර ස්වයංක්‍රීයකරණ පිටුව බලන්න.

source: No hash or event ID received. You need to set at least one of the two.
si_lk: හැෂ් හෝ සිදුවීම් හැඳුනුම්පතක් ලැබී නැත. ඔය දෙකෙන් එකක් වත් සෙට් කරන්න ඕන.

source: Invalid script.
si_lk: වලංගු නොවන ස්ක්‍රිප්ට් එකක්.

source: No valid enrichment options found for this attribute.
si_lk: මෙම ගුණාංගය සඳහා වලංගු පොහොසත් කිරීමේ විකල්ප හමු නොවීය.

source: Invalid type requested.
si_lk: වලංගු නොවන වර්ගයක් ඉල්ලා ඇත.

source: Invalid tag
si_lk: වලංගු නොවන ටැගය

source: Invalid tag.
si_lk: වලංගු නොවන ටැගය.

source: Disabling the correlation is not permitted on this instance.
si_lk: මෙම අවස්ථාවෙහිදී සහසම්බන්ධය අක්‍රිය කිරීමට අවසර නැත.

source: Invalid Attribute.
si_lk: වලංගු නොවන ගුණාංගය.

source: Invalid attribute ID.
si_lk: වලංගු නොවන ගුණාංග ID.

source: The attachment have been uploaded.
si_lk: ඇමුණුම උඩුගත කර ඇත.

source: Tag added.
si_lk: ටැගය එකතු කරන ලදී.

source: Tag could not be added.
si_lk: ටැගය එක් කළ නොහැකි විය.

source: However, %s tag was added.
si_lk: කෙසේ වෙතත්, %s ටැග් එකතු කරන ලදී.

source: Add
si_lk: එකතු කරන්න

source: Edit
si_lk: සංස්කරණය කරන්න

source: Soft delete
si_lk: මෘදු මකා දැමීම

source: Delete
si_lk: මකන්න

source: Undelete
si_lk: මකා දැමීම ඉවත් කරන්න

source: Tag
si_lk: ටැග් කරන්න

source: Remove tag
si_lk: ටැගය ඉවත් කරන්න

source: Galaxy cluster
si_lk: Galaxy පොකුර

source: Remove galaxy cluster
si_lk: මන්දාකිණි පොකුර ඉවත් කරන්න

source: Publish
si_lk: ප්‍රකාශ කරන්න

source: Publish sightings
si_lk: දර්ශන පළ කරන්න

source: Audit logs
si_lk: විගණන ලඝු-සටහන්

source: Audit logs for event #%s
si_lk: #%sසිදුවීම සඳහා විගණන ලඝු-සටහන්

source: Auth Keys
si_lk: සත්‍යාපන යතුරු

source: Edit auth key
si_lk: සත්‍යාපන යතුර සංස්කරණය කරන්න

source: Add auth key
si_lk: සත්‍යාපන යතුර එක් කරන්න

source: Auth key
si_lk: සත්‍යාපන යතුර

source: Invalid Cerebrate instance ID provided.
si_lk: වලංගු නොවන Cerebrate අවස්ථා ID සපයා ඇත.

source: Added %s new organisations, updated %s existing organisations, %s failures.
si_lk: නව සංවිධාන %s ක් එකතු කරන ලදී, පවතින සංවිධාන %s ක් යාවත්කාලීන කරන ලදී, අසාර්ථක වීම් %s ක්.

source: Sync organisation information
si_lk: සංවිධානයේ තොරතුරු සමමුහුර්ත කරන්න

source: Are you sure you want to download and add / update the remote organisations from the Cerebrate node?
si_lk: ඔබට Cerebrate node වෙතින් දුරස්ථ සංවිධාන බාගැනීමට සහ එක් කිරීමට/යාවත්කාලීන කිරීමට අවශ්‍ය බව විශ්වාසද?

source: Pull all
si_lk: සියල්ල අදින්න

source: Added %s new sharing groups, updated %s existing sharing groups, %s failures.
si_lk: නව බෙදාගැනීමේ කණ්ඩායම් %s ක් එකතු කරන ලදී, පවතින බෙදාගැනීමේ කණ්ඩායම් %s ක් යාවත්කාලීන කරන ලදී, අසාර්ථක වීම් %s ක්.

source: Sync sharing group information
si_lk: කණ්ඩායම් තොරතුරු බෙදාගැනීම සමමුහුර්ත කරන්න

source: Are you sure you want to download and add / update the remote sharing group from the Cerebrate node?
si_lk: ඔබට Cerebrate node වෙතින් දුරස්ථ බෙදාගැනීමේ කණ්ඩායම බාගත කර එක් කිරීමට / යාවත්කාලීන කිරීමට අවශ්‍ය බව විශ්වාසද?

source: Organisation downloaded.
si_lk: සංවිධානය බාගත කර ඇත.

source: Download organisation information
si_lk: සංවිධානයේ තොරතුරු බාගන්න

source: Are you sure you want to download and add / update the remote organisation?
si_lk: ඔබට දුරස්ථ සංවිධානය බාගැනීමට සහ එක් කිරීමට/යාවත්කාලීන කිරීමට අවශ්‍ය බව විශ්වාසද?

source: Download
si_lk: බාගත

source: Sharing Group downloaded.
si_lk: බෙදාගැනීමේ කණ්ඩායම බාගත කර ඇත.

source: Download sharing group information
si_lk: කණ්ඩායම් තොරතුරු බෙදාගැනීම බාගන්න

source: Are you sure you want to download and add / update the remote sharing group?
si_lk: ඔබට දුරස්ථ බෙදාගැනීමේ කණ්ඩායම බාගත කර එක් කිරීමට / යාවත්කාලීන කිරීමට අවශ්‍ය බව විශ්වාසද?

source: Request sent.
si_lk: ඉල්ලීම යවන ලදී.

source: Something went wrong and the request could not be sent.
si_lk: යම් දෙයක් වැරදී ඇති අතර ඉල්ලීම යැවීමට නොහැකි විය.

source: The message could not be sent (either because e-mailing is disabled or because encryption is misconfigured), however, you can view the e-mail that would have been sent below. Feel free to send it manually.
si_lk: පණිවිඩය යැවීමට නොහැකි විය (එක්කෝ විද්‍යුත් තැපෑල අක්‍රිය කර ඇති නිසා හෝ සංකේතනය වැරදි ලෙස වින්‍යාස කර ඇති නිසා), කෙසේ වෙතත්, ඔබට පහත යවන ලද විද්‍යුත් තැපෑල බැලිය හැක. එය අතින් යැවීමට නිදහස් වන්න.

source: Correlation Exclusions index
si_lk: සහසම්බන්ධතා බැහැර කිරීම් දර්ශකය

source: Correlation Exclusion
si_lk: සහසම්බන්ධතා බැහැර කිරීම

source: Correlations cleanup initiated, based on the exclusion rules.
si_lk: බැහැර කිරීමේ නීති මත පදනම්ව සහසම්බන්ධතා පිරිසිදු කිරීම ආරම්භ කරන ලදී.

source: Clean up correlations
si_lk: සහසම්බන්ධතා පිරිසිදු කරන්න

source: Execute the cleaning of all correlations that are at odds with the exclusion rules? This will delete all matching correlations.
si_lk: බැහැර කිරීමේ රීතිවලට පටහැනි සියලු සහසම්බන්ධතා පිරිසිදු කිරීම ක්‍රියාත්මක කරන්නද? මෙය ගැලපෙන සියලුම සහසම්බන්ධතා මකනු ඇත.

source: Top correlations index
si_lk: ඉහළ සහසම්බන්ධතා දර්ශකය

source: No correlations found. Nothing to rank.
si_lk: සහසම්බන්ධතා හමු නොවීය. ශ්‍රේණිගත කිරීමට කිසිවක් නැත.

source: Top correlation list regenerated.
si_lk: ඉහළ සහසම්බන්ධතා ලැයිස්තුව නැවත උත්පාදනය කරන ලදී.

source: Top correlation list generation queued for background processing. Job ID: %s.
si_lk: පසුබිම සැකසීම සඳහා ඉහළ සහසම්බන්ධතා ලැයිස්තුව උත්පාදනය පෝලිම් කර ඇත. රැකියා ID: %s.

source: Invalid dashboard template.
si_lk: වලංගු නොවන උපකරණ පුවරු අච්චුව.

source: No widget name passed.
si_lk: විජට් නමක් සම්මත වී නැත.

source: Configuration of the widget that will be passed to the render. Check the view for more information
si_lk: විදැහුම්කරණයට යවනු ලබන විජට් වින්‍යාස කිරීම. වැඩි විස්තර සඳහා දර්ශනය පරීක්ෂා කරන්න

source: Alias to use as the title of the widget
si_lk: විජට් හි මාතෘකාව ලෙස භාවිතා කිරීමට අන්වර්ථය

source: No setting data found.
si_lk: සැකසුම් දත්ත හමු නොවීය.

source: Settings updated.
si_lk: සැකසීම් යාවත්කාලීන කරන ලදී.

source: Invalid widget.
si_lk: වලංගු නොවන විජට්.

source: This endpoint can only be reached via POST requests.
si_lk: මෙම අවසාන ලක්ෂ්‍යය වෙත ළඟා විය හැක්කේ POST ඉල්ලීම් හරහා පමණි.

source: You need to specify the widget to use along with the configuration.
si_lk: ඔබ වින්‍යාසය සමඟ භාවිතා කිරීමට විජට් සඳහන් කළ යුතුය.

source: Settings could not be updated.
si_lk: සැකසීම් යාවත්කාලීන කළ නොහැකි විය.

source: Dashboard template updated.
si_lk: උපකරණ පුවරු අච්චුව යාවත්කාලීන කරන ලදී.

source: Dashboard template could not be updated.
si_lk: උපකරණ පුවරු අච්චුව යාවත්කාලීන කළ නොහැකි විය.

source: Unrestricted
si_lk: සීමා රහිත
