Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: Include the original imported file as attachment
si_lk: මුල් ආනයනය කරන ලද ගොනුව ඇමුණුමක් ලෙස ඇතුළත් කරන්න

source: Extend this event
si_lk: මෙම සිදුවීම දිගු කරන්න

source: Check this event on different servers
si_lk: විවිධ සර්වර් වල මෙම සිදුවීම පරීක්ෂා කරන්න

source: Source Organisation
si_lk: මූලාශ්ර සංවිධානය

source: Member Organisation
si_lk: සාමාජික සංවිධානය

source: Undisclosed sharing group
si_lk: අනාවරණය නොකළ බෙදාගැනීමේ කණ්ඩායම

source: your organisation is the local owner of this event, however it is not explicitly listed in the sharing group.
si_lk: ඔබේ සංවිධානය මෙම සිදුවීමේ දේශීය හිමිකරු වේ, කෙසේ වෙතත් එය බෙදාගැනීමේ කණ්ඩායම තුළ පැහැදිලිව ලැයිස්තුගත කර නොමැත.

source: #Attributes
si_lk: #ගුණාංග

source: First recorded change
si_lk: පළමු වාර්තාගත වෙනස

source: Last change
si_lk: අවසාන වෙනස

source: Modification map
si_lk: වෙනස් කිරීමේ සිතියම

source: Extends
si_lk: දිගු කරයි

source: Extended by
si_lk: විසින් දීර්ඝ කර ඇත

source: Currently in %s view.
si_lk: දැනට %s බැලීමේ ඇත.

source: extended
si_lk: දිගු කර ඇත

source: atomic
si_lk: පරමාණුක

source: Switch to atomic view
si_lk: පරමාණුක දර්ශනය වෙත මාරු වන්න

source: Switch to extended view
si_lk: දිගු දසුනට මාරු වන්න

source: %s has requested that %s take over this event.
si_lk: %s විසින් %s මෙම සිදුවීම භාර ගන්නා ලෙස ඉල්ලා ඇත.

source: %s has requested that you take over this event.
si_lk: %s ඔබ මෙම සිදුවීම භාර ගන්නා ලෙස ඉල්ලා ඇත.

source: You have requested that %s take over this event.
si_lk: ඔබ %s විසින් මෙම සිදුවීම භාර ගන්නා ලෙස ඉල්ලා ඇත.

source: Delegation request
si_lk: නියෝජිත ඉල්ලීම

source: View request details
si_lk: ඉල්ලීම් විස්තර බලන්න

source: Disabled
si_lk: ආබාධිතයි

source: enable
si_lk: සක්රිය කරන්න

source: disable
si_lk: අක්රිය කරන්න

source: Extended view
si_lk: විස්තීරණ දසුන

source: Warning: Taxonomy inconsistencies
si_lk: අවවාදයයි: වර්ගීකරණයේ නොගැලපීම්

source: Show (%s more)
si_lk: පෙන්වන්න (තවත්%s)

source: Related Feeds
si_lk: අදාළ සංග්රහ

source: Show just attributes that has feed hits
si_lk: සංග්‍රහ පහර ඇති ගුණාංග පමණක් පෙන්වන්න

source: (show)
si_lk: (පෙන්වන්න)

source: This event has
si_lk: මෙම සිදුවීමට ඇත

source: correlations with data contained within the various feeds, however, due to the large number of attributes the actual feed correlations are not shown. Click <a href="%s\/overrideLimit:1">here</a> to refresh the page with the feed data loaded.
si_lk: විවිධ සංග්‍රහයන් තුළ අඩංගු දත්ත සමඟ සහසම්බන්ධතා, කෙසේ වෙතත්, විශාල ගුණාංග සංඛ්‍යාවක් හේතුවෙන් සත්‍ය ආහාර සහසම්බන්ධතා නොපෙන්වයි.</a> <a href="%s\/overrideLimit:1">කරන්න.

source: Warning: Potential false positives
si_lk: අවවාදයයි: විභව ව්යාජ ධනාත්මක

source: Show just attributes that has warning
si_lk: අනතුරු ඇඟවීමක් ඇති ගුණාංග පමණක් පෙන්වන්න

source: Toggle pivot graph
si_lk: විවර්තන ප්‍රස්තාරය ටොගල් කරන්න

source: Pivots
si_lk: හැරවුම්

source: Toggle galaxies
si_lk: මන්දාකිණි ටොගල් කරන්න

source: Toggle Event graph
si_lk: සිදුවීම් ප්‍රස්ථාරය ටොගල් කරන්න

source: Toggle Event timeline
si_lk: සිදුවීම් කාලරේඛාව ටොගල් කරන්න

source: Event timeline
si_lk: සිදුවීම් කාල සටහන

source: Toggle Correlation graph
si_lk: සහසම්බන්ධතා ප්‍රස්තාරය ටොගල් කරන්න

source: Correlation graph
si_lk: සහසම්බන්ධතා ප්රස්තාරය

source: Toggle ATT&CK matrix
si_lk: ATT&CK අනුකෘතිය ටොගල් කරන්න

source: ATT&CK matrix
si_lk: ATT&CK අනුකෘතිය

source: Toggle reports
si_lk: වාර්තා ටොගල් කරන්න

source: Event reports
si_lk: සිදුවීම් වාර්තා

source: Toggle attributes
si_lk: ගුණාංග ටොගල් කරන්න

source: Toggle discussions
si_lk: සාකච්ඡා ටොගල් කරන්න

source: Event Reports
si_lk: සිදුවීම් වාර්තා

source: (%s Object)
si_lk: (%s වස්තුව)

source: There are no Cluster relationships in this Event.
si_lk: මෙම සිදුවීම තුළ පොකුරු සම්බන්ධතා නොමැත.

source: Hover target
si_lk: ඉලක්කය තබා ගන්න

source: Selected
si_lk: තෝරා ගන්නා ලදී

source: Expand
si_lk: පුළුල් කරන්න

source: Toggle the physics engine on/off.
si_lk: භෞතික විද්‍යා එන්ජිම සක්‍රිය / අක්‍රිය ටොගල් කරන්න.

source: Select the enrichments you wish to run
si_lk: ඔබ ධාවනය කිරීමට බලාපොරොත්තු වන පොහොසත් කිරීම් තෝරන්න

source: Enrich
si_lk: පොහොසත් කරන්න

source: Choose the enrichment module that you wish to use for the expansion
si_lk: ඔබ පුළුල් කිරීම සඳහා භාවිතා කිරීමට බලාපොරොත්තු වන පොහොසත් කිරීමේ මොඩියුලය තෝරන්න

source: Enrich using the %s module
si_lk: %s මොඩියුලය භාවිතයෙන් පොහොසත් කරන්න

source: Event Deletion
si_lk: සිදුවීම් මකාදැමීම

source: Are you sure you want to delete
si_lk: ඔබට මැකීමට අවශ්ය බව ඔබට විශ්වාසද

source: Event #
si_lk: සිදුවීම #

source: Publish Event%s
si_lk: සිදුවීම%sප්‍රකාශ කරන්න

source: Unpublish Event%s
si_lk: සිදුවීම%sප්‍රකාශයට පත් නොකරන්න

source: Are you sure you wish to unpublish the event?
si_lk: ඔබට සිදුවීම ප්‍රකාශ කිරීම ඉවත් කිරීමට අවශ්‍ය බව විශ්වාසද?

source: Are you sure you wish publish and synchronise all sightings attached to this event?
si_lk: මෙම සිදුවීමට අමුණා ඇති සියලුම දර්ශන පළ කිරීමට සහ සමමුහුර්ත කිරීමට ඔබට අවශ්‍ය බව විශ්වාසද?

source: Publish but do NOT send alert email? Only for minor changes!
si_lk: ප්‍රකාශනය කරන්න නමුත් අනතුරු ඇඟවීමේ විද්‍යුත් තැපෑල යවන්නේ නැද්ද? සුළු වෙනස්කම් සඳහා පමණි!

source: Choose the format that you wish to download the event in
si_lk: ඔබට සිදුවීම බාගත කිරීමට අවශ්‍ය ආකෘතිය තෝරන්න

source: Choose the format that you would like to use for the import
si_lk: ඔබ ආනයනය සඳහා භාවිතා කිරීමට කැමති ආකෘතිය තෝරන්න

source: Import %s
si_lk: %sආයාත කරන්න

source: Toggle Correlation %s
si_lk: සහසම්බන්ධය ටොගල් කරන්න %s

source: Re-enable the correlation for this event. This will automatically re-correlate all contained attributes.
si_lk: මෙම සිදුවීම සඳහා සහසම්බන්ධය නැවත සබල කරන්න. මෙය ස්වයංක්‍රීයව සියලුම අඩංගු ගුණාංග නැවත සහසම්බන්ධ කරයි.

source: This will remove all correlations that already exist for the event and prevent any events to be related via correlations as long as this setting is disabled. Make sure you understand the downsides of disabling correlations.
si_lk: මෙය සිදුවීම සඳහා දැනටමත් පවතින සියලුම සහසම්බන්ධතා ඉවත් කරනු ඇති අතර මෙම සැකසුම අබල කර ඇති තාක් කල් සහසම්බන්ධතා හරහා කිසිදු සිදුවීමක් සම්බන්ධ වීම වළක්වයි. සහසම්බන්ධතා අක්‍රිය කිරීමේ අවාසි ඔබ තේරුම් ගෙන ඇති බවට වග බලා ගන්න.

source: Edit MISP feed
si_lk: MISP සංග්‍රහය සංස්කරණය කරන්න

source: Add MISP Feed
si_lk: MISP සංග්‍රහය එක් කරන්න

source: Add a new MISP feed source.
si_lk: නව MISP පෝෂක මූලාශ්‍රයක් එක් කරන්න.

source: Warning: local feeds are currently disabled by policy, to re-enable the feature, set the Security.disable_local_feed_access flag to false in the server settings. This setting can only be set via the CLI.
si_lk: අවවාදයයි: දේශීය සංග්‍රහ දැනට ප්‍රතිපත්ති මගින් අබල කර ඇත, විශේෂාංගය නැවත සක්‍රිය කිරීමට, සේවාදායක සැකසීම් තුළ Security.disable_local_feed_access ධජය අසත්‍ය ලෙස සකසන්න. මෙම සැකසුම සැකසිය හැක්කේ CLI හරහා පමණි.

source: Caching enabled
si_lk: හැඹිලිගත කිරීම සබල කර ඇත

source: Lookup visible
si_lk: බැලීම පෙනේ

source: Feed name
si_lk: පෝෂණය නම

source: Name of the content provider
si_lk: අන්තර්ගත සපයන්නාගේ නම

source: Input Source
si_lk: ආදාන මූලාශ්රය

source: Source Format
si_lk: මූලාශ්ර ආකෘතිය

source: Any headers to be passed with requests (for example: Authorization)
si_lk: ඉල්ලීම් සමඟ සම්මත කළ යුතු ඕනෑම ශීර්ෂයක් (උදාහරණයක් ලෙස: අවසරය)

source: Line break separated list of headers in the "headername: value" format
si_lk: "ශීර්ෂ නාමය: අගය" ආකෘතියෙන් රේඛා බිඳීම වෙන් කළ ශීර්ෂ ලැයිස්තුව

source: Creator organisation
si_lk: නිර්මාපක සංවිධානය

source: Target Event
si_lk: ඉලක්කගත සිදුවීම

source: Target Event ID
si_lk: ඉලක්ක සිදුවීම් ID

source: Leave blank unless you want to reuse an existing event.
si_lk: ඔබට පවතින සිදුවීමක් නැවත භාවිතා කිරීමට අවශ්‍ය නම් මිස හිස්ව තබන්න.

source: Value field(s) in the CSV
si_lk: CSV හි අගය ක්ෂේත්‍ර(ය)

source: Select one or several fields that should be parsed by the CSV parser and converted into MISP attributes
si_lk: CSV විග්‍රහය මඟින් විග්‍රහ කළ යුතු සහ MISP ගුණාංග බවට පරිවර්තනය කළ යුතු ක්ෂේත්‍ර එකක් හෝ කිහිපයක් තෝරන්න

source: 2,3,4 (column position separated by commas)
si_lk: 2,3,4 (තීරු පිහිටීම කොමාවෙන් වෙන් කර ඇත)

source: Delimiter
si_lk: පරිසීමකය

source: Set the default CSV delimiter (default = ",")
si_lk: පෙරනිමි CSV පරිසීමකය සකසන්න (පෙරනිමි = ",")

source: Exclusion Regex
si_lk: Regex බැහැර කිරීම

source: Regex pattern, for example: "/^https://myfeedurl/i
si_lk: Regex රටාව, උදාහරණයක් ලෙස: "/^https://myfeedurl/i

source: Auto Publish
si_lk: ස්වයංක්‍රීය ප්‍රකාශනය

source: Publish events directly after pulling the feed - if you would like to review the event before publishing uncheck this
si_lk: සංග්‍රහය ඇදීමෙන් පසු කෙලින්ම සිදුවීම් ප්‍රකාශ කරන්න - ඔබ ප්‍රකාශනය කිරීමට පෙර සිදුවීම සමාලෝචනය කිරීමට කැමති නම් මෙය සලකුණු නොකරන්න

source: Override IDS Flag
si_lk: IDS ධජය අභිබවා යන්න

source: If checked, the IDS flags will always be set to off when pulling from this feed
si_lk: පරීක්ෂා කළහොත්, මෙම සංග්‍රහයෙන් අදින විට IDS කොඩි සැම විටම ක්‍රියා විරහිත කිරීමට සකසනු ඇත

source: Delta Merge
si_lk: ඩෙල්ටා ඒකාබද්ධ කිරීම

source: Merge attributes (only add new attributes, remove revoked attributes)
si_lk: ගුණාංග ඒකාබද්ධ කරන්න (නව ගුණාංග පමණක් එක් කරන්න, අවලංගු කළ ගුණාංග ඉවත් කරන්න)

source: Default Tag
si_lk: පෙරනිමි ටැගය

source: None or less than 1% of the data of %s is contained in %s (%s matching values)
si_lk: %s හි දත්ත වලින් කිසිවක් හෝ 1% ට වඩා අඩු නොවේ %s (ගැලපෙන අගයන්%s)

source: %s% of the data of %s is contained in %s (%s matching values)
si_lk: %s හි දත්ත වලින් %s% %s හි අඩංගු වේ (ගැලපෙන අගයන් %s)

source: Parsed attributes from feed %s
si_lk: සංග්‍රහ %sවෙතින් විග්‍රහ කළ ගුණාංග

source: Fetch selected
si_lk: ලබා ගැනීම තෝරන ලදී

source: Paste feed data
si_lk: පෝෂක දත්ත අලවන්න

source: Paste a MISP feed metadata JSON below to add feeds.
si_lk: සංග්‍රහ එක් කිරීමට පහත MISP සංග්‍රහ පාරදත්ත JSON අලවන්න.

source: Feed metadata JSON
si_lk: සංග්‍රහ පාරදත්ත JSON

source: Enable selected
si_lk: තෝරාගත් සබල කරන්න

source: Disable selected
si_lk: තෝරාගත් අබල කරන්න

source: Enable caching for selected
si_lk: තෝරාගත් සඳහා හැඹිලිගත කිරීම සබල කරන්න

source: Disable caching for selected
si_lk: තෝරාගත් සඳහා හැඹිලිගත කිරීම අබල කරන්න

source: Default feeds
si_lk: පෙරනිමි සංග්රහ

source: Custom feeds
si_lk: අභිරුචි පෝෂණය

source: All feeds
si_lk: සියලුම පෝෂණය

source: Enabled feeds
si_lk: සබල කළ සංග්‍රහ

source: Enable pulling the feed into your MISP as events/attributes.
si_lk: සංග්‍රහය ඔබගේ MISP වෙත සිදුවීම්/ගුණාංග ලෙස ඇද ගැනීම සබල කරන්න.

source: Caching
si_lk: හැඹිලිගත කිරීම

source: Enable caching the feed into Redis - allowing for correlations to the feed to be shown.
si_lk: සංග්‍රහය Redis තුළට හැඹිලිගත කිරීම සබල කරන්න - සංග්‍රහයට සහසම්බන්ධතා පෙන්වීමට ඉඩ දෙයි.

source: Format
si_lk: ආකෘතිය

source: Headers
si_lk: ශීර්ෂ

source: Delta
si_lk: ඩෙල්ටා

source: Delta Merge strategy - align the local feed with the remote state
si_lk: Delta Merge උපාය - දේශීය සංග්‍රහය දුරස්ථ තත්ත්වය සමඟ පෙළගස්වන්න

source: Override
si_lk: අභිබවා යන්න

source: Override the IDS flags and set all derived attribute to IDS off
si_lk: IDS ධජ අභිබවා ගොස් IDS වෙත සියලු ව්‍යුත්පන්න උපලක්ෂණ ක්‍රියාවිරහිත කරන්න

source: Visible
si_lk: දෘශ්‍යමානයි

source: Generate feed lookup caches or fetch feed data (enabled feeds only)
si_lk: සංග්‍රහ බැලීමේ හැඹිලි උත්පාදනය කිරීම හෝ සංග්‍රහ දත්ත ලබා ගැනීම (සක්‍රීය සංග්‍රහ පමණි)

source: Load default feed metadata
si_lk: පෙරනිමි සංග්‍රහ පාරදත්ත පූරණය කරන්න

source: Cache all feeds
si_lk: සියලුම සංග්‍රහ හැඹිලි කරන්න

source: Cache freetext/CSV feeds
si_lk: හැඹිලි නිදහස් පෙළ/CSV සංග්‍රහ

source: Cache MISP feeds
si_lk: හැඹිලි MISP සංග්‍රහ

source: Fetch and store all feed data
si_lk: සියලුම සංග්‍රහ දත්ත ලබාගෙන ගබඩා කරන්න

source: Explore the events remotely
si_lk: සිදුවීම් දුරස්ථව ගවේෂණය කරන්න

source: Fetch all events
si_lk: සියලුම සිදුවීම් ලබා ගන්න

source: Are you sure you want to permanently remove the feed?
si_lk: ඔබට සංග්‍රහය ස්ථිරවම ඉවත් කිරීමට අවශ්‍ය බව විශ්වාසද?

source: Download feed metadata as JSON
si_lk: සංග්‍රහ පාරදත්ත JSON ලෙස බාගන්න

source: You are currently viewing an event from a feed (%s by %s)
si_lk: ඔබ දැනට සංග්‍රහයකින් සිදුවීමක් නරඹමින් සිටී (%s න් %s)

source: You are currently viewing the event index of a feed (%s by %s).
si_lk: ඔබ දැනට සංග්‍රහයක සිද්ධි දර්ශකය නරඹමින් සිටී (%s න් %s).

source: Timestamp
si_lk: වේලා මුද්රාව

source: Fetch the event
si_lk: සිදුවීම ලබා ගන්න

source: Feed URL
si_lk: සංග්‍රහ URL

source: Link to correlation
si_lk: සහසම්බන්ධතාවයට සබැඳිය

source: Feed Cache Search
si_lk: සංග්‍රහ හැඹිලි සෙවීම

source: Search for values potentially contained in the cached feeds and servers.
si_lk: හැඹිලි සංග්‍රහ සහ සේවාදායකවල අඩංගු විය හැකි අගයන් සොයන්න.

source: Source format
si_lk: මූලාශ්ර ආකෘතිය

source: Settings
si_lk: සැකසුම්

source: Coverage by other feeds
si_lk: වෙනත් ආහාර මගින් ආවරණය

source: Feed
si_lk: පෝෂණය කරන්න

source: Export galaxy: %s
si_lk: අපනයන මන්දාකිණිය: %s

source: Clusters' distribution:
si_lk: පොකුරු බෙදා හැරීම:

source: Include Custom Clusters
si_lk: අභිරුචි පොකුරු ඇතුළත් කරන්න

source: Include Default Clusters
si_lk: Default Clusters ඇතුලත් කරන්න

source: Export format
si_lk: අපනයන ආකෘතිය

source: MISP Format
si_lk: MISP ආකෘතිය

source: To re-import in another MISP
si_lk: වෙනත් MISP එකකින් නැවත ආයාත කිරීමට

source: misp-galaxy format
si_lk: misp-galaxy ආකෘතිය

source: Usable to be integrated into the official repository
si_lk: නිල ගබඩාවට ඒකාබද්ධ කිරීමට භාවිතා කළ හැකිය

source: The exported JSON will not contain the `category` key. Also, other keys such as `authors` and `version` may need to be adjusted manually.
si_lk: නිර්යාත JSON හි 'ප්‍රවර්ගය' යතුර අඩංගු නොවේ. එසේම, 'කර්තෘ' සහ 'අනුවාදය' වැනි අනෙකුත් යතුරු අතින් සකස් කිරීමට අවශ්‍ය විය හැක.

source: Export type
si_lk: අපනයන වර්ගය

source: Back to galaxy
si_lk: මන්දාකිණි වෙත ආපසු

source: %s galaxy cluster extensions
si_lk: %s මන්දාකිණි පොකුරු දිගු

source: Update cluster to parent's new version
si_lk: මාපිය නව අනුවාදයට පොකුර යාවත්කාලීන කරන්න

source: Latest version of the parent cluster
si_lk: මාපිය පොකුරේ නවතම අනුවාදය

source: Version:
si_lk: පිටපත:

source: Description:
si_lk: විස්තර:

source: Galaxy elements:
si_lk: මන්දාකිණි මූලද්රව්ය:

source: Import galaxy clusters
si_lk: මන්දාකිණි පොකුරු ආනයනය කරන්න

source: Paste a JSON of cluster to import or provide a JSON file below.
si_lk: JSON ගොනුවක් ආයාත කිරීමට හෝ පහතින් ලබා දීමට පොකුරු JSON අලවන්න.

source: Icon
si_lk: නිරූපකය

source: version
si_lk: පිටපත

source: Namespace
si_lk: නාම අවකාශය

source: Local Only
si_lk: දේශීය පමණි

source: Galaxy index
si_lk: Galaxy දර්ශකය

source: Enable
si_lk: සබල කරන්න

source: Are you sure you want to enable this galaxy library?
si_lk: ඔබට මෙම මන්දාකිණි පුස්තකාලය සබල කිරීමට අවශ්‍ය බව විශ්වාසද?

source: Disable
si_lk: අක්රිය කරන්න

source: Are you sure you want to disable this galaxy library?
si_lk: ඔබට මෙම මන්දාකිණි පුස්තකාලය අබල කිරීමට අවශ්‍ය බව විශ්වාසද?

source: Are you sure you want to delete the Galaxy?
si_lk: ඔබට Galaxy මැකීමට අවශ්‍ය බව විශ්වාසද?

source: %s galaxy cluster relationships
si_lk: %s මන්දාකිණි පොකුරු සම්බන්ධතා

source: There are no relations in this Galaxy
si_lk: මෙම Galaxy තුළ සම්බන්ධතා නොමැත

source: Yes. It can only be added in the local context.
si_lk: ඔව්. එය දේශීය සන්දර්භය තුළ පමණක් එකතු කළ හැකිය.

source: Kill chain order
si_lk: මරන්න දාම නියෝගය

source: (Optional) The cluster value that you would like to block
si_lk: (විකල්ප) ඔබ අවහිර කිරීමට කැමති පොකුරු අගය

source: (Optional) Any comments you would like to add regarding this (or these) entries
si_lk: (විකල්ප) මෙම (හෝ මෙම) ඇතුළත් කිරීම් සම්බන්ධයෙන් ඔබ එක් කිරීමට කැමති ඕනෑම අදහස්

source: Add block entry for Galaxy Cluster
si_lk: Galaxy Cluster සඳහා වාරණ ප්‍රවේශය එක් කරන්න

source: Edit block entry for Galaxy Cluster
si_lk: Galaxy Cluster සඳහා වාරණ ප්‍රවේශය සංස්කරණය කරන්න

source: Cluster UUID
si_lk: පොකුරු UUID

source: Pick target cluster
si_lk: ඉලක්ක පොකුරක් තෝරන්න

source: Cluster value
si_lk: පොකුරු අගය

source: + Add entry to blocklist
si_lk: + අවහිර ලැයිස්තුවට ප්‍රවේශය එක් කරන්න

source: Galaxy Cluster Blocklist Index
si_lk: Galaxy Cluster Blocklist දර්ශකය

source: List all galaxy clusters that will be prevented to be created (also via synchronization) on this instance
si_lk: මෙම අවස්ථාවෙහිදී (සමමුහුර්තකරණය හරහා) නිර්මාණය කිරීම වළක්වනු ලබන සියලුම මන්දාකිණි පොකුරු ලැයිස්තුගත කරන්න

source: relationships which can be used to link clusters together and explain the context of the relationship.
si_lk: පොකුරු එකට සම්බන්ධ කිරීමට සහ සම්බන්ධතාවයේ සන්දර්භය පැහැදිලි කිරීමට භාවිතා කළ හැකි සම්බන්ධතා.

source: Galaxy Cluster Relationship
si_lk: Galaxy Cluster සම්බන්ධතාවය

source: Source UUID
si_lk: මූලාශ්රය UUID

source: Pick source cluster
si_lk: මූලාශ්ර පොකුර තෝරන්න

source: Target UUID
si_lk: ඉලක්ක UUID

source: Relationship Type
si_lk: සම්බන්ධතා වර්ගය

source: is-similar
si_lk: වේ-සමාන

source: Pick type
si_lk: වර්ගය තෝරන්න

source: Tag list
si_lk: ටැග් ලැයිස්තුව

source: Pick tags
si_lk: ටැග් තෝරන්න

source: Custom Galaxy Cluster Relations
si_lk: අභිරුචි ගැලැක්සි පොකුරු සම්බන්ධතා

source: Relationship Tag
si_lk: සම්බන්ධතා ටැගය

source: Creator Org
si_lk: නිර්මාපක සංවිධානය

source: List all relationships between Galaxy Clusters
si_lk: Galaxy Clusters අතර ඇති සියලුම සම්බන්ධතා ලැයිස්තුගත කරන්න

source: Are you sure you want to delete the Relationship?
si_lk: ඔබට සම්බන්ධතාවය මැකීමට අවශ්‍ය බව විශ්වාසද?

source: Add Galaxy Cluster
si_lk: Galaxy Cluster එක් කරන්න

source: Edit Galaxy Cluster
si_lk: Galaxy Cluster සංස්කරණය කරන්න

source: Forked Cluster data
si_lk: Forked Cluster දත්ත

source: Toggle UI
si_lk: UI ටොගල් කරන්න

source: MITRE CTI Name
si_lk: MITER CTI නම

source: MITRE CTI Type
si_lk: MITER CTI වර්ගය

source: MITRE CTI Description
si_lk: MITER CTI විස්තරය

source: Toggle ATT&CK Matrix
si_lk: ATT&CK Matrix ටොගල් කරන්න

source: Merge updates from parent cluster
si_lk: මාපිය පොකුරු වෙතින් යාවත්කාලීන ඒකාබද්ධ කරන්න

source: No new version available
si_lk: නව අනුවාදයක් නොමැත

source: This interface allows you to update the selected cluster to the latest version of its parent.
si_lk: මෙම අතුරු මුහුණත ඔබට තෝරාගත් පොකුර එහි මාපිය නවතම අනුවාදයට යාවත්කාලීන කිරීමට ඉඩ සලසයි.

source: You can pick galaxy cluster's elements to import from the parent to the selected cluster.
si_lk: ඔබට මාපියගෙන් තෝරාගත් පොකුරට ආයාත කිරීමට මන්දාකිණි පොකුරේ මූලද්‍රව්‍ය තෝරාගත හැක.

source: Parent fork elements
si_lk: මාපිය දෙබලක මූලද්රව්ය

source: Version: %s (newer)
si_lk: අනුවාදය: %s (නව)

source: Key
si_lk: යතුර

source: No cluster element
si_lk: පොකුරු මූලද්‍රව්‍ය නැත

source: Current elements
si_lk: වත්මන් මූලද්රව්ය

source: Parent version: %s (older)
si_lk: මාපිය අනුවාදය: %s (පැරණි)

source: You are all set!
si_lk: ඔබ සියල්ල සූදානම්!

source: There are no new elements to be added from the parent cluster
si_lk: මව් පොකුරෙන් එකතු කිරීමට නව මූලද්‍රව්‍ය නොමැත

source: Elements in parent fork but not in this cluster
si_lk: මාපිය දෙබලක ඇති මූලද්‍රව්‍ය නමුත් මෙම පොකුරේ නොවේ

source: Import element into the cluster
si_lk: මූලද්‍රව්‍ය පොකුරට ආයාත කරන්න

source: %s (version: %s)
si_lk: %s (අනුවාදය: %s)

source: New version available! <a href="%s">Update cluster to version <b>%s</b></a>
si_lk: නව අනුවාදය තිබේ! <a href="%s">පොකුර <b>%s</b></a>අනුවාදයට යාවත්කාලීන කරන්න

source: %s (parent version: %s)
si_lk: %s (මව් අනුවාදය: %s)

source: Cluster ID
si_lk: පොකුරු හැඳුනුම්පත

source: Parent Galaxy
si_lk: මාපිය ගැලැක්සි

source: Collection UUID
si_lk: UUID එකතුව

source: Authors
si_lk: කතුවරුන්

source: Creator Organisation
si_lk: නිර්මාපක සංවිධානය

source: Connector tag
si_lk: සම්බන්ධක ටැගය

source: CyCat Relationships
si_lk: CyCat සබඳතා

source: CyCAT or the CYbersecurity Resource CATalogue aims at mapping and documenting, in a single formalism and catalogue all the available cybersecurity tools, rules, playbooks, processes and controls.
si_lk: CyCAT හෝ CYbersecurity Resource නාමාවලිය ඉලක්ක කරන්නේ තනි විධිමත්භාවයකින් සිතියම්ගත කිරීම සහ ලේඛනගත කිරීම සහ පවතින සියලුම සයිබර් ආරක්ෂණ මෙවලම්, රීති, ක්‍රීඩා පොත්, ක්‍රියාවලි සහ පාලන නාමාවලියයි.

source: %s event
si_lk: %s සිදුවීම

source: Is Inbound
si_lk: ඇතුල් වේ

source: Toggle Cluster relationships
si_lk: පොකුරු සම්බන්ධතා ටොගල් කරන්න

source: Relationship type
si_lk: සම්බන්ධතා වර්ගය

source: custom
si_lk: චාරිත්රය

source: -- Custom relationship --
si_lk: -- අභිරුචි සම්බන්ධතාවය --

source: Galaxy Cluster Deletion
si_lk: Galaxy Cluster මකාදැමීම

source: Are you sure you want to delete Galaxy Cluster %s (%s)?
si_lk: ඔබට Galaxy Cluster %s (%s) මැකීමට අවශ්‍ය බව විශ්වාසද?

source: %s a cluster propagates the deletion to other instances and lets you restore it in the future
si_lk: %s පොකුරක් මකාදැමීම වෙනත් අවස්ථාවන්ට ප්‍රචාරණය කරන අතර අනාගතයේදී එය ප්‍රතිසාධනය කිරීමට ඔබට ඉඩ සලසයි

source: %s a cluster permanentaly deletes it and prevents it be created again by blocklisting it
si_lk: %s පොකුරක් එය ස්ථිරවම මකා දමන අතර එය වාරණ ලැයිස්තුගත කිරීමෙන් එය නැවත නිර්මාණය වීම වළක්වයි

source: For default clusters, you can restore the cluster at any time by force updating your galaxies
si_lk: පෙරනිමි පොකුරු සඳහා, ඔබගේ මන්දාකිණි බලහත්කාරයෙන් යාවත්කාලීන කිරීමෙන් ඔබට ඕනෑම වේලාවක පොකුර ප්‍රතිසාධනය කළ හැක

source: Custom
si_lk: අභිරුචි

source: My Clusters
si_lk: මගේ පොකුරු

source: View Fork Tree
si_lk: දෙබලක ගස බලන්න

source: View Galaxy Relationships
si_lk: Galaxy සම්බන්ධතා බලන්න

source: Synonyms
si_lk: සමාන පද

source: #Events
si_lk: #සිදුවීම්

source: #Relations
si_lk: #සබඳතා

source: cluster
si_lk: පොකුර

source: is being targeted by
si_lk: විසින් ඉලක්ක කරනු ලැබේ

source: targets
si_lk: ඉලක්ක

source: Are you sure you want to restore the Galaxy Cluster?
si_lk: ඔබට Galaxy Cluster ප්‍රතිසාධනය කිරීමට අවශ්‍ය බව විශ්වාසද?

source: Are you sure you want to publish the Galaxy Cluster?
si_lk: ඔබට Galaxy Cluster ප්‍රකාශනය කිරීමට අවශ්‍ය බව විශ්වාසද?

source: Publish cluster %s
si_lk: පොකුරු %sප්‍රකාශ කරන්න

source: Unpublish cluster %s
si_lk: පොකුරු %sප්‍රකාශනය ඉවත් කරන්න

source: Are you sure you wish to publish the cluster?
si_lk: ඔබට පොකුර ප්‍රකාශ කිරීමට අවශ්‍ය බව විශ්වාසද?

source: Are you sure you wish to unpublish the cluster?
si_lk: ඔබට පොකුර ප්‍රකාශනය ඉවත් කිරීමට අවශ්‍ය බව විශ්වාසද?

source: Delete Galaxy Cluster Element
si_lk: Galaxy Cluster Element මකන්න

source: galaxy element
si_lk: මන්දාකිනි මූලද්රව්යය

source: Convert JSON into galaxy cluster's elements
si_lk: JSON මන්දාකිණි පොකුරු මූලද්‍රව්‍ය බවට පරිවර්තනය කරන්න

source: Tabular view
si_lk: වගු දර්ශනය

source: JSON view
si_lk: JSON දසුන

source: Add JSON as cluster's elements
si_lk: පොකුරු මූලද්‍රව්‍ය ලෙස JSON එක් කරන්න

source: The provided JSON will be converted into Galaxy Cluster Elements
si_lk: සපයන ලද JSON Galaxy Cluster Elements බවට පරිවර්තනය කෙරේ

source: Start the galaxy matrix picker
si_lk: Galaxy matrix picker ආරම්භ කරන්න

source: Use the picker instead
si_lk: ඒ වෙනුවට පිකර් භාවිතා කරන්න

source: Flag of %s
si_lk: %sකොඩිය

source: Remove pivot
si_lk: හැරීම ඉවත් කරන්න

source: In UTC
si_lk: UTC හි

source: Instance inbox
si_lk: උදාහරණ එන ලිපි

source: You can find messages sent to this instance in the following list. Type denotes the type of request (such as registration). View each entry to see more details about the request's contents.
si_lk: ඔබට මෙම අවස්ථාවට යවන ලද පණිවිඩ පහත ලැයිස්තුවෙන් සොයාගත හැක. වර්ගය යනු ඉල්ලීම් වර්ගය (ලියාපදිංචිය වැනි) දක්වයි. ඉල්ලීමේ අන්තර්ගතය පිළිබඳ වැඩි විස්තර බැලීමට සෑම ප්‍රවේශයක්ම බලන්න.

source: Are you sure you want to delete the message from the inbox?
si_lk: ඔබට එන ලිපි වලින් පණිවිඩය මැකීමට අවශ්‍ය බව විශ්වාසද?

source: Purge job entries:
si_lk: රැකියා ඇතුළත් කිරීම් ඉවත් කරන්න:

source: Are you sure you want to purge all completed job entries? Job entries are considered as log entries and have no impact on actual job execution.
si_lk: සම්පුර්ණ කරන ලද සියලුම රැකියා ඇතුළත් කිරීම් ඉවත් කිරීමට ඔබට අවශ්‍ය බව ඔබට විශ්වාසද? රැකියා ඇතුළත් කිරීම් ලොග් සටහන් ලෙස සලකනු ලබන අතර සැබෑ රැකියා ක්‍රියාත්මක කිරීම කෙරෙහි බලපෑමක් නැත.
