Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: PEhash - a hash calculated based of certain pieces of a PE executable file
si_lk: PEhash - PE ක්‍රියාත්මක කළ හැකි ගොනුවක ඇතැම් කොටස් මත පදනම්ව ගණනය කරන ලද හැෂ් එකක්

source: A fuzzy hash of import table of Portable Executable format
si_lk: අතේ ගෙන යා හැකි ක්‍රියාත්මක කළ හැකි ආකෘතියේ ආයාත වගුවේ නොපැහැදිලි හැෂ් එකක්

source: You are encouraged to use filename|impfuzzy instead. A fuzzy hash created based on the imports in the sample, only use this if you don't know the correct filename
si_lk: ඒ වෙනුවට ගොනු නාමය|impfuzzy භාවිතා කිරීමට ඔබව දිරිමත් කරනු ලැබේ. නියැදියේ ආයාත මත පදනම්ව සාදන ලද නොපැහැදිලි හැෂ් එකක්, ඔබ නිවැරදි ගොනු නාමය නොදන්නේ නම් පමණක් මෙය භාවිතා කරන්න

source: A checksum in sha-224 format
si_lk: sha-224 ආකෘතියෙන් චෙක්සම් එකක්

source: You are encouraged to use filename|sha224 instead. A checksum in sha224 format, only use this if you don't know the correct filename
si_lk: ඒ වෙනුවට ගොනු නාමය|sha224 භාවිතා කිරීමට ඔබව දිරිමත් කරනු ලැබේ. sha224 ආකෘතියෙන් චෙක්සම් එකක්, ඔබ නිවැරදි ගොනු නාමය නොදන්නේ නම් පමණක් මෙය භාවිතා කරන්න

source: A checksum in sha-384 format
si_lk: sha-384 ආකෘතියෙන් චෙක්සම් එකක්

source: You are encouraged to use filename|sha384 instead. A checksum in sha384 format, only use this if you don't know the correct filename
si_lk: ඒ වෙනුවට ගොනු නාමය|sha384 භාවිතා කිරීමට ඔබව දිරිමත් කරනු ලැබේ. sha384 ආකෘතියෙන් චෙක්සම් එකක්, ඔබ නිවැරදි ගොනු නාමය නොදන්නේ නම් පමණක් මෙය භාවිතා කරන්න

source: A checksum in sha-512 format
si_lk: sha-512 ආකෘතියෙන් චෙක්සම් එකක්

source: You are encouraged to use filename|sha512 instead. A checksum in sha512 format, only use this if you don't know the correct filename
si_lk: ඒ වෙනුවට ගොනු නාමය|sha512 භාවිතා කිරීමට ඔබව දිරිමත් කරනු ලැබේ. sha512 ආකෘතියෙන් චෙක්සම් එකක්, ඔබ නිවැරදි ගොනු නාමය නොදන්නේ නම් පමණක් මෙය භාවිතා කරන්න

source: A checksum in the sha-512/224 format
si_lk: sha-512/224 ආකෘතියෙන් චෙක්සම් එකක්

source: You are encouraged to use filename|sha512/224 instead. A checksum in sha512/224 format, only use this if you don't know the correct filename
si_lk: ඒ වෙනුවට ගොනු නාමය|sha512/224 භාවිතා කිරීමට ඔබව දිරිමත් කරනු ලැබේ. sha512/224 ආකෘතියෙන් චෙක්සම් එකක්, ඔබ නිවැරදි ගොනු නාමය නොදන්නේ නම් පමණක් මෙය භාවිතා කරන්න

source: A checksum in the sha-512/256 format
si_lk: sha-512/256 ආකෘතියේ චෙක්සම් එකක්

source: You are encouraged to use filename|sha512/256 instead. A checksum in sha512/256 format, only use this if you don't know the correct filename
si_lk: ඒ වෙනුවට ගොනු නාමය|sha512/256 භාවිතා කිරීමට ඔබව දිරිමත් කරනු ලැබේ. sha512/256 ආකෘතියෙන් චෙක්සම් එකක්, ඔබ නිවැරදි ගොනු නාමය නොදන්නේ නම් පමණක් මෙය භාවිතා කරන්න

source: A checksum in sha3-224 format
si_lk: sha3-224 ආකෘතියෙන් චෙක්සම් එකක්

source: You are encouraged to use filename|sha3-224 instead. A checksum in sha3-224 format, only use this if you don't know the correct filename
si_lk: ඒ වෙනුවට ගොනු නාමය|sha3-224 භාවිතා කිරීමට ඔබව දිරිමත් කරනු ලැබේ. sha3-224 ආකෘතියෙන් චෙක්සම් එකක්, ඔබ නිවැරදි ගොනු නාමය නොදන්නේ නම් පමණක් මෙය භාවිතා කරන්න

source: A checksum in sha3-256 format
si_lk: sha3-256 ආකෘතියෙන් චෙක්සම් එකක්

source: You are encouraged to use filename|sha3-256 instead. A checksum in sha3-256 format, only use this if you don't know the correct filename
si_lk: ඒ වෙනුවට ගොනු නාමය|sha3-256 භාවිතා කිරීමට ඔබව දිරිමත් කරනු ලැබේ. sha3-256 ආකෘතියෙන් චෙක්සම් එකක්, ඔබ නිවැරදි ගොනු නාමය නොදන්නේ නම් පමණක් මෙය භාවිතා කරන්න

source: A checksum in sha3-384 format
si_lk: sha3-384 ආකෘතියෙන් චෙක්සම් එකක්

source: You are encouraged to use filename|sha3-384 instead. A checksum in sha3-384 format, only use this if you don't know the correct filename
si_lk: ඒ වෙනුවට ගොනු නාමය|sha3-384 භාවිතා කිරීමට ඔබව දිරිමත් කරනු ලැබේ. sha3-384 ආකෘතියෙන් චෙක්සම් එකක්, ඔබ නිවැරදි ගොනු නාමය නොදන්නේ නම් පමණක් මෙය භාවිතා කරන්න

source: A checksum in sha3-512 format
si_lk: sha3-512 ආකෘතියෙන් චෙක්සම් එකක්

source: You are encouraged to use filename|sha3-512 instead. A checksum in sha3-512 format, only use this if you don't know the correct filename
si_lk: ඒ වෙනුවට ගොනු නාමය|sha3-512 භාවිතා කිරීමට ඔබව දිරිමත් කරනු ලැබේ. sha3-512 ආකෘතියෙන් චෙක්සම් එකක්, ඔබ නිවැරදි ගොනු නාමය නොදන්නේ නම් පමණක් මෙය භාවිතා කරන්න

source: A checksum in the Trend Micro Locality Sensitive Hash format
si_lk: Trend Micro Locality sensitive Hash ආකෘතියේ චෙක්සම් එකක්

source: You are encouraged to use filename|tlsh instead. A checksum in the Trend Micro Locality Sensitive Hash format, only use this if you don't know the correct filename
si_lk: ඒ වෙනුවට ගොනු නාමය|tlsh භාවිතා කිරීමට ඔබව දිරිමත් කරනු ලැබේ. Trend Micro Locality sensitive Hash ආකෘතියේ චෙක්සම් එකක්, ඔබ නිවැරදි ගොනු නාමය නොදන්නේ නම් පමණක් මෙය භාවිතා කරන්න

source: An Apple Code Directory Hash, identifying a code-signed Mach-O executable file
si_lk: Apple Code Directory Hash, කේත-අත්සන් කළ Mach-O ක්‍රියාත්මක කළ හැකි ගොනුවක් හඳුනා ගැනීම

source: A filename and a VirusTotal hash separated by a |
si_lk: ගොනු නාමයක් සහ VirusTotal හෑෂ් එකක් |

source: Import fuzzy hash - a fuzzy hash created based on the imports in the sample.
si_lk: අපැහැදිලි හැෂ් ආයාත කරන්න - නියැදියේ ආයාත මත පදනම්ව සාදන ලද නොපැහැදිලි හැෂ්.

source: A filename and a PEhash separated by a |
si_lk: ගොනු නාමයක් සහ PEhash එකක් |

source: A filename and a sha-224 hash separated by a |
si_lk: ගොනු නාමයක් සහ sha-224 හෑෂ් එකක් |

source: A filename and a sha-384 hash separated by a |
si_lk: ගොනු නාමයක් සහ sha-384 හෑෂ් එකක් |

source: A filename and a sha-512 hash separated by a |
si_lk: ගොනු නාමයක් සහ sha-512 හෑෂ් එකක් |

source: A filename and a sha-512/224 hash separated by a |
si_lk: ගොනු නාමයක් සහ sha-512/224 හෑෂ් එකක් |

source: A filename and a sha-512/256 hash separated by a |
si_lk: ගොනු නාමයක් සහ sha-512/256 හෑෂ් එකක් |

source: A filename and an sha3-224 hash separated by a |
si_lk: ගොනු නාමයක් සහ sha3-224 හෑෂ් එකක් |

source: A filename and an sha3-256 hash separated by a |
si_lk: ගොනු නාමයක් සහ sha3-256 හෑෂ් එකක් |

source: A filename and an sha3-384 hash separated by a |
si_lk: ගොනු නාමයක් සහ sha3-384 හෑෂ් එකක් |

source: A filename and an sha3-512 hash separated by a |
si_lk: ගොනු නාමයක් සහ sha3-512 හෑෂ් එකක් |

source: A filename and a Trend Micro Locality Sensitive Hash separated by a |
si_lk: ගොනු නාමයක් සහ Trend Micro Locality සංවේදී Hash එකක් |

source: A scheduled task in windows
si_lk: windows වල නියමිත කාර්යයක්

source: A windows service name. This is the name used internally by windows. Not to be confused with the windows-service-displayname.
si_lk: වින්ඩෝස් සේවා නාමයක්. windows මගින් අභ්‍යන්තරව භාවිතා කරන නම මෙයයි. windows-service-displayname සමඟ පටලවා නොගත යුතුය.

source: A windows service's displayname, not to be confused with the windows-service-name. This is the name that applications will generally display as the service's name in applications.
si_lk: windows සේවාවක සංදර්ශක නාමය, windows-service-name සමඟ පටලවා නොගත යුතුය. යෙදුම්වල සේවා නාමය ලෙස යෙදුම් සාමාන්‍යයෙන් සංදර්ශන කරන නම මෙයයි.

source: The e-mail of a domain's registrant, obtained from the WHOIS information.
si_lk: WHOIS තොරතුරු වලින් ලබාගත් වසමක ලියාපදිංචිකරුවෙකුගේ විද්‍යුත් තැපෑල.

source: The phone number of a domain's registrant, obtained from the WHOIS information.
si_lk: WHOIS තොරතුරු වලින් ලබාගත් වසමක ලියාපදිංචිකරුවෙකුගේ දුරකථන අංකය.

source: The name of a domain's registrant, obtained from the WHOIS information.
si_lk: WHOIS තොරතුරු වලින් ලබාගත් වසමක ලියාපදිංචිකරුවෙකුගේ නම.

source: The org of a domain's registrant, obtained from the WHOIS information.
si_lk: WHOIS තොරතුරු වලින් ලබාගත් වසමක ලියාපදිංචිකරුවෙකුගේ org.

source: The registrar of the domain, obtained from the WHOIS information.
si_lk: WHOIS තොරතුරු වලින් ලබාගත් වසමේ රෙජිස්ට්‍රාර්.

source: The date of domain's creation, obtained from the WHOIS information.
si_lk: WHOIS තොරතුරු වලින් ලබාගත් වසම නිර්මාණය කළ දිනය.

source: X509 fingerprint in SHA-1 format
si_lk: X509 ඇඟිලි සලකුණ SHA-1 ආකෘතියෙන්

source: X509 fingerprint in MD5 format
si_lk: X509 ඇඟිලි සලකුණ MD5 ආකෘතියෙන්

source: X509 fingerprint in SHA-256 format
si_lk: X509 ඇඟිලි සලකුණ SHA-256 ආකෘතියෙන්

source: RFC1035 mandates that DNS zones should have a SOA (Statement Of Authority) record that contains an email address where a PoC for the domain could be contacted. This can sometimes be used for attribution/linkage between different domains even if protected by whois privacy
si_lk: RFC1035 විසින් DNS කලාපවලට වසම සඳහා PoC සම්බන්ධ කර ගත හැකි විද්‍යුත් තැපැල් ලිපිනයක් අඩංගු SOA (අධිකාරී ප්‍රකාශය) වාර්තාවක් තිබිය යුතුය. හූස් පෞද්ගලිකත්වය මගින් ආරක්‍ෂා කළද විවිධ වසම් අතර ආරෝපණය/සබැඳිය සඳහා මෙය ඇතැම් විට භාවිත කළ හැක.

source: Size expressed in bytes
si_lk: බයිට් වලින් ප්‍රකාශිත ප්‍රමාණය

source: An integer counter, generally to be used in objects
si_lk: නිඛිල කවුන්ටරයක්, සාමාන්‍යයෙන් වස්තු වල භාවිතා කිරීමට

source: Datetime in the ISO 8601 format
si_lk: ISO 8601 ආකෘතියේ දින කාලය

source: Port number
si_lk: වරාය අංකය

source: IP destination and port number separated by a |
si_lk: IP ගමනාන්තය සහ තොට අංකය a |

source: IP source and port number separated by a |
si_lk: IP මූලාශ්‍රය සහ තොට අංකය a |

source: Hostname and port number separated by a |
si_lk: ධාරක නාමය සහ තොට අංකය a මගින් වෙන් කර ඇත

source: Mac address
si_lk: මැක් ලිපිනය

source: Mac EUI-64 address
si_lk: Mac EUI-64 ලිපිනය

source: Email destination display name
si_lk: ඊමේල් ගමනාන්ත සංදර්ශක නම

source: Email source display name
si_lk: ඊමේල් මූලාශ්‍ර සංදර්ශක නම

source: Email header
si_lk: ඊමේල් ශීර්ෂකය

source: Email reply to header
si_lk: ශීර්ෂයට ඊමේල් පිළිතුර

source: Email x-mailer header
si_lk: ඊමේල් x-mailer ශීර්ෂකය

source: The email mime boundary separating parts in a multipart email
si_lk: බහුපාර්ශ්වික විද්‍යුත් තැපෑලක කොටස් වෙන් කරන ඊමේල් මයිම් සීමාව

source: The email thread index header
si_lk: ඊමේල් නූල් දර්ශක ශීර්ෂකය

source: The email message ID
si_lk: ඊමේල් පණිවිඩ හැඳුනුම්පත

source: A github user name
si_lk: github පරිශීලක නාමයක්

source: A github repository
si_lk: github ගබඩාවක්

source: A github organisation
si_lk: Github සංවිධානයකි

source: DKIM public key
si_lk: DKIM පොදු යතුර

source: DKIM signature
si_lk: DKIM අත්සන

source: First name of a natural person
si_lk: ස්වාභාවික පුද්ගලයෙකුගේ මුල් නම

source: Middle name of a natural person
si_lk: ස්වාභාවික පුද්ගලයෙකුගේ මැද නම

source: Last name of a natural person
si_lk: ස්වාභාවික පුද්ගලයෙකුගේ අවසාන නම

source: Full name of a natural person
si_lk: ස්වාභාවික පුද්ගලයෙකුගේ සම්පූර්ණ නම

source: Date of birth of a natural person (in YYYY-MM-DD format)
si_lk: ස්වභාවික පුද්ගලයෙකුගේ උපන් දිනය (YYYY-MM-DD ආකෘතියෙන්)

source: Place of birth of a natural person
si_lk: ස්වාභාවික පුද්ගලයෙකුගේ උපන් ස්ථානය

source: The gender of a natural person (Male, Female, Other, Prefer not to say)
si_lk: ස්වාභාවික පුද්ගලයෙකුගේ ලිංගභේදය (පිරිමි, ගැහැණු, වෙනත්, නොකියන්න කැමති)

source: The passport number of a natural person
si_lk: ස්වභාවික පුද්ගලයෙකුගේ ගමන් බලපත්ර අංකය

source: The country in which the passport was issued
si_lk: විදේශ ගමන් බලපත්‍රය නිකුත් කළ රට

source: The expiration date of a passport
si_lk: විදේශ ගමන් බලපත්‍රයක කල් ඉකුත්වන දිනය

source: The Redress Control Number is the record identifier for people who apply for redress through the DHS Travel Redress Inquiry Program (DHS TRIP). DHS TRIP is for travelers who have been repeatedly identified for additional screening and who want to file an inquiry to have erroneous information corrected in DHS systems
si_lk: Redress Control Number යනු DHS Travel Redress Inquiry Program (DHS TRIP) හරහා සහන සඳහා අයදුම් කරන පුද්ගලයින් සඳහා වාර්තා හඳුනාගැනීමයි. DHS TRIP යනු අමතර පිරික්සීම සඳහා නැවත නැවතත් හඳුනාගෙන ඇති සහ DHS පද්ධතිවල වැරදි තොරතුරු නිවැරදි කිරීම සඳහා පරීක්ෂණයක් ගොනු කිරීමට අවශ්‍ය සංචාරකයින් සඳහා ය.

source: The nationality of a natural person
si_lk: ස්වාභාවික පුද්ගලයෙකුගේ ජාතිකත්වය

source: Visa number
si_lk: වීසා අංකය

source: The date on which the visa was issued
si_lk: වීසා නිකුත් කළ දිනය

source: The primary residence of a natural person
si_lk: ස්වාභාවික පුද්ගලයෙකුගේ මූලික වාසස්ථානය

source: The country of residence of a natural person
si_lk: ස්වාභාවික පුද්ගලයෙකුගේ පදිංචි රට

source: A Special Service Request is a function to an airline to provide a particular facility for A Passenger or passengers.
si_lk: විශේෂ සේවා ඉල්ලීමක් යනු මගියෙකුට හෝ මගීන්ට විශේෂිත පහසුකමක් සැපයීම සඳහා ගුවන් සමාගමකට සිදු කෙරෙන කාර්යයකි.

source: The frequent flyer number of a passenger
si_lk: මගියෙකුගේ නිතර පියාසර කරන අංකය

source: Travel details
si_lk: ගමන් විස්තර

source: Payment details
si_lk: ගෙවීම් තොරතුරු

source: The original port of embarkation
si_lk: නැව්ගත කිරීමේ මුල් වරාය

source: The port of clearance
si_lk: නිෂ්කාශන වරාය

source: A Port where the passenger is transiting to
si_lk: මගියා සංක්‍රමණය වන වරායකි

source: The Passenger Name Record Locator is a key under which the reservation for a trip is stored in the system. The PNR contains, among other data, the name, flight segments and address of the passenger. It is defined by a combination of five or six letters and numbers.
si_lk: මගී නාම ලේඛන ස්ථානගත කිරීම යනු සංචාරයක් සඳහා වෙන් කිරීම පද්ධතිය තුළ ගබඩා කර ඇති යතුරකි. PNR හි අනෙකුත් දත්ත අතර, මගියාගේ නම, පියාසැරි කොටස් සහ ලිපිනය අඩංගු වේ. එය අකුරු පහක් හෝ හයක් සහ ඉලක්කම් එකතුවකින් අර්ථ දක්වා ඇත.

source: The application id of a mobile application
si_lk: ජංගම යෙදුමක යෙදුම් හැඳුනුම්පත

source: Chrome extension id
si_lk: Chrome දිගු id

source: Cortex analysis result
si_lk: Cortex විශ්ලේෂණය ප්රතිඵලය

source: Boolean value - to be used in objects
si_lk: බූලියන් අගය - වස්තූන් තුළ භාවිතා කිරීමට

source: Anonymised value - described with the anonymisation object via a relationship
si_lk: නිර්නාමික අගය - සම්බන්ධතාවයක් හරහා නිර්නාමික කිරීමේ වස්තුව සමඟ විස්තර කෙරේ

source: Anonymised value - described with the anonymisation object via a relationship.
si_lk: නිර්නාමික අගය - සම්බන්ධතාවයක් හරහා නිර්නාමික කිරීමේ වස්තුව සමඟ විස්තර කෙරේ.

source: local
si_lk: දේශීය

source: global
si_lk: ගෝලීය

source: Attached %s tag "%s" to %s #%s
si_lk: %s ටැගය "%s" %s #%sවෙත අමුණා ඇත

source: Detached %s tag "%s" from %s #%s
si_lk: %s #%sවෙතින් "%s" ටැගය %s වෙන් කරන ලදී

source: Attached %s galaxy cluster "%s" to %s #%s
si_lk: %s මන්දාකිණි පොකුර "%s" සිට %s #%sදක්වා අමුණා ඇත

source: Detached %s galaxy cluster "%s" from %s #%s
si_lk: %s මන්දාකිණි පොකුර "%s" %s #%sවෙතින් වෙන් කරන ලදී

source: %s from Event #%s
si_lk: සිදුවීම් #%sවෙතින් %s

source: Expiration must be in YYYY-MM-DD format.
si_lk: කල් ඉකුත්වීම YYYY-MM-DD ආකෘතියෙන් විය යුතුය.

source: Maximal key validity is %s days.
si_lk: උපරිම යතුරු වලංගු කාලය දින %s කි.

source: Created by resetting auth key %s %s
si_lk: auth යතුර %s %sනැවත සැකසීමෙන් සාදන ලදී

source: Something went wrong. Error returned: %s
si_lk: මොකක්හරි වැරැද්දක් වෙලා. දෝෂය ආපසු: %s

source: Authentication failed.
si_lk: සත්‍යාපනය අසාර්ථක විය.

source: Something went wrong with the request or the remote side is having issues.
si_lk: ඉල්ලීම සමඟ යම් දෙයක් වැරදී ඇත හෝ දුරස්ථ පැත්තේ ගැටලු තිබේ.

source: The organisation could not be saved.
si_lk: සංවිධානය සුරැකීමට නොහැකි විය.

source: The retrieved data isn't a valid organisation.
si_lk: ලබාගත් දත්ත වලංගු සංවිධානයක් නොවේ.

source: The retrieved data isn't a valid sharing group.
si_lk: ලබාගත් දත්ත වලංගු බෙදාගැනීමේ කණ්ඩායමක් නොවේ.

source: Default community list not found.
si_lk: පෙරනිමි ප්‍රජා ලැයිස්තුව හමු නොවීය.

source: Default community list empty.
si_lk: පෙරනිමි ප්‍රජා ලැයිස්තුව හිස්.

source: Default community list not in the expected format.
si_lk: පෙරනිමි ප්‍රජා ලැයිස්තුව අපේක්ෂිත ආකෘතියේ නැත.

source: Community not found.
si_lk: ප්‍රජාව හමු නොවීය.

source: Correlating Attributes based on value. %s attributes correlated out of %s.
si_lk: වටිනාකම මත පදනම් වූ ගුණාංග සහසම්බන්ධ කිරීම. %s ගුණාංග %sන් සහසම්බන්ධයි.

source: No redis connection found.
si_lk: redis සම්බන්ධතාවයක් හමු නොවීය.

source: Generating top correlations. Processed %s IDs.
si_lk: ඉහළ සහසම්බන්ධතා උත්පාදනය කිරීම. %s ID සකසන ලදී.

source: Cleaning up excluded correlations.
si_lk: බැහැර කළ සහසම්බන්ධතා පිරිසිදු කිරීම.

source: Invalid widget or widget not found.
si_lk: අවලංගු විජට් හෝ විජට් හමු නොවීය.

source: Models could not be loaded or default decaying models folder is empty
si_lk: මාදිලි පූරණය කළ නොහැකි විය හෝ පෙරනිමි දිරාපත් වන ආකෘති ෆෝල්ඩරය හිස් ය

source: No tags nor predicates with `numerical_value`
si_lk: `සංඛ්‍යාත්මක_අගය` සමඟ ටැග් හෝ පුරෝකථන නැත

source: No predicate
si_lk: පුරෝකථනයක් නැත

source: The class for `%s` was not found or not loaded correctly
si_lk: `%s` සඳහා වන පන්තිය හමු නොවීය හෝ නිවැරදිව පූරණය නොවීය

source: Click this to download all events and attributes that you have access to in MISP JSON format.
si_lk: MISP JSON ආකෘතියෙන් ඔබට ප්‍රවේශය ඇති සියලුම සිදුවීම් සහ උපලක්ෂණ බාගැනීමට මෙය ක්ලික් කරන්න.

source: Click this to download all events and attributes that you have access to in MISP XML format.
si_lk: MISP XML ආකෘතියෙන් ඔබට ප්‍රවේශය ඇති සියලුම සිදුවීම් සහ ගුණාංග බාගත කිරීමට මෙය ක්ලික් කරන්න.

source: Click this to download all attributes that are indicators and that you have access to (except file attachments) in CSV format.
si_lk: දර්ශක වන සහ ඔබට (ගොනු ඇමුණුම් හැර) CSV ආකෘතියෙන් ප්‍රවේශය ඇති සියලුම උපලක්ෂණ බාගැනීමට මෙය ක්ලික් කරන්න.

source: Click this to download all attributes that you have access to (except file attachments) in CSV format.
si_lk: ඔබට ප්‍රවේශය ඇති සියලුම උපලක්ෂණ (ගොනු ඇමුණුම් හැර) CSV ආකෘතියෙන් බාගැනීමට මෙය ක්ලික් කරන්න.

source: Click this to download all network related attributes that you have access to under the Suricata rule format. Only published events and attributes marked as IDS Signature are exported. Administration is able to maintain a allowedlist containing host, domain name and IP numbers to exclude from the NIDS export.
si_lk: Suricata රීති ආකෘතිය යටතේ ඔබට ප්‍රවේශය ඇති සියලුම ජාල ආශ්‍රිත උපලක්ෂණ බාගැනීමට මෙය ක්ලික් කරන්න. IDS අත්සන ලෙස සලකුණු කර ඇති ප්‍රකාශිත සිදුවීම් සහ ගුණාංග පමණක් අපනයනය කෙරේ. NIDS අපනයනයෙන් බැහැර කිරීම සඳහා සත්කාරක, වසම් නාමය සහ IP අංක අඩංගු අවසර ලැයිස්තුවක් පවත්වාගෙන යාමට පරිපාලනයට හැකිය.

source: Click this to download all network related attributes that you have access to under the Snort rule format. Only published events and attributes marked as IDS Signature are exported. Administration is able to maintain a allowedlist containing host, domain name and IP numbers to exclude from the NIDS export.
si_lk: Snort රීති ආකෘතිය යටතේ ඔබට ප්‍රවේශය ඇති සියලුම ජාල ආශ්‍රිත උපලක්ෂණ බාගැනීමට මෙය ක්ලික් කරන්න. IDS අත්සන ලෙස සලකුණු කර ඇති ප්‍රකාශිත සිදුවීම් සහ ගුණාංග පමණක් අපනයනය කෙරේ. NIDS අපනයනයෙන් බැහැර කිරීම සඳහා සත්කාරක, වසම් නාමය සහ IP අංක අඩංගු අවසර ලැයිස්තුවක් පවත්වාගෙන යාමට පරිපාලනයට හැකිය.

source: Click this to download all network related attributes that you have access to under the Bro rule format. Only published events and attributes marked as IDS Signature are exported. Administration is able to maintain a allowedlist containing host, domain name and IP numbers to exclude from the NIDS export.
si_lk: Bro රීති ආකෘතිය යටතේ ඔබට ප්‍රවේශය ඇති සියලුම ජාල සම්බන්ධ උපලක්ෂණ බාගැනීමට මෙය ක්ලික් කරන්න. IDS අත්සන ලෙස සලකුණු කර ඇති ප්‍රකාශිත සිදුවීම් සහ ගුණාංග පමණක් අපනයනය කෙරේ. NIDS අපනයනයෙන් බැහැර කිරීම සඳහා සත්කාරක, වසම් නාමය සහ IP අංක අඩංගු අවසර ලැයිස්තුවක් පවත්වාගෙන යාමට පරිපාලනයට හැකිය.

source: Click this to download a STIX document containing the STIX version of all events and attributes that you have access to.
si_lk: ඔබට ප්‍රවේශය ඇති සියලුම සිදුවීම් සහ ගුණාංගවල STIX අනුවාදය අඩංගු STIX ලේඛනයක් බාගැනීමට මෙය ක්ලික් කරන්න.

source: Click this to download a STIX2 document containing the STIX2 version of all events and attributes that you have access to.
si_lk: ඔබට ප්‍රවේශය ඇති සියලුම සිදුවීම් සහ ගුණාංගවල STIX2 අනුවාදය අඩංගු STIX2 ලේඛනයක් බාගත කිරීමට මෙය ක්ලික් කරන්න.

source: Click this to download an RPZ Zone file generated from all ip-src/ip-dst, hostname, domain attributes. This can be useful for DNS level firewalling. Only published events and attributes marked as IDS Signature are exported.
si_lk: සියලුම ip-src/ip-dst, hostname, domain attributes වලින් ජනනය කරන ලද RPZ Zone ගොනුවක් බාගැනීමට මෙය ක්ලික් කරන්න. මෙය DNS මට්ටමේ ෆයර්වෝලින් සඳහා ප්‍රයෝජනවත් විය හැක. IDS අත්සන ලෙස සලකුණු කර ඇති ප්‍රකාශිත සිදුවීම් සහ ගුණාංග පමණක් අපනයනය කෙරේ.

source: Click on one of the buttons below to download all the attributes with the matching type. This list can be used to feed forensic software when searching for susipicious files. Only published events and attributes marked as IDS Signature are exported.
si_lk: ගැලපෙන ආකාරයේ සියලු ගුණාංග බාගත කිරීමට පහත බොත්තම් වලින් එකක් ක්ලික් කරන්න. සැක සහිත ගොනු සෙවීමේදී අධිකරණ වෛද්‍ය මෘදුකාංගය පෝෂණය කිරීමට මෙම ලැයිස්තුව භාවිතා කළ හැක. IDS අත්සන ලෙස සලකුණු කර ඇති ප්‍රකාශිත සිදුවීම් සහ ගුණාංග පමණක් අපනයනය කෙරේ.

source: Click this to download Yara rules generated from all relevant attributes.
si_lk: සියලුම අදාළ උපලක්ෂණ වලින් උත්පාදනය කරන ලද Yara රීති බාගත කිරීමට මෙය ක්ලික් කරන්න.

source: Click this to download Yara rules generated from all relevant attributes. Rules are returned in a JSON format with information about origin (generated or parsed) and validity.
si_lk: සියලුම අදාළ උපලක්ෂණ වලින් උත්පාදනය කරන ලද Yara රීති බාගත කිරීමට මෙය ක්ලික් කරන්න. මූලාරම්භය (උත්පාදනය කරන ලද හෝ විග්‍රහ කරන ලද) සහ වලංගුභාවය පිළිබඳ තොරතුරු සහිත JSON ආකෘතියකින් නීති ආපසු ලබා දෙනු ලැබේ.

source: Automatically blocked by deleting event
si_lk: සිදුවීම මැකීමෙන් ස්වයංක්‍රීයව අවහිර කර ඇත

source: Remote version does not support event report.
si_lk: දුරස්ථ අනුවාදය සිදුවීම් වාර්තාවට සහය නොදක්වයි.

source: E-mail alerts not sent out during publishing
si_lk: ප්‍රකාශනය අතරතුර විද්‍යුත් තැපෑල දැනුම්දීම් යවා නැත

source: Mails blocked by org alert threshold.
si_lk: org අනතුරු ඇඟවීමේ සීමාව මගින් තැපැල් අවහිර කර ඇත.

source: Mails sent.
si_lk: තැපැල් යවා ඇත.

source: This is not a valid MISP XML file.
si_lk: මෙය වලංගු MISP XML ගොනුවක් නොවේ.

source: This is not a valid MISP JSON file.
si_lk: මෙය වලංගු MISP JSON ගොනුවක් නොවේ.

source: Publishing sightings.
si_lk: දර්ශන පළ කිරීම.

source: Publishing %s sightings.
si_lk: දර්ශන %s ක් ප්‍රකාශනය කරමින්.

source: Event with the same UUID already exists.
si_lk: එකම UUID සමඟ සිදුවීම දැනටමත් පවතී.

source: Issues while loading the stix file.
si_lk: stix ගොනුව පූරණය කිරීමේදී ගැටළු.

source: Issues with the maec library.
si_lk: maec පුස්තකාලය සමඟ ගැටළු.

source: Issues executing the ingestion script or invalid input.
si_lk: ඇතුළත් කිරීමේ ස්ක්‍රිප්ට් හෝ වලංගු නොවන ආදානය ක්‍රියාත්මක කිරීමේ ගැටළු.

source: Please ask your administrator to
si_lk: කරුණාකර ඔබගේ පරිපාලකගෙන් විමසන්න

source: Please
si_lk: කරුණාකර

source: check whether the dependencies for STIX are met via the diagnostic tool.
si_lk: රෝග විනිශ්චය මෙවලම හරහා STIX සඳහා පරායත්තතා සපුරා ඇත්දැයි පරීක්ෂා කරන්න.

source: %s not set
si_lk: %s සකසා නැත

source: Could not add tags.
si_lk: ටැග් එක් කිරීමට නොහැකි විය.

source: Processing complete. %s
si_lk: සැකසීම සම්පූර්ණයි. %s

source: %s from another event
si_lk: වෙනත් සිදුවීමකින් %s

source: Event publish is not banned
si_lk: සිදුවීම් ප්‍රකාශනය තහනම් නොවේ

source: Reason: Could not reach redis to check republish emailing ban status.
si_lk: හේතුව: නැවත ප්‍රකාශන ඊමේල් තහනම් තත්ත්වය පරීක්ෂා කිරීමට redis වෙත ළඟා විය නොහැකි විය.

source: Reason: Event is banned from sending out emails. Ban has been refreshed and will be lifted in %smin
si_lk: හේතුව: ඊමේල් යැවීමෙන් සිද්ධිය තහනම් කර ඇත. තහනම නැවුම් කර ඇති අතර මිනිත්තු %sකින් ඉවත් කරනු ලැබේ

source: Reason: Event is banned from sending out emails. Ban will be lifted in %smin %ssec.
si_lk: හේතුව: ඊමේල් යැවීමෙන් සිද්ධිය තහනම් කර ඇත. තහනම විනාඩි %sතත්පර %sකින් ඉවත් කෙරේ.

source: Emailing republishing ban setting is not enabled
si_lk: විද්‍යුත් තැපෑල නැවත ප්‍රකාශන තහනම් සැකසීම සබල කර නැත

source: Event Report dropped due to validation for Event report %s failed: %s
si_lk: සිදුවීම් වාර්තාව %s සඳහා වලංගු කිරීම හේතුවෙන් සිදුවීම් වාර්තාව පහත වැටුණි: %s

source: Validation errors: %s.%sFull report: %s
si_lk: වලංගු කිරීමේ දෝෂ: %s.%sසම්පූර්ණ වාර්තාව: %s
