Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: Background Processing
si_lk: පසුබිම සැකසීම

source: FAQ
si_lk: නිති අසන පැණ

source: Categories and Types
si_lk: වර්ග සහ වර්ග

source: Server settings and diagnostics
si_lk: සේවාදායක සැකසුම් සහ රෝග විනිශ්චය

source: Since version 2.3, MISP has a settings and diagnostics tool that allows site-admins to manage and diagnose their MISP installation. You can access this by navigating to Administration - Server settings
si_lk: 2.3 අනුවාදයේ සිට, MISP හි සැකසුම් සහ රෝග විනිශ්චය මෙවලමක් ඇති අතර එමඟින් අඩවි පරිපාලකයින්ට ඔවුන්ගේ MISP ස්ථාපනය කළමනාකරණය කිරීමට සහ රෝග විනිශ්චය කිරීමට ඉඩ සලසයි. පරිපාලනය - සේවාදායක සැකසුම් වෙත යාමෙන් ඔබට මෙයට ප්‍රවේශ විය හැක

source: Server settings overview with all of the tabs explained.
si_lk: විස්තර කර ඇති සියලුම ටැබ් සමඟ සේවාදායක සැකසුම් දළ විශ්ලේෂණය.

source: The settings and diagnostics tool is split up into several aspects, all accessible via the tabs on top of the tool. For any unset or incorrectly set setting, or failed diagnostic a number next to the tab name will indicate the number and severity of the issues. If the number is written with a red font, it means that the issue is critical. First, let's look at the various tabs
si_lk: සැකසීම් සහ රෝග විනිශ්චය මෙවලම අංශ කිහිපයකට බෙදා ඇත, සියල්ල මෙවලමට ඉහළින් ඇති ටැබ් හරහා ප්‍රවේශ විය හැකිය. සකස් නොකළ හෝ වැරදි ලෙස සකසා ඇති සැකසීමක් හෝ අසාර්ථක වූ රෝග විනිශ්චයක් සඳහා ටැබ් නමට යාබද අංකයක් ගැටළු වල අංකය සහ බරපතලකම දක්වයි. අංකය රතු අකුරකින් ලියා තිබේ නම්, එයින් අදහස් වන්නේ ගැටළුව තීරනාත්මක බවයි. පළමුව, අපි විවිධ ටැබ් දෙස බලමු

source: General overview of the current state of your MISP installation
si_lk: ඔබගේ MISP ස්ථාපනයෙහි වත්මන් තත්ත්වය පිළිබඳ සාමාන්‍ය දළ විශ්ලේෂණය

source: MISP settings
si_lk: MISP සැකසුම්

source: Basic MISP settings. This includes the way MISP handles the default settings for distribution settings, whether background jobs are enabled, etc
si_lk: මූලික MISP සැකසුම්. MISP බෙදා හැරීමේ සැකසුම් සඳහා පෙරනිමි සැකසුම් හසුරුවන ආකාරය, පසුබිම් රැකියා සක්‍රීය කර තිබේද, ආදිය මෙයට ඇතුළත් වේ.

source: GnuPG settings
si_lk: GnuPG සැකසුම්

source: GnuPG related settings.
si_lk: GnuPG සම්බන්ධ සැකසුම්.

source: HTTP proxy related settings.
si_lk: HTTP ප්‍රොක්සි සම්බන්ධ සැකසුම්.

source: Security settings
si_lk: ආරක්ෂක සැකසුම්

source: Settings controlling the brute-force protection and the application's salt key.
si_lk: බෲට්-ෆෝස් ආරක්ෂණය සහ යෙදුමේ ලුණු යතුර පාලනය කරන සැකසීම්.

source: Misc settings
si_lk: විවිධ සැකසුම්

source: You change the debug options here, but make sure that debug is always disabled on a production system.
si_lk: ඔබ මෙහි දෝශ නිරාකරණ විකල්ප වෙනස් කරයි, නමුත් නිෂ්පාදන පද්ධතියක නිදොස් කිරීම සැමවිටම අක්‍රිය කර ඇති බවට වග බලා ගන්න.

source: The diagnostics tool checks if all directories that MISP uses to store data are writeable by the apache user. Also, the tool checks whether the STIX libraries and GnuPG are working as intended.
si_lk: දත්ත ගබඩා කිරීමට MISP භාවිතා කරන සියලුම නාමාවලි apache පරිශීලකයාට ලිවිය හැකිදැයි රෝග විනිශ්චය මෙවලම පරීක්ෂා කරයි. එසේම, මෙවලම STIX පුස්තකාල සහ GnuPG අපේක්ෂිත පරිදි ක්‍රියා කරන්නේ දැයි පරීක්ෂා කරයි.

source: Shows the background workers (if enabled) and shows a warning if they are not running. Admins can also restart the workers here.
si_lk: පසුබිම් සේවකයින් (සක්‍රීය කර ඇත්නම්) පෙන්වන අතර ඔවුන් ක්‍රියාත්මක නොවන්නේ නම් අනතුරු ඇඟවීමක් පෙන්වයි. ඇඩ්මින්වරුන්ටත් මෙහි වැඩකරුවන් නැවත ආරම්භ කළ හැක.

source: Download a report in JSON format, compiled of all of the settings visible in the tool.
si_lk: JSON ආකෘතියෙන් වාර්තාවක් බාගන්න, මෙවලමෙහි පෙනෙන සියලු සැකසුම් වලින් සම්පාදනය කරන්න.

source: The settings tabs explained.
si_lk: සැකසුම් ටැබ් පැහැදිලි කර ඇත.

source: Each of the setting pages is a table with each row representing a setting. Coloured rows indicate that the setting is incorrect / not set and the colour determines the severity (red = critical, yellow = recommended, green = optional). The columns are as follows
si_lk: එක් එක් සැකසීම් පිටු සෑම පේළියක්ම සැකසුම නියෝජනය කරන වගුවකි. වර්ණ පේළි මඟින් සැකසුම වැරදි / සකසා නොමැති බව පෙන්නුම් කරන අතර වර්ණය බරපතලකම තීරණය කරයි (රතු = විවේචනාත්මක, කහ = නිර්දේශිත, කොළ = විකල්ප). තීරු පහත පරිදි වේ

source: The severity of the setting.
si_lk: සැකසීමේ බරපතලකම.

source: The setting name.
si_lk: සැකසීමේ නම.

source: The current value of the setting.
si_lk: සැකසීමේ වත්මන් අගය.

source: A description of what the setting does.
si_lk: සැකසුම කරන්නේ කුමක්ද යන්න පිළිබඳ විස්තරයක්.

source: If the setting is incorrect / not set, then this field will let the user know what is wrong.
si_lk: සැකසුම වැරදියි / සකසා නොමැති නම්, මෙම ක්ෂේත්‍රය පරිශීලකයාට වැරදි දේ දැන ගැනීමට සලස්වයි.

source: The workers tab.
si_lk: කම්කරු ටැබ්.

source: The workers tab shows a list of the workers that MISP can use. You can restart the workers using the restart all workers, If the button doesn't work, make sure that the workers were started using the apache user. This can however only be done using the command line, refer to the INSTALL.txt documentation on how to let the workers automatically start on each boot.
si_lk: කම්කරු ටැබය MISP භාවිතා කළ හැකි කම්කරුවන් ලැයිස්තුවක් පෙන්වයි. සියලුම කම්කරුවන් නැවත ආරම්භ කිරීම භාවිතයෙන් ඔබට කම්කරුවන් නැවත ආරම්භ කළ හැකිය, බොත්තම ක්‍රියා නොකරන්නේ නම්, කම්කරුවන් apache පරිශීලකයා භාවිතයෙන් ආරම්භ කර ඇති බවට වග බලා ගන්න. කෙසේ වෙතත් මෙය සිදු කළ හැක්කේ විධාන රේඛාව භාවිතයෙන් පමණි, එක් එක් ඇරඹුම් වලදී සේවකයින්ට ස්වයංක්‍රීයව ආරම්භ කිරීමට ඉඩ දෙන්නේ කෙසේද යන්න පිළිබඳ INSTALL.txt ලේඛන බලන්න.

source: Worker Type
si_lk: සේවක වර්ගය

source: The worker type is determined by the queue it monitors. MISP currently has 5 queues (cache, default, prio, email and a special _schdlr_ queue).
si_lk: සේවක වර්ගය තීරණය වන්නේ එය නිරීක්ෂණය කරන පෝලිම මගිනි. MISP සතුව දැනට පෝලිම් 5ක් ඇත (හැඹිලිය, පෙරනිමිය, prio, ඊමේල් සහ විශේෂ _schdlr_ පෝලිමක්).

source: Worker Id
si_lk: සේවක හැඳුනුම්පත

source: The ID is made up of the machine name, the PID of the worker and the queue it monitors.
si_lk: හැඳුනුම්පත සෑදී ඇත්තේ යන්ත්‍රයේ නම, සේවකයාගේ PID සහ එය නිරීක්ෂණය කරන පෝලිමේ ය.

source: Displays OK if the worker is running. If the _schdlr_ worker is the only one not running make sure that you copy the config file into the cakeresque directory as described in the INSTALL.txt documentation.
si_lk: සේවකයා ධාවනය කරන්නේ නම් OK පෙන්වයි. _schdlr_ සේවකයා පමණක් ක්‍රියාත්මක නොවන්නේ නම්, INSTALL.txt ප්‍රලේඛනයේ විස්තර කර ඇති පරිදි ඔබ වින්‍යාස ගොනුව cakeresque නාමාවලියට පිටපත් කරන බවට වග බලා ගන්න.

source: Import Blocklist
si_lk: වාරණ ලැයිස්තුව ආයාත කරන්න

source: It is possible to ban certain values from ever being entered into the system via an event info field or an attribute value. This is done by blocklisting the value in this section.
si_lk: සිද්ධි තොරතුරු ක්ෂේත්‍රයක් හෝ උපලක්ෂණ අගයක් හරහා පද්ධතියට කිසිවිටෙක ඇතුළත් කිරීමෙන් ඇතැම් අගයන් තහනම් කළ හැක. මෙය සිදු කරනු ලබන්නේ මෙම කොටසෙහි අගය අවහිර කිරීමෙනි.

source: Adding and modifying entries
si_lk: ඇතුළත් කිරීම් එකතු කිරීම සහ වෙනස් කිරීම

source: Administrators can add, edit or delete blocklisted items by using the appropriate functions in the list's action menu and the menu on the left.
si_lk: ලැයිස්තුවේ ක්‍රියා මෙනුවේ සහ වම් පස ඇති මෙනුවේ සුදුසු කාර්යයන් භාවිතා කිරීමෙන් පරිපාලකයින්ට අවහිර ලැයිස්තුගත අයිතම එක් කිරීමට, සංස්කරණය කිරීමට හෝ මැකීමට හැකිය.

source: The system allows administrators to set up rules for regular expressions that will automatically alter newly entered or imported events.
si_lk: අලුතින් ඇතුළු වූ හෝ ආනයනය කරන ලද සිදුවීම් ස්වයංක්‍රීයව වෙනස් කරන සාමාන්‍ය ප්‍රකාශන සඳහා රීති සැකසීමට පද්ධතිය පරිපාලකයින්ට ඉඩ දෙයි.

source: The purpose of Import Regexp entries
si_lk: Regexp ඇතුළත් කිරීම් ආනයනය කිරීමේ අරමුණ

source: They can be used for several things, such as unifying the capitalisation of file paths for more accurate event correlation or to automatically censor the usernames and use system path variable names (changing C:\Users\UserName\Appdata\Roaming\file.exe to %APPDATA%\file.exe).<br /> The second use is blocking, if a regular expression is entered with a blank replacement, any event info or attribute value containing the expression will not be added. Please make sure the entered regexp expression follows the preg_replace pattern rules as described <a href="http://php.net/manual/en/function.preg-replace.php">here</a>.
si_lk: වඩාත් නිවැරදි සිදුවීම් සහසම්බන්ධය සඳහා ගොනු මාර්ගවල ප්‍රාග්ධනීකරණය ඒකාබද්ධ කිරීම හෝ පරිශීලක නාම ස්වයංක්‍රීයව වාරණය කිරීම සහ පද්ධති මාර්ග විචල්‍ය නම් භාවිතා කිරීම වැනි දේවල් කිහිපයක් සඳහා ඒවා භාවිතා කළ හැකිය (C:\Users\UserName\Appdata\Roaming\file.exe වෙත වෙනස් කිරීම. %APPDATA%\file.exe).<br /> දෙවන භාවිතය අවහිර කිරීම, නිත්‍ය ප්‍රකාශනයක් හිස් ප්‍රතිස්ථාපනයක් සමඟ ඇතුළත් කළහොත්, ප්‍රකාශනය අඩංගු කිසියම් සිදුවීම් තොරතුරු හෝ ගුණාංග අගයක් එක් නොකෙරේ. කරුණාකර ඇතුළත් කළ regexp ප්‍රකාශනය <a href="http://php.net/manual/en/function.preg-replace.php">මෙහි</a>විස්තර කර ඇති පරිදි preg_replace රටා රීති අනුගමනය කරන බවට වග බලා ගන්න.

source: Administrators can add, edit or delete regular expression rules, which are made up of a regex pattern that the system searches for and a replacement for the detected pattern.
si_lk: පරිපාලකයින්ට නිත්‍ය ප්‍රකාශන රීති එක් කිරීමට, සංස්කරණය කිරීමට හෝ මැකීමට හැකිය, ඒවා පද්ධතිය සොයන regex රටාවකින් සහ අනාවරණය කරගත් රටාව සඳහා ප්‍රතිස්ථාපනයකින් සෑදී ඇත.

source: Add, edit or remove Regexp entries that will affect all newly created attributes here.
si_lk: මෙහි අලුතින් සාදන ලද සියලුම ගුණාංගවලට බලපාන Regexp ඇතුළත් කිරීම් එක් කරන්න, සංස්කරණය කරන්න හෝ ඉවත් කරන්න.

source: Managing the Signature allowedlist
si_lk: අත්සන් අවසර ලැයිස්තුව කළමනාකරණය කිරීම

source: The signature allowedlist view, accessible through the administration menu on the left, allows administrators to create and maintain a list of addresses that are allowedlisted from ever being added to the NIDS signatures. Addresses listed here will be commented out when exporting the NIDS list.
si_lk: වම් පස ඇති පරිපාලන මෙනුව හරහා ප්‍රවේශ විය හැකි අත්සන අවසර ලැයිස්තු දර්ශනය, NIDS අත්සන්වලට කිසිදා එකතු නොකර අවසර දී ඇති ලිපින ලැයිස්තුවක් නිර්මාණය කිරීමට සහ පවත්වාගෙන යාමට පරිපාලකයින්ට ඉඩ සලසයි. NIDS ලැයිස්තුව නිර්යාත කිරීමේදී මෙහි ලැයිස්තුගත කර ඇති ලිපිනයන් අදහස් දක්වනු ඇත.

source: Allowedlisting an address
si_lk: අවසර ලත් ලිපිනයක් ලැයිස්තුගත කිරීම

source: While in the allowedlist view, click on New Allowedlist on the left to bring up the add allowedlist view to add a new address.
si_lk: අවසර ලත් ලැයිස්තුවේ සිටින විට, නව ලිපිනයක් එක් කිරීමට අවසර ලැයිස්තුව එකතු කිරීමට වම් පස ඇති New Allowedlist මත ක්ලික් කරන්න.

source: Managing the list
si_lk: ලැයිස්තුව කළමනාකරණය කිරීම

source: When viewing the list of allowedlisted addresses, the following pieces of information are shown: The ID of the allowedlist entry (assigned automatically when a new address is added), the address itself that is being allowedlisted and a set of controls allowing you to delete the entry or edit the address.
si_lk: අවසර ලත් ලැයිස්තුගත ලිපින ලැයිස්තුව බලන විට, පහත තොරතුරු කොටස් පෙන්වනු ලැබේ: අවසර ලත් ලැයිස්තුවේ ID (නව ලිපිනයක් එකතු කළ විට ස්වයංක්‍රීයව පවරනු ලැබේ), අවසර ලත් ලිපිනයම සහ ඔබට මකා දැමීමට ඉඩ දෙන පාලන කට්ටලයක් ලිපිනය ඇතුල් කිරීම හෝ සංස්කරණය කිරීම.

source: You can edit or delete currently white-listed addresses using the action buttons on this list.
si_lk: ඔබට මෙම ලැයිස්තුවේ ඇති ක්‍රියා බොත්තම් භාවිතයෙන් දැනට සුදු-ලැයිස්තුගත ලිපින සංස්කරණය කිරීමට හෝ මැකීමට හැකිය.

source: Managing the users
si_lk: පරිශීලකයින් කළමනාකරණය කිරීම

source: As an admin, you can set up new accounts for users, edit the profiles of users, delete them, or just have a look at all the viewers' profiles. Organisation admins are restricted to executing the same actions on their organisation's users only.
si_lk: පරිපාලකයෙකු ලෙස, ඔබට පරිශීලකයින් සඳහා නව ගිණුම් සැකසීමට, පරිශීලකයින්ගේ පැතිකඩ සංස්කරණය කිරීමට, ඒවා මකා දැමීමට හෝ සියලුම නරඹන්නන්ගේ පැතිකඩ දෙස බැලීමට හැකිය. සංවිධානයේ පරිපාලකයින් ඔවුන්ගේ සංවිධානයේ පරිශීලකයින්ට පමණක් එම ක්‍රියාවන් ක්‍රියාත්මක කිරීමට සීමා කර ඇත.

source: Adding a new user
si_lk: නව පරිශීලකයෙකු එකතු කිරීම

source: To add a new user, click on the New User button in the administration menu to the left and fill out the following fields in the view that is loaded
si_lk: නව පරිශීලකයෙකු එක් කිරීමට, පරිපාලන මෙනුවේ වම්පස ඇති නව පරිශීලක බොත්තම මත ක්ලික් කර පූරණය වන දර්ශනයේ පහත ක්ෂේත්‍ර පුරවන්න.

source: Add user
si_lk: පරිශීලක එකතු කරන්න

source: Fill this form out to add a new user. Keep in mind that the drop-down menu titled Role controls the privileges the user will have.
si_lk: නව පරිශීලකයෙකු එක් කිරීමට මෙම පෝරමය පුරවන්න. භූමිකාව යන මාතෘකාව සහිත පතන මෙනුව පරිශීලකයාට හිමි වරප්‍රසාද පාලනය කරන බව මතක තබා ගන්න.

source: The user's e-mail address, this will be used as his/her login name and as an address to send all the automatic e-mails and e-mails sent by contacting the user as the reporter of an event.
si_lk: පරිශීලකයාගේ විද්‍යුත් තැපැල් ලිපිනය, මෙය ඔහුගේ/ඇයගේ පිවිසුම් නාමය ලෙසත්, සිදුවීමක වාර්තාකරු ලෙස පරිශීලකයා සම්බන්ධ කර ගැනීමෙන් යවන සියලුම ස්වයංක්‍රීය විද්‍යුත් තැපැල් සහ විද්‍යුත් තැපැල් යැවීමට ලිපිනයක් ලෙසත් භාවිතා කරනු ඇත.

source: A temporary password for the user that he/she should change after the first login. Make sure that it is at least 6 characters long, includes a digit or a special character and contains at least one upper-case and at least one lower-case character.
si_lk: පරිශීලකයා සඳහා ඔහු/ඇය පළමු පිවිසුමෙන් පසුව වෙනස් කළ යුතු තාවකාලික මුරපදයකි. එය අවම වශයෙන් අක්ෂර 6ක් දිග, ඉලක්කමක් හෝ විශේෂ අක්ෂරයක් ඇතුළත් වන අතර අවම වශයෙන් එක් විශාල අකුරක් සහ අවම වශයෙන් එක් කුඩා අකුරක්වත් අඩංගු බව සහතික කර ගන්න.

source: Confirm Password
si_lk: මුරපදය තහවුරු කරන්න

source: This should be an exact copy of the Password field.
si_lk: මෙය මුරපද ක්ෂේත්‍රයේ නියම පිටපතක් විය යුතුය.

source: The organisation of the user. Entering ADMIN into this field will give administrator privileges to the user. If you are an organisation admin, then this field will be unchangeable and be set to your own organisation.
si_lk: පරිශීලකයාගේ සංවිධානය. මෙම ක්ෂේත්‍රයට ADMIN ඇතුළු කිරීමෙන් පරිශීලකයාට පරිපාලක වරප්‍රසාද ලැබේ. ඔබ සංවිධාන පරිපාලකයෙක් නම්, මෙම ක්ෂේත්‍රය වෙනස් කළ නොහැකි අතර ඔබේම සංවිධානයකට සකසනු ඇත.

source: Roles
si_lk: භූමිකාවන්

source: A drop-down list allows you to choose a role-group that the user should belong to. Roles define the privileges of the user. To learn more about roles, <a href=#roles>click here</a>.
si_lk: පතන ලැයිස්තුවක් මඟින් පරිශීලකයා අයත් විය යුතු භූමිකාව-කණ්ඩායමක් තෝරා ගැනීමට ඔබට ඉඩ සලසයි. භූමිකාවන් පරිශීලකයාගේ වරප්‍රසාද නිර්වචනය කරයි. භූමිකාවන් පිළිබඳ වැඩිදුර දැන ගැනීමට, <a href=#roles>මෙහි ක්ලික් කරන්න</a>.

source: Receive alerts when events are published
si_lk: සිදුවීම් ප්‍රකාශනය කරන විට ඇඟවීම් ලබා ගන්න

source: This option will subscribe the new user to automatically generated e-mails whenever an event is published.
si_lk: මෙම විකල්පය නව පරිශීලකයා සිදුවීමක් ප්‍රකාශයට පත් කරන සෑම විටම ස්වයංක්‍රීයව උත්පාදනය කරන ලද විද්‍යුත් තැපැල් වෙත දායක වේ.

source: Receive alerts from "contact reporter" requests
si_lk: "සම්බන්ධතා වාර්තාකරු" ඉල්ලීම් වලින් ඇඟවීම් ලබා ගන්න

source: This option will subscribe the new user to e-mails that are generated when another user tries to get in touch with an event's reporting organisation that matches that of the new user.
si_lk: මෙම විකල්පය නව පරිශීලකයාට ගැළපෙන සිදුවීම් වාර්තා කිරීමේ සංවිධානයක් සමඟ සම්බන්ධ වීමට වෙනත් පරිශීලකයෙකු උත්සාහ කරන විට උත්පාදනය වන විද්‍යුත් තැපැල් වෙත නව පරිශීලකයා දායක වේ.

source: Authkey
si_lk: Autkey

source: This is assigned automatically and is the unique authentication key of the user (he/she will be able to reset this and receive a new key). It is used for exports and for connecting one server to another, but it requires the user to be assigned to a role that has auth permission enabled.
si_lk: මෙය ස්වයංක්‍රීයව පවරනු ලබන අතර පරිශීලකයාගේ අනන්‍ය සත්‍යාපන යතුර වේ (ඔහුට/ඇයට මෙය නැවත සැකසීමට සහ නව යතුරක් ලබා ගැනීමට හැකි වනු ඇත). එය අපනයන සඳහා සහ එක් සේවාදායකයක් තවත් සේවාදායකයකට සම්බන්ධ කිරීම සඳහා භාවිතා කරයි, නමුත් එයට පරිශීලකයා සත්‍යාපන අවසරය සක්‍රීය කර ඇති භූමිකාවකට පැවරීම අවශ්‍ය වේ.

source: NIDS Sid
si_lk: NIDS සිද්

source: Nids ID, not yet implemented.
si_lk: Nids ID, තවම ක්‍රියාත්මක කර නැත.

source: The key used for encrypting e-mails sent through the system.
si_lk: පද්ධතිය හරහා යවන ඊමේල් සංකේතනය කිරීම සඳහා භාවිතා කරන යතුර.

source: Listing all users
si_lk: සියලුම පරිශීලකයින් ලැයිස්තුගත කිරීම

source: To list all current users of the system, just click on List Users under the administration menu to the left. A view will be loaded with a list of all users and the following columns of information
si_lk: පද්ධතියේ දැනට සිටින සියලුම පරිශීලකයින් ලැයිස්තුගත කිරීමට, වම් පසින් පරිපාලන මෙනුව යටතේ පරිශීලකයන් ලැයිස්තු ක්ලික් කරන්න. සියලුම පරිශීලකයින්ගේ ලැයිස්තුවක් සහ පහත තොරතුරු තීරු සමඟ දසුනක් පූරණය වනු ඇත

source: List users
si_lk: පරිශීලකයන් ලැයිස්තුගත කරන්න

source: View, Edit or Delete a user using the action buttons to the right.
si_lk: දකුණේ ඇති ක්‍රියා බොත්තම් භාවිතයෙන් පරිශීලකයෙකු බලන්න, සංස්කරණය කරන්න හෝ මකන්න.

source: The user's automatically assigned ID number.
si_lk: පරිශීලකයාට ස්වයංක්‍රීයව පවරන ලද ID අංකය.

source: The organisation that the user belongs to.
si_lk: පරිශීලකයා අයත් වන සංවිධානය.

source: The e-mail address (and login name) of the user.
si_lk: පරිශීලකයාගේ විද්‍යුත් තැපැල් ලිපිනය (සහ පිවිසුම් නම).

source: Shows whether the user has subscribed to auto-alerts and is always receiving the mass-emails regarding newly published events that he/she is eligible for.
si_lk: පරිශීලකයා ස්වයං-ඇඟවීම් සඳහා දායක වී තිබේද සහ ඔහු/ඇය සුදුසුකම් ඇති අලුතින් ප්‍රකාශයට පත් කරන ලද සිදුවීම් සම්බන්ධයෙන් විශාල විද්‍යුත් තැපෑල සැමවිටම ලබා ගන්නේද යන්න පෙන්වයි.

source: Shows whether the user has the subscription to contact reporter e-mails directed at his/her organisation turned on or off.
si_lk: පරිශීලකයාට ඔහුගේ/ඇයගේ සංවිධානය වෙත යොමු කර ඇති වාර්තාකරු විද්‍යුත් තැපෑල සම්බන්ධ කර ගැනීමට දායකත්වයක් තිබේද යන්න පෙන්වයි.

source: Shows whether the user has entered a GnuPGkey yet.
si_lk: පරිශීලකයා තවමත් GnuPGkey එකක් ඇතුළු කර ඇත්ද යන්න පෙන්වයි.

source: Shows the currently assigned NIDS ID.
si_lk: දැනට පවරා ඇති NIDS ID පෙන්වයි.

source: Termsaccepted
si_lk: කොන්දේසි පිළිගෙන ඇත

source: This flag indicates whether the user has accepted the terms of use or not.
si_lk: මෙම ධජය පරිශීලකයා භාවිත කොන්දේසි පිළිගෙන තිබේද නැද්ද යන්න පෙන්නුම් කරයි.

source: Newsread
si_lk: ප්‍රවෘත්ති කියවීම

source: The last point in time when the user has looked at the news section of the system.
si_lk: පරිශීලකයා පද්ධතියේ ප්‍රවෘත්ති අංශය දෙස බැලූ අවසාන අවස්ථාව.

source: Action Buttons
si_lk: ක්රියාකාරී බොත්තම්

source: Here you can view a detailed view of a user, edit the basic details of a user (same view as the one used for creating a new user, but all the fields come filled out by default) or remove a user completely.
si_lk: මෙහිදී ඔබට පරිශීලකයෙකුගේ සවිස්තරාත්මක දසුනක් බැලීමට, පරිශීලකයාගේ මූලික තොරතුරු සංස්කරණය කිරීමට හැකිය (නව පරිශීලකයෙකු නිර්මාණය කිරීම සඳහා භාවිතා කරන ලද දර්ශනයම, නමුත් සියලුම ක්ෂේත්‍ර පෙරනිමියෙන් පුරවා ඇත) හෝ පරිශීලකයෙකු සම්පූර්ණයෙන්ම ඉවත් කරන්න.

source: Editing a user
si_lk: පරිශීලකයෙකු සංස්කරණය කිරීම

source: It is possible to assign a new password manually for a user. For example, in case that he/she forgot the old one a new temporary one can be assigned. Make sure to check the "Change password" field if you do give out a temporary password, so that the user will be forced to change it after login.
si_lk: පරිශීලකයෙකු සඳහා අතින් නව මුරපදයක් පැවරිය හැකිය. උදාහරණයක් ලෙස, ඔහුට/ඇයට පැරණි එක අමතක වූ විට නව තාවකාලික එකක් පැවරිය හැක. ඔබ තාවකාලික මුරපදයක් ලබා දෙන්නේ නම්, "මුරපදය වෙනස් කරන්න" ක්ෂේත්‍රය පරීක්ෂා කිරීමට වග බලා ගන්න, එවිට පරිශීලකයාට පුරනය වීමෙන් පසු එය වෙනස් කිරීමට බල කෙරෙනු ඇත.

source: This option will subscribe the user to automatically generated e-mails whenever an event is published.
si_lk: මෙම විකල්පය සිදුවීමක් ප්‍රකාශයට පත් කරන සෑම විටම ස්වයංක්‍රීයව උත්පාදනය කරන ලද විද්‍යුත් තැපැල් වෙත පරිශීලකයා දායක වේ.

source: This option will subscribe the user to e-mails that are generated when another user tries to get in touch with an event's reporting organisation that matches that of the user.
si_lk: මෙම විකල්පය පරිශීලකයාට ගැළපෙන සිදුවීම් වාර්තා කිරීමේ සංවිධානයක් සමඟ සම්බන්ධ වීමට වෙනත් පරිශීලකයෙකු උත්සාහ කරන විට ජනනය වන විද්‍යුත් තැපෑලට පරිශීලකයා දායක වේ.

source: It is possible to request a new authentication key for the user.
si_lk: පරිශීලකයා සඳහා නව සත්‍යාපන යතුරක් ඉල්ලා සිටිය හැක.

source: Indicates whether the user has accepted the terms of use already or not.
si_lk: පරිශීලකයා දැනටමත් භාවිත නියමයන් පිළිගෙන තිබේද නැද්ද යන්න පෙන්නුම් කරයි.

source: Setting this flag will require the user to change password after the next login.
si_lk: මෙම ධජය සැකසීමට පරිශීලකයාට ඊළඟ පිවිසුමෙන් පසු මුරපදය වෙනස් කිරීමට අවශ්‍ය වේ.

source: Contacting a user
si_lk: පරිශීලකයෙකු සම්බන්ධ කර ගැනීම

source: Site admins can use the "Contact users" feature to send all or an individual user an e-mail. Users that have a GnuPG key set will receive their e-mails encrypted. When clicking this button on the left, you'll be presented with a form that allows you to specify the type of the e-mail, who it should reach and what the content is using the following options
si_lk: සියලුම හෝ තනි පරිශීලකයෙකුට විද්‍යුත් තැපෑලක් යැවීමට අඩවි පරිපාලකයින්ට "පරිශීලකයන් අමතන්න" විශේෂාංගය භාවිතා කළ හැක. GnuPG යතුරු කට්ටලයක් ඇති පරිශීලකයින්ට ඔවුන්ගේ ඊමේල් සංකේතනය කර ලැබෙනු ඇත. වම් පස ඇති මෙම බොත්තම ක්ලික් කරන විට, ඔබට විද්‍යුත් තැපෑල වර්ගය, එය ළඟා විය යුත්තේ කාටද සහ පහත විකල්ප භාවිතා කරන අන්තර්ගතය කුමක් ද යන්න සඳහන් කිරීමට ඉඩ සලසන පෝරමයක් ඔබට ඉදිරිපත් කරනු ඇත.

source: Contact
si_lk: අමතන්න

source: Contact your users here.
si_lk: ඔබේ පරිශීලකයින් මෙතැනින් සම්බන්ධ කරගන්න.

source: This defines the type of the e-mail, which can be a custom message or a password reset. Password resets automatically include a new temporary password at the bottom of the message and will automatically change the user's password accordingly.
si_lk: අභිරුචි පණිවිඩයක් හෝ මුරපද යළි පිහිටුවීමක් විය හැකි විද්‍යුත් තැපෑලෙහි වර්ගය මෙය නිර්වචනය කරයි. මුරපද යළි පිහිටුවීමේ ස්වයංක්‍රීයව පණිවිඩයේ පතුලේ නව තාවකාලික මුරපදයක් ඇතුළත් වන අතර ඒ අනුව පරිශීලකයාගේ මුරපදය ස්වයංක්‍රීයව වෙනස් වේ.

source: The recipient toggle lets you contact all your users, a single user (which creates a second drop-down list with all the e-mail addresses of the users) and potential future users (which opens up a text field for the e-mail address and a text area field for a GnuPG public key).
si_lk: ලබන්නාගේ ටොගලය ඔබට ඔබගේ සියලුම පරිශීලකයින්, තනි පරිශීලකයෙකු (පරිශීලකයන්ගේ සියලුම විද්‍යුත් තැපැල් ලිපින සමඟ දෙවන පතන ලැයිස්තුවක් නිර්මාණය කරයි) සහ අනාගත අනාගත පරිශීලකයින් (ඊමේල් ලිපිනය සඳහා පෙළ ක්ෂේත්‍රයක් විවෘත කරන) සම්බන්ධ කර ගැනීමට ඔබට ඉඩ සලසයි. සහ GnuPG පොදු යතුරක් සඳහා පෙළ ප්‍රදේශ ක්ෂේත්‍රයක්).

source: Subject
si_lk: විෂය

source: In the case of a custom e-mail, you can enter a subject line here.
si_lk: අභිරුචි විද්‍යුත් තැපෑලකදී, ඔබට මෙහි විෂය රේඛාවක් ඇතුළත් කළ හැකිය.

source: Custom message checkbox
si_lk: අභිරුචි පණිවිඩ පිරික්සුම් කොටුව

source: This is available for password resets, you can either write your own message (which will be appended with a temporary key and the signature), or let the system generate one automatically.
si_lk: මුරපද යළි පිහිටුවීම සඳහා මෙය ලබා ගත හැකිය, ඔබට ඔබේම පණිවිඩයක් ලිවිය හැකිය (එය තාවකාලික යතුරක් සහ අත්සනක් සමඟ එකතු කරනු ලැබේ), නැතහොත් පද්ධතියට එකක් ස්වයංක්‍රීයව උත්පාදනය කිරීමට ඉඩ දෙන්න.
