Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: Dashboard template removed.
si_lk: උපකරණ පුවරු අච්චුව ඉවත් කරන ලදී.

source: Default decaying models updated
si_lk: පෙරනිමි දිරාපත් වන ආකෘති යාවත්කාලීන කරන ලදී

source: This method is not allowed
si_lk: මෙම ක්රමය අවසර නැත

source: No Decaying Model with the provided ID exists
si_lk: සපයා ඇති හැඳුනුම්පත සහිත දිරාපත්වන ආකෘතියක් නොමැත

source: Only one import field can be used
si_lk: එක් ආයාත ක්ෂේත්‍රයක් පමණක් භාවිතා කළ හැක

source: Error while decoding JSON
si_lk: JSON විකේතනය කිරීමේදී දෝෂයකි

source: The model has been imported.
si_lk: ආකෘතිය ආනයනය කර ඇත.

source: The model has been imported. However importing mapping failed.
si_lk: ආකෘතිය ආනයනය කර ඇත. කෙසේ වෙතත් සිතියම්ගත කිරීම ආයාත කිරීම අසාර්ථක විය.

source: Error while importing model.
si_lk: ආකෘතිය ආයාත කිරීමේදී දෝෂයකි.

source: The model must have a name
si_lk: ආකෘතියට නමක් තිබිය යුතුය

source: The model has been saved.
si_lk: ආකෘතිය සුරැකී ඇත.

source: The model has been saved. However importing mapping failed.
si_lk: ආකෘතිය සුරැකී ඇත. කෙසේ වෙතත් සිතියම්ගත කිරීම ආයාත කිරීම අසාර්ථක විය.

source: The model could not be saved. Please try again.
si_lk: ආකෘතිය සුරැකීමට නොහැකි විය. කරුණාකර නැවත උත්සාහ කරන්න.

source: Invalid JSON `Settings`.
si_lk: වලංගු නොවන JSON `සැකසීම්`.

source: Invalid parameter `lifetime`.
si_lk: වලංගු නොවන පරාමිතිය `ජීවිත කාලය`.

source: Invalid parameter `decay_speed`.
si_lk: අවලංගු පරාමිතිය `දිරායාම_වේගය`.

source: Invalid parameter `threshold`.
si_lk: වලංගු නොවන පරාමිතිය `ඉන්පස`.

source: Invalid parameter `default_base_score`.
si_lk: අවලංගු පරාමිතිය `default_base_score`.

source: Invalid parameter `base_score_config`.
si_lk: වලංගු නොවන පරාමිතිය `base_score_config`.

source: Missing JSON key `parameters`.
si_lk: JSON යතුර 'පරාමිති' අස්ථානගත වී ඇත.

source: You are not authorised to delete this model.
si_lk: මෙම ආකෘතිය මැකීමට ඔබට අවසර නැත.

source: Decaying Model deleted.
si_lk: දිරාපත් වන ආකෘතිය මකා ඇත.

source: The Decaying Model could not be deleted.
si_lk: දිරාපත් වන ආකෘතිය මැකීමට නොහැකි විය.

source: You are not authorised to enable this model.
si_lk: මෙම ආකෘතිය සබල කිරීමට ඔබට අවසර නැත.

source: Decaying Model enabled.
si_lk: දිරාපත් වන මාදිලිය සක්‍රීය කර ඇත.

source: Error while enabling decaying model
si_lk: ක්ෂය වන ආකෘතිය සබල කිරීමේදී දෝෂයකි

source: You are not authorised to disable this model.
si_lk: මෙම ආකෘතිය අබල කිරීමට ඔබට අවසර නැත.

source: Decaying Model disabled.
si_lk: දිරාපත් වන මාදිලිය අක්‍රීය කර ඇත.

source: Error while disabling decaying model
si_lk: දිරාපත් වන ආකෘතිය අක්‍රිය කිරීමේදී දෝෂයකි

source: Lifetime
si_lk: ජීවිත කාලය

source: Lifetime of the attribute, or time after which the score will be 0
si_lk: ගුණාංගයේ ආයු කාලය, නැතහොත් ලකුණු 0 වනු ඇති කාලය

source: Decay speed
si_lk: ක්ෂය වීමේ වේගය

source: Decay speed at which an indicator will loose score
si_lk: දර්ශකයක් ලකුණු අහිමි වන ක්ෂය වීමේ වේගය

source: Cutoff threshold
si_lk: කඩඉම් එළිපත්ත

source: Cutoff value at which an indicator will be marked as decayed instead of 0
si_lk: දර්ශකයක් 0 වෙනුවට දිරාපත් වූ ලෙස සලකුණු කෙරෙන කඩඉම් අගය

source: Error Processing Request, can't parse the body
si_lk: ඉල්ලීම සැකසීමේ දෝෂයකි, ශරීරය විග්‍රහ කළ නොහැක

source: This method is only accessible via AJAX.
si_lk: මෙම ක්‍රමයට ප්‍රවේශ විය හැක්කේ AJAX හරහා පමණි.

source: Event Blocklisting is not currently enabled on this instance.
si_lk: මෙම අවස්ථාවෙහි සිදුවීම් වාරණ ලැයිස්තුගත කිරීම දැනට සබල කර නොමැත.

source: Invalid event IDs.
si_lk: වලංගු නොවන සිදුවීම් හැඳුනුම්පත්.

source: Failed to delete Event from EventBlocklist. Error:
si_lk: EventBlocklist වෙතින් Event මැකීමට අසමත් විය. දෝෂය:

source: Invalid event blocklist IDs.
si_lk: අවලංගු සිදුවීම් වාරණ ලැයිස්තු IDs.

source: Report saved.
si_lk: වාර්තාව සුරකින ලදී.

source: Event report %s
si_lk: සිදුවීම් වාර්තාව %s

source: This function can only be reached via the API.
si_lk: මෙම කාර්යයට ළඟා විය හැක්කේ API හරහා පමණි.

source: Event Report %s %s deleted
si_lk: සිදුවීම් වාර්තාව %s %s මකා දමන ලදී

source: hard
si_lk: අමාරුයි

source: soft
si_lk: මෘදු

source: Event Report %s could not be %s deleted.%sReasons: %s
si_lk: සිදුවීම් වාර්තාව %s %s මකා දැමිය නොහැක.%sහේතු: %s

source: This function can only be reached via AJAX.
si_lk: මෙම කාර්යයට ළඟා විය හැක්කේ AJAX හරහා පමණි.

source: Event Report %s restored
si_lk: සිදුවීම් වාර්තාව %s ප්‍රතිසාධනය කරන ලදී

source: Event Report %s could not be %s restored.%sReasons: %s
si_lk: සිදුවීම් වාර්තාව %s %s ප්‍රතිසාධනය කළ නොහැක.%sහේතු: %s

source: Automatic extraction applied to Event Report %s
si_lk: සිදුවීම් වාර්තාව %sවෙත ස්වයංක්‍රීය නිස්සාරණය යෙදේ

source: Automatic extraction could not be applied to Event Report %s.%sReasons: %s
si_lk: සිදුවීම් වාර්තාව %sවෙත ස්වයංක්‍රීය නිස්සාරණය යෙදිය නොහැක.%sහේතු: %s

source: `content` and `mapping` key cannot be empty
si_lk: `අන්තර්ගතය` සහ `සිතියම්` යතුර හිස් විය නොහැක

source: Suggestions applied to Event Report %s
si_lk: සිද්ධි වාර්තාව %sවෙත යෝජනා යොදන ලදී

source: Suggestions could not be applied to Event Report %s.%sReasons: %s
si_lk: සිදුවීම් වාර්තාව %sවෙත යෝජනා යෙදිය නොහැක.%sහේතු: %s

source: An URL must be provided
si_lk: URL එකක් සැපයිය යුතුය

source: Report from - %s (%s)
si_lk: වාර්තාව - %s (%s)

source: Could not fetch report from URL. Fetcher module not enabled or could not download the page
si_lk: URL වෙතින් වාර්තාව ලබා ගැනීමට නොහැකි විය. ෆෙචර් මොඩියුලය සක්‍රීය කර නැත හෝ පිටුව බාගැනීමට නොහැකි විය

source: Report downloaded and created
si_lk: වාර්තාව බාගත කර සාදන ලදී

source: Event report (%s)
si_lk: සිදුවීම් වාර්තාව (%s)

source: Could not generate markdown from the event
si_lk: සිදුවීමෙන් සලකුණු ජනනය කිරීමට නොහැකි විය

source: No X.509 certificate or PGP key set in your profile. To receive emails, submit your public certificate or PGP key in your profile.
si_lk: ඔබගේ පැතිකඩෙහි X.509 සහතිකය හෝ PGP යතුර සකසා නැත. ඊමේල් ලැබීමට, ඔබේ පැතිකඩෙහි ඔබේ පොදු සහතිකය හෝ PGP යතුර ඉදිරිපත් කරන්න.

source: No PGP key set in your profile. To receive emails, submit your public key in your profile.
si_lk: ඔබගේ පැතිකඩෙහි PGP යතුරක් සකසා නැත. ඊමේල් ලැබීමට, ඔබේ පැතිකඩෙහි ඔබේ පොදු යතුර ඉදිරිපත් කරන්න.

source: No X.509 certificate or PGP key set in your profile. To receive attributes in emails, submit your public certificate or PGP key in your profile.
si_lk: ඔබගේ පැතිකඩෙහි X.509 සහතිකය හෝ PGP යතුර සකසා නැත. විද්‍යුත් තැපෑලෙහි උපලක්ෂණ ලබා ගැනීමට, ඔබේ පැතිකඩෙහි ඔබේ පොදු සහතිකය හෝ PGP යතුර ඉදිරිපත් කරන්න.

source: No PGP key set in your profile. To receive attributes in emails, submit your public key in your profile.
si_lk: ඔබගේ පැතිකඩෙහි PGP යතුරක් සකසා නැත. ඊමේල් වල උපලක්ෂණ ලබා ගැනීමට, ඔබගේ පැතිකඩෙහි ඔබගේ පොදු යතුර ඉදිරිපත් කරන්න.

source: Published
si_lk: ප්‍රකාශිතයි

source: Date
si_lk: දිනය

source: Event info
si_lk: සිදුවීම් තොරතුරු

source: Threat level
si_lk: තර්ජන මට්ටම

source: Distribution
si_lk: බෙදා හැරීම

source: Sharing group
si_lk: බෙදාගැනීමේ කණ්ඩායම

source: Analysis
si_lk: විශ්ලේෂණය

source: Attribute
si_lk: ගුණාංගය

source: Has proposal
si_lk: යෝජනාවක් ඇත

source: Last change at
si_lk: අවසන් වෙනස

source: Published at
si_lk: ප්‍රකාශයට පත් කර ඇත

source: Email
si_lk: විද්යුත් තැපෑල

source: Organisation
si_lk: ආයතනය

source: User not found
si_lk: පරිශීලක හමු නොවීය

source: Event #%s
si_lk: සිදුවීම #%s

source: Viewing event as %s from %s
si_lk: සිදුවීම %sසිට %s ලෙස බැලීම

source: You are currently logged in as a site administrator and about to edit an event not belonging to your organisation. This goes against the sharing model of MISP. Use a normal user account for day to day work.
si_lk: ඔබ දැනට අඩවි පරිපාලකයෙකු ලෙස පුරනය වී ඇති අතර ඔබගේ සංවිධානයට අයත් නොවන සිදුවීමක් සංස්කරණය කිරීමට සූදානම් වේ. මෙය MISP හි බෙදාගැනීමේ ආකෘතියට පටහැනි වේ. එදිනෙදා වැඩ සඳහා සාමාන්‍ය පරිශීලක ගිණුමක් භාවිතා කරන්න.

source: No valid event data received.
si_lk: වලංගු සිදුවීම් දත්ත ලැබී නැත.

source: Invalid Sharing Group or not authorised (Sync user is not contained in the Sharing group).
si_lk: වලංගු නොවන බෙදාගැනීමේ කණ්ඩායමක් හෝ බලයලත් නැත (සමමුහුර්ත පරිශීලකයා බෙදාගැනීමේ කණ්ඩායමෙහි අඩංගු නොවේ).

source: The event has been saved
si_lk: සිදුවීම සුරැකී ඇත

source: Event already exists, if you would like to edit it, use the url in the location header.
si_lk: සිදුවීම දැනටමත් පවතී, ඔබ එය සංස්කරණය කිරීමට කැමති නම්, ස්ථාන ශීර්ෂයේ ඇති url භාවිතා කරන්න.

source: Event blocked by organisation blocklist.
si_lk: සංවිධාන වාරණ ලැයිස්තුව මගින් සිදුවීම අවහිර කරන ලදී.

source: Event blocked by event blocklist.
si_lk: සිදුවීම් වාරණ ලැයිස්තුව මගින් සිදුවීම අවහිර කර ඇත.

source: Blocked by event block rules.
si_lk: සිදුවීම් වාරණ නීති මගින් අවහිර කර ඇත.

source: A blocklist entry is blocking you from creating any events. Please contact the administration team of this instance
si_lk: වාරණ ලැයිස්තු ප්‍රවේශයක් ඔබට කිසිදු සිදුවීමක් සෑදීමෙන් අවහිර කරයි. කරුණාකර මෙම අවස්ථාවෙහි පරිපාලන කණ්ඩායම අමතන්න

source: The event could not be saved. Please, try again.
si_lk: සිදුවීම සුරැකිය නොහැකි විය. කරුණාකර නැවත උත්සාහ කරන්න.

source: The event created will be visible to the organisations having an account on this platform, but not synchronised to other MISP instances until it is published.
si_lk: නිර්මාණය කරන ලද සිදුවීම මෙම වේදිකාවේ ගිණුමක් ඇති ආයතනවලට දෘශ්‍යමාන වනු ඇත, නමුත් එය ප්‍රකාශනය කරන තෙක් වෙනත් MISP අවස්ථා සමඟ සමමුහුර්ත නොවේ.

source: No file uploaded.
si_lk: ගොනුවක් උඩුගත කර නැත.

source: No file was uploaded.
si_lk: ගොනු කිසිවක් උඩුගත කර නැත.

source: You may only upload MISP XML or MISP JSON files.
si_lk: ඔබට උඩුගත කළ හැක්කේ MISP XML හෝ MISP JSON ගොනු පමණි.

source: File upload failed or file does not have the expected extension (.xml / .json).
si_lk: ගොනු උඩුගත කිරීම අසාර්ථක විය හෝ ගොනුවේ අපේක්ෂිත දිගුව (.xml / .json) නොමැත.

source: Could not process MISP export file. Probably file content is invalid.
si_lk: MISP අපනයන ගොනුව සැකසීමට නොහැකි විය. සමහරවිට ගොනු අන්තර්ගතය වලංගු නොවේ.

source: STIX document imported.
si_lk: STIX ලේඛනය ආනයනය කරන ලදී.

source: Could not import STIX document: %s
si_lk: STIX ලේඛනය ආයාත කිරීමට නොහැකි විය: %s

source: File upload failed. Make sure that you select a STIX file to be uploaded and that the file doesn't exceed the maximum file size of %s MB.
si_lk: ගොනු උඩුගත කිරීම අසාර්ථක විය. ඔබ උඩුගත කිරීමට STIX ගොනුවක් තෝරාගෙන ඇති බවත් එම ගොනුව උපරිම ගොනු ප්‍රමාණය %s MB නොඉක්මවන බවත් සහතික කර ගන්න.

source: This action requires a target_id for GET requests and both a target_id and a source_id for POST requests.
si_lk: මෙම ක්‍රියාවට GET ඉල්ලීම් සඳහා target_id එකක් සහ POST ඉල්ලීම් සඳහා target_id සහ source_id යන දෙකම අවශ්‍ය වේ.

source: Invalid target event.
si_lk: වලංගු නොවන ඉලක්ක සිදුවීම.

source: Invalid source event.
si_lk: වලංගු නොවන මූලාශ්‍ර සිදුවීමක්.

source: Event merge results
si_lk: සිදුවීම් ඒකාබද්ධ ප්රතිඵල

source: Merge data from event
si_lk: සිදුවීමෙන් දත්ත ඒකාබද්ධ කරන්න

source: Event was not deleted.
si_lk: සිදුවීම මකා නැත.

source: Event deleted.
si_lk: සිදුවීම මකා දමන ලදී.

source: You do not have the permission to do that.
si_lk: එසේ කිරීමට ඔබට අවසර නැත.

source: Event unpublished.
si_lk: සිදුවීම ප්‍රකාශනය නොකළ

source: Event published without alerts
si_lk: සිදුවීම ඇඟවීම් නොමැතිව ප්‍රකාශනය කරන ලදී

source: Event published but not pushed to %s, re-try later. If the issue persists, make sure that the correct sync user credentials are used for the server link and that the sync user on the remote server has authentication privileges.
si_lk: සිදුවීම ප්‍රකාශිත නමුත් %sවෙත තල්ලු කර නැත, පසුව නැවත උත්සාහ කරන්න. ගැටලුව දිගටම පවතින්නේ නම්, සේවාදායක සබැඳිය සඳහා නිවැරදි සමමුහුර්ත පරිශීලක අක්තපත්‍ර භාවිතා කර ඇති බවත් දුරස්ථ සේවාදායකයේ සමමුහුර්ත පරිශීලකයාට සත්‍යාපන වරප්‍රසාද ඇති බවත් සහතික කර ගන්න.

source: Not published given no connection to %s but email sent to all participants.
si_lk: %s වෙත සම්බන්ධයක් නොමැතිව ප්‍රකාශනය නොකළ නමුත් සියලුම සහභාගිවන්නන් වෙත විද්‍යුත් තැපෑල යවා ඇත.

source: Published but no email sent given GnuPG is not configured.
si_lk: ප්‍රකාශයට පත් කරන ලද නමුත් GnuPG වින්‍යාස කර නොමැති ඊමේල් කිසිවක් යවා නැත.

source: Not published given no connection to %s but no email sent given GnuPG is not configured.
si_lk: %s වෙත සම්බන්ධයක් නොමැතිව ප්‍රකාශනය කර නැත නමුත් GnuPG ලබා දී ඇති විද්‍යුත් තැපෑලක් වින්‍යාස කර නොමැත.

source: Invalid event.
si_lk: වලංගු නොවන සිදුවීමක්.

source: Could not publish event - no tag for required taxonomies missing: %s
si_lk: සිදුවීම ප්‍රකාශනය කළ නොහැකි විය - අවශ්‍ය වර්ගීකරණ සඳහා ටැග් නොමැත: %s

source: You must specify a message.
si_lk: ඔබ පණිවිඩයක් සඳහන් කළ යුතුය.

source: Email sent to the reporter.
si_lk: වාර්තාකරු වෙත විද්‍යුත් තැපෑල යවා ඇත.

source: Sending of email failed.
si_lk: ඊමේල් යැවීම අසාර්ථක විය.

source: Warning, you are logged in as a site admin, any export that you generate will contain the FULL UNRESTRICTED data-set. If you would like to generate an export for your own organisation, please log in with a different user.
si_lk: අවවාදයයි, ඔබ අඩවි පරිපාලකයෙකු ලෙස පුරනය වී ඇත, ඔබ උත්පාදනය කරන ඕනෑම අපනයනයක සම්පූර්ණ අසීමිත දත්ත කට්ටලයක් අඩංගු වේ. ඔබ ඔබේම ආයතනයක් සඳහා අපනයනයක් උත්පාදනය කිරීමට කැමති නම්, කරුණාකර වෙනත් පරිශීලකයෙකු සමඟ ලොග් වන්න.

source: This feature is currently disabled
si_lk: මෙම විශේෂාංගය දැනට අබල කර ඇත

source: Filename not allowed.
si_lk: ගොනු නාමයට අවසර නැත.

source: Problem with writing the IoC file. Please report to site admin.
si_lk: IoC ගොනුව ලිවීමේ ගැටලුව. කරුණාකර අඩවි පරිපාලක වෙත වාර්තා කරන්න.

source: Not yet implemented
si_lk: තවමත් ක්රියාත්මක කර නැත

source: Invalid event or not authorised.
si_lk: වලංගු නොවන සිදුවීමක් හෝ අවසර දී නොමැත.

source: Nothing to add.
si_lk: එකතු කිරීමට කිසිවක් නැත.

source: Tag not found.
si_lk: ටැගය හමු නොවීය.

source: Tag is already attached to this event.
si_lk: මෙම සිදුවීමට දැනටමත් ටැගය අමුණා ඇත.

source: Tag is not allowed due to taxonomy exclusivity settings
si_lk: වර්ගීකරණ සුවිශේෂතා සැකසීම් හේතුවෙන් ටැගයට ඉඩ නොදේ

source: Invalid Tag. This tag can only be set as a local tag.
si_lk: වලංගු නොවන ටැගය. මෙම ටැගය දේශීය ටැගයක් ලෙස පමණක් සැකසිය හැක.

source: , but %s could not be added: %s
si_lk: , නමුත් %s එකතු කළ නොහැක: %s

source: Freetext Import Results
si_lk: Freetext ආයාත ප්‍රතිඵල

source: Event not found or you are not authorised to view it.
si_lk: සිදුවීම හමු නොවීය හෝ ඔබට එය බැලීමට අවසර නැත.

source: Freetext Import
si_lk: නිදහස් පෙළ ආයාත කිරීම

source: Populate using a Template
si_lk: අච්චුවක් භාවිතයෙන් ජනගත කරන්න

source: OpenIOC Import
si_lk: OpenIOC ආනයනය

source: ThreatConnect Import
si_lk: ThreatConnect ආනයනය

source: (Experimental) Forensic analysis - Mactime
si_lk: (පර්යේෂණාත්මක) අධිකරණ වෛද්ය විශ්ලේෂණය - මැක්ටයිම්

source: MISP standard (recommended exchange format - lossless)
si_lk: MISP ප්‍රමිතිය (නිර්දේශිත හුවමාරු ආකෘතිය - පාඩු රහිත)

source: STIX 1.1.1 format (lossy)
si_lk: STIX 1.1.1 ආකෘතිය (අහිමි)

source: STIX 2.0 format (lossy)
si_lk: STIX 2.0 ආකෘතිය (අහිමි)

source: Please POST the samples as described on the automation page.
si_lk: කරුණාකර ස්වයංක්‍රීයකරණ පිටුවේ විස්තර කර ඇති පරිදි සාම්පල පළ කරන්න.

source: No samples received, or samples not in the correct format. Please refer to the API documentation on the automation page.
si_lk: සාම්පල ලැබී නැත, හෝ සාම්පල නිවැරදි ආකෘතියේ නැත. කරුණාකර ස්වයංක්‍රීයකරණ පිටුවේ ඇති API ප්‍රලේඛනය බලන්න.

source: Event not found
si_lk: සිදුවීම හමු නොවීය

source: Event not found.
si_lk: සිදුවීම හමු නොවීය.

source: Distribution level 5 is not supported when uploading a sample without passing an event ID. Distribution level 5 is meant to take on the distribution level of an existing event.
si_lk: සිදුවීම් හැඳුනුම්පතක් සම්මත නොකර නියැදියක් උඩුගත කිරීමේදී බෙදා හැරීමේ මට්ටම 5 සහාය නොදක්වයි. බෙදාහැරීමේ මට්ටම 5 යනු පවතින සිදුවීමක බෙදා හැරීමේ මට්ටම ලබා ගැනීමයි.

source: The creation of a new event with the supplied information has failed.
si_lk: සපයන ලද තොරතුරු සමඟ නව සිදුවීමක් නිර්මාණය කිරීම අසාර්ථක විය.

source: Invalid type.
si_lk: වලංගු නොවන වර්ගය.

source: Invalid method.
si_lk: වලංගු නොවන ක්‍රමය.

source: %s services are not enabled.
si_lk: %s සේවා සබල කර නැත.

source: Attribute not found or you are not authorised to see it.
si_lk: ගුණාංගය හමු නොවීය හෝ ඔබට එය බැලීමට අවසර නැත.

source: No valid %s options found for this attribute.
si_lk: මෙම ගුණාංගය සඳහා වලංගු %s විකල්ප හමු නොවීය.

source: Enrichment Results
si_lk: පොහොසත් කිරීමේ ප්රතිඵල

source: %s service not reachable.
si_lk: %s සේවාව ළඟා විය නොහැක.

source: : Enriched via the
si_lk: : හරහා පොහොසත්

source: : Enriched via the %s
si_lk: : %sහරහා පොහොසත්

source: You don't have permission to do that.
si_lk: ඔබට එය කිරීමට අවසර නැත.

source: Import service not reachable.
si_lk: ආනයන සේවාව ළඟා විය නොහැක.

source: Import Results
si_lk: ආයාත ප්‍රතිඵල

source: Invalid ID.
si_lk: වලංගු නොවන හැඳුනුම්පතක්.

source: Invalid Event
si_lk: වලංගු නොවන සිදුවීමක්

source: Enrichment task queued for background processing. Check back later to see the results.
si_lk: පසුබිම සැකසීම සඳහා පොහොසත් කිරීමේ කාර්යය පෝලිම් කර ඇත. ප්‍රතිඵල බැලීමට පසුව නැවත පරීක්ෂා කරන්න.

source: another user
si_lk: තවත් පරිශීලකයෙක්

source: background job
si_lk: පසුබිම් කාර්යය

source: external tool
si_lk: බාහිර මෙවලම

source: <b>Warning</b>: This event view is outdated. Please reload page to see latest changes.
si_lk: <b>අවවාදයයි</b>: මෙම සිදුවීම් දසුන යල් පැන ඇත. නවතම වෙනස්කම් බැලීමට කරුණාකර පිටුව නැවත පූරණය කරන්න.

source: <b>Warning</b>: This event view is outdated, because is currently being edited by: %s. Please reload page to see latest changes.
si_lk: <b>අවවාදයයි</b>: මෙම සිදුවීම් දර්ශනය කල් ඉකුත් වී ඇත, මන්ද දැනට සංස්කරණය කරනු ලබන්නේ: %s. නවතම වෙනස්කම් බැලීමට කරුණාකර පිටුව නැවත පූරණය කරන්න.

source: This event is currently being edited by: %s
si_lk: මෙම සිදුවීම දැනට සංස්කරණය කරනු ලබන්නේ: %sවිසිනි

source: %s event(s) deleted.
si_lk: සිදුවීම් %s ක් මකා ඇත.

source: Recovery simulation complete. Event #%s can be recovered using %s log entries.
si_lk: ප්‍රතිසාධන අනුකරණය සම්පූර්ණයි. සිදුවීම් #%s ලොග් ඇතුළත් කිරීම් %s ක් භාවිතයෙන් ප්‍රතිසාධනය කළ හැක.

source: This action is only accessible via POST requests.
si_lk: මෙම ක්‍රියාවට ප්‍රවේශ විය හැක්කේ POST ඉල්ලීම් හරහා පමණි.

source: Bootstraping recovering of event %s
si_lk: සිදුවීම %sප්‍රතිසාධනය බූට්ස්ට්‍රැප් කිරීම

source: Recover event job queued. Job ID: %s
si_lk: සිදුවීම් රැකියා පෝලිම් ප්‍රතිසාධනය කරන්න. රැකියා ID: %s

source: All done. attribute_count generated from scratch for
si_lk: ඔක්කොම කරලා. attribute_count සඳහා මුල සිට ජනනය කරන ලදී

source: %s event deleted.
si_lk: සිදුවීම් %s ක් මකා ඇත.

source: Tag added
si_lk: ටැගය එකතු කරන ලදී

source: You don't have the required privileges to do that.
si_lk: ඔබට එය කිරීමට අවශ්‍ය වරප්‍රසාද නොමැත.

source: Default feed metadata loaded.
si_lk: පෙරනිමි සංග්‍රහ පාරදත්ත පූරණය කරන ලදී.

source: Feeds
si_lk: පෝෂණය කරයි

source: Inherit from feed
si_lk: පෝෂණයෙන් උරුම වේ

source: Invalid exclude regex. Make sure it's a delimited PCRE regex pattern.
si_lk: අවලංගු බැහැර regex. එය සීමා කළ PCRE regex රටාවක් බව සහතික කර ගන්න.

source: Invalid feed.
si_lk: වලංගු නොවන පෝෂණය.

source: Feed is currently not enabled. Make sure you enable it.
si_lk: සංග්‍රහය දැනට සබල කර නැත. ඔබ එය සක්රිය කිරීමට වග බලා ගන්න.

source: Starting fetch from Feed.
si_lk: සංග්‍රහයෙන් ලබා ගැනීම ආරම්භ වේ.

source: Pull queued for background execution.
si_lk: පසුබිම ක්‍රියාත්මක කිරීම සඳහා අදින්න පෝලිමේ.

source: Fetching the feed has failed.
si_lk: සංග්‍රහය ලබා ගැනීම අසාර්ථක විය.

source: Fetching the feed has successfully completed.
si_lk: සංග්‍රහය ලබා ගැනීම සාර්ථකව නිම කර ඇත.

source: No feed enabled.
si_lk: සංග්‍රහයක් සබල කර නැත.

source: Download failed.
si_lk: බාගත කිරීම අසමත් විය.

source: Event added.
si_lk: සිදුවීම එකතු කරන ලදී.

source: Event already up to date.
si_lk: සිදුවීම දැනටමත් යාවත්කාලීනයි.

source: Event updated.
si_lk: සිදුවීම යාවත්කාලීන කරන ලදී.

source: Could not %s event.
si_lk: සිදුවීම් %s ක් කළ නොහැකි විය.

source: Invalid feed type.
si_lk: වලංගු නොවන ආහාර වර්ගය.

source: Could not download the selected Event
si_lk: තෝරාගත් සිදුවීම බාගැනීමට නොහැකි විය

source: This event is blocked by the Feed filters.
si_lk: මෙම සිදුවීම සංග්‍රහ පෙරහන් මගින් අවහිර කර ඇත.

source: Invalid Feed.
si_lk: වලංගු නොවන සංග්‍රහය.

source: Only POST requests are allowed.
si_lk: POST ඉල්ලීම් පමණක් අවසර ඇත.

source: Feed not found.
si_lk: පෝෂණය හමු නොවීය.

source: Data pulled.
si_lk: දත්ත ඇද ගන්නා ලදී.

source: Could not pull the selected data. Reason: %s
si_lk: තෝරාගත් දත්ත අදින්නට නොහැකි විය. හේතුව: %s

source: Starting feed caching.
si_lk: සංග්‍රහ හැඹිලි කිරීම ආරම්භ කිරීම.

source: Caching the feeds has failed.
si_lk: සංග්‍රහ හැඹිලිගත කිරීම අසාර්ථක විය.

source: Caching the feeds has successfully completed.
si_lk: සංග්‍රහ හැඹිලිගත කිරීම සාර්ථකව සම්පූර්ණ කර ඇත.

source: Invalid feed list received.
si_lk: වලංගු නොවන සංග්‍රහ ලැයිස්තුවක් ලැබී ඇත.

source: Galaxies updated.
si_lk: Galaxies යාවත්කාලීන කරන ලදී.

source: Default galaxy clusters dropped.
si_lk: පෙරනිමි මන්දාකිණි පොකුරු පහත වැටුණි.

source: Galaxy deleted
si_lk: Galaxy මකන ලදී

source: Could not delete Galaxy.
si_lk: Galaxy මැකීමට නොහැකි විය.

source: Galaxy enabled
si_lk: Galaxy සබල කර ඇත

source: Could not enable Galaxy.
si_lk: Galaxy සබල කිරීමට නොහැකි විය.

source: Only one import field can be used at a time
si_lk: වරකට භාවිතා කළ හැක්කේ එක් ආයාත ක්ෂේත්‍රයක් පමණි

source: Galaxy clusters imported. %s imported, %s ignored, %s failed. %s
si_lk: Galaxy පොකුරු ආනයනය කරන ලදී. %s ආනයනය කරන ලදී, %s නොසලකා හරින ලදී, %s අසාර්ථක විය. %s

source: Could not import galaxy clusters. %s imported, %s ignored, %s failed. %s
si_lk: මන්දාකිණි පොකුරු ආයාත කිරීමට නොහැකි විය. %s ආනයනය කරන ලදී, %s නොසලකා හරින ලදී, %s අසාර්ථක විය. %s

source: This action is only accessible via a REST request.
si_lk: මෙම ක්‍රියාවට ප්‍රවේශ විය හැක්කේ REST ඉල්ලීමක් හරහා පමණි.

source: %s imported, %s ignored, %s failed. %s
si_lk: %s ආනයනය කරන ලදී, %s නොසලකා හරින ලදී, %s අසාර්ථක විය. %s

source: Galaxy clusters imported.
si_lk: Galaxy පොකුරු ආනයනය කරන ලදී.

source: Could not import galaxy clusters.
si_lk: මන්දාකිණි පොකුරු ආයාත කිරීමට නොහැකි විය.

source: All sharing groups
si_lk: සියලුම බෙදාගැනීමේ කණ්ඩායම්

source: All clusters
si_lk: සියලුම පොකුරු

source: All namespaces
si_lk: සියලුම නාම අවකාශ

source: Failed to parse request or no clusters picked.
si_lk: ඉල්ලීම විග්‍රහ කිරීමට අපොහොසත් විය හෝ පොකුරු තෝරාගෙන නොමැත.

source: Failed to parse request.
si_lk: ඉල්ලීම විග්‍රහ කිරීමට අසමත් විය.

source: Invalid blocklist entry
si_lk: වලංගු නොවන වාරණ ලැයිස්තු ඇතුළත් කිරීම

source: Invalid cluster IDs.
si_lk: වලංගු නොවන පොකුරු හැඳුනුම්පත්.

source: Failed to delete GalaxyCluster from GalaxyClusterBlocklist. Error:
si_lk: GalaxyClusterBlocklist වෙතින් GalaxyCluster මැකීමට අසමත් විය. දෝෂය:

source: Invalid cluster relation
si_lk: වලංගු නොවන පොකුරු සම්බන්ධතාවය

source: This method can only be accessed via RestSearch.
si_lk: මෙම ක්‍රමයට ප්‍රවේශ විය හැක්කේ RestSearch හරහා පමණි.

source: Relationship added.
si_lk: සම්බන්ධතාවය එකතු කරන ලදී.

source: Relationship could not be added.
si_lk: සම්බන්ධතාවය එකතු කළ නොහැකි විය.

source: Reason: %s
si_lk: හේතුව: %s

source: Default cluster relation cannot be edited
si_lk: පෙරනිමි පොකුරු සම්බන්ධතාවය සංස්කරණය කළ නොහැක

source: Galaxy Cluster Relation could not be saved: The user has to have access to the sharing group in order to be able to edit it.
si_lk: Galaxy Cluster Relation සුරැකීමට නොහැකි විය: පරිශීලකයාට එය සංස්කරණය කිරීමට හැකි වීම සඳහා බෙදාගැනීමේ කණ්ඩායමට ප්‍රවේශය තිබිය යුතුය.

source: Relation not found.
si_lk: සම්බන්ධය හමු නොවීය.

source: Galaxy cluster relationship successfuly deleted.
si_lk: Galaxy පොකුරු සම්බන්ධතාවය සාර්ථකව මකා ඇත.

source: Galaxy cluster relationship could not be deleted.
si_lk: Galaxy පොකුරු සම්බන්ධතාව මැකීමට නොහැකි විය.

source: This cluster is not published. Users will not be able to use it
si_lk: මෙම පොකුර ප්‍රකාශනය කර නැත. පරිශීලකයින්ට එය භාවිතා කිරීමට නොහැකි වනු ඇත

source: Invalid galaxy
si_lk: වලංගු නොවන මන්දාකිණිය

source: Invalid JSON
si_lk: වලංගු නොවන JSON

source: Galaxy cluster saved
si_lk: Galaxy පොකුර සුරකින ලදී
