Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: Keep in mind that all e-mails sent through this system will, in addition to your own message, will be signed in the name of the instance's host organisation's support team, will include the e-mail address of the instance's support (if the contact field is set in the bootstrap file), and will include the instance's GnuPG signature for users that have a GnuPG key set (and thus are eligible for an encrypted e-mail).
si_lk: මෙම පද්ධතිය හරහා යවන සියලුම විද්‍යුත් තැපෑල, ඔබේම පණිවිඩයට අමතරව, අවස්ථාවෙහි සත්කාරක සංවිධානයේ සහායක කණ්ඩායමේ නමට අත්සන් කෙරෙනු ඇති බව මතක තබා ගන්න, උදාහරණයේ සහායක විද්‍යුත් තැපැල් ලිපිනය ඇතුළත් වනු ඇත (සම්බන්ධතා නම් ක්ෂේත්‍රය bootstrap ගොනුවේ සකසා ඇත), සහ GnuPG යතුරු කට්ටලයක් ඇති (එමගින් සංකේතාත්මක විද්‍යුත් තැපෑලකට සුදුසුකම් ලබන) පරිශීලකයින් සඳහා උදාහරණයේ GnuPG අත්සන ඇතුළත් වේ.

source: Managing the roles
si_lk: භූමිකාවන් කළමනාකරණය කිරීම

source: Privileges are assigned to users by assigning them to rule groups, which use one of four options determining what they can do with events and four additional privilege elevating settings. The four options for event manipulation are: Read Only, Manage My Own Events, Manage Organisation Events, Manage &amp; Publish Organisation Events. The extra privileges are admin, sync, authentication key usage and audit permission
si_lk: සිද්ධි සහ අමතර වරප්‍රසාද ඉහළ නැංවීමේ සිටුවම් හතරකින් ඔවුන්ට කළ හැකි දේ තීරණය කරන විකල්ප හතරෙන් එකක් භාවිත කරන රීති කණ්ඩායම් වෙත පැවරීමෙන් පරිශීලකයින්ට වරප්‍රසාද පවරනු ලැබේ. සිදුවීම් හැසිරවීම සඳහා විකල්ප හතර නම්: කියවීමට පමණක්, මගේම සිදුවීම් කළමනාකරණය කරන්න, සංවිධාන සිදුවීම් කළමනාකරණය කරන්න, &amp; ප්‍රකාශන සංවිධාන සිදුවීම් කළමනාකරණය කරන්න. අමතර වරප්‍රසාද වන්නේ පරිපාලක, සමමුහුර්තකරණය, සත්‍යාපන යතුරු භාවිතය සහ විගණන අවසරයයි

source: Read Only
si_lk: කියවන්න පමණයි

source: This allows the user to browse events that his organisation has access to, but doesn't allow any changes to be made to the database.
si_lk: මෙය පරිශීලකයාට ඔහුගේ සංවිධානයට ප්‍රවේශය ඇති සිදුවීම් පිරික්සීමට ඉඩ සලසයි, නමුත් දත්ත සමුදායට කිසිදු වෙනසක් කිරීමට ඉඩ නොදේ.

source: Manage My Own Events
si_lk: මගේම සිදුවීම් කළමනාකරණය කරන්න

source: The second option, gives its users rights to create, modify or delete their own events, but they cannot publish them.
si_lk: දෙවන විකල්පය, එහි පරිශීලකයින්ට ඔවුන්ගේම සිදුවීම් නිර්මාණය කිරීමට, වෙනස් කිරීමට හෝ මකා දැමීමට අයිතිය ලබා දෙයි, නමුත් ඔවුන්ට ඒවා ප්‍රකාශයට පත් කළ නොහැක.

source: Manage Organization Events
si_lk: සංවිධානයේ සිදුවීම් කළමනාකරණය කරන්න

source: Allows users to create events or modify and delete events created by a member of their organisation.
si_lk: පරිශීලකයින්ට සිදුවීම් සෑදීමට හෝ ඔවුන්ගේ සංවිධානයේ සාමාජිකයෙකු විසින් නිර්මාණය කරන ලද සිදුවීම් වෙනස් කිරීමට සහ මකා දැමීමට ඉඩ ලබා දේ.

source: Manage &amp; Publish Organisation Events
si_lk: ප්‍රකාශන සංවිධාන සිදුවීම් &amp; ක් කළමනාකරණය කරන්න

source: This last setting, gives users the right to do all of the above and also to publish the events of their organisation.
si_lk: මෙම අවසාන සැකසුම, පරිශීලකයින්ට ඉහත සියල්ල කිරීමට සහ ඔවුන්ගේ සංවිධානයේ සිදුවීම් ප්‍රකාශ කිරීමට අයිතිය ලබා දෙයි.

source: Perm sync
si_lk: පර්ම් සමමුහුර්ත කිරීම

source: This setting allows the users of the role to be used as a synchronisation user. The authentication key of this user can be handed out to the administrator of a remote MISP instance to allow the synchronisation features to work.
si_lk: මෙම සැකසුම භූමිකාවේ පරිශීලකයින්ට සමමුහුර්ත පරිශීලකයෙකු ලෙස භාවිතා කිරීමට ඉඩ සලසයි. සමමුහුර්ත කිරීමේ විශේෂාංග ක්‍රියා කිරීමට ඉඩ දීම සඳහා මෙම පරිශීලකයාගේ සත්‍යාපන යතුර දුරස්ථ MISP අවස්ථාවක පරිපාලක වෙත භාර දිය හැක.

source: This setting enables the authentication key of the role's users to be used for rest requests.
si_lk: මෙම සැකසුම භූමිකාවේ පරිශීලකයන්ගේ සත්‍යාපන යතුර විවේක ඉල්ලීම් සඳහා භාවිත කිරීමට සබල කරයි.

source: Perm admin
si_lk: පර්ම් පරිපාලක

source: Gives the user limited administrator privileges, this setting is used for the organisation admins
si_lk: පරිශීලකයාට සීමිත පරිපාලක වරප්‍රසාද ලබා දෙයි, මෙම සැකසුම සංවිධානයේ පරිපාලකයින් සඳහා භාවිතා වේ

source: Perm site admin
si_lk: පර්ම් අඩවි පරිපාලක

source: Gives the user full administrator privileges, this setting is used for the site admins.
si_lk: පරිශීලකයාට සම්පූර්ණ පරිපාලක වරප්‍රසාද ලබා දෙයි, මෙම සැකසුම අඩවි පරිපාලකයින් සඳහා භාවිතා වේ.

source: Perm audit
si_lk: පර්ම් විගණනය

source: Grants access to the logs. With the exception of site admins, only logs generated by the user's own org are visible.
si_lk: ලඝු-සටහන් වෙත ප්රවේශය ලබා දෙයි. අඩවි පරිපාලකයින් හැර, පරිශීලකයාගේම org මගින් ජනනය කරන ලද ලොග පමණක් දෘශ්‍යමාන වේ.

source: Perm regexp access
si_lk: Perm regexp ප්රවේශය

source: Allows the users with this permission enabled to edit the regular expression table. Be careful when giving out this permission, incorrect regular expressions can be very harmful (infinite loops, loss of data, etc.).
si_lk: මෙම අවසරය සක්‍රීය කර ඇති පරිශීලකයින්ට සාමාන්‍ය ප්‍රකාශන වගුව සංස්කරණය කිරීමට ඉඩ දෙන්න. මෙම අවසරය ලබා දීමේදී ප්‍රවේශම් වන්න, වැරදි නිත්‍ය ප්‍රකාශන ඉතා හානිකර විය හැක (අසීමිත ලූප, දත්ත නැතිවීම, ආදිය).

source: Perm tagger
si_lk: පර්ම් ටැගර්

source: Allows the user with this permission to create custom tags and assign them to events.
si_lk: මෙම අවසරය ඇති පරිශීලකයාට අභිරුචි ටැග් සෑදීමට සහ ඒවා සිදුවීම් වෙත පැවරීමට ඉඩ දෙන්න.

source: Creating roles
si_lk: භූමිකාවන් නිර්මාණය කිරීම

source: When creating a new role, you will have to enter a name for the role to be created and set up the permissions (as described above) using the radio toggle and the four check-boxes.
si_lk: නව භූමිකාවක් නිර්මාණය කිරීමේදී, ඔබ විසින් නිර්මාණය කළ යුතු භූමිකාව සඳහා නමක් ඇතුළත් කර රේඩියෝ ටොගල් සහ පිරික්සුම් කොටු හතර භාවිතයෙන් අවසර (ඉහත විස්තර කර ඇති පරිදි) සැකසීමට සිදුවේ.

source: Listing roles
si_lk: භූමිකාවන් ලැයිස්තුගත කිරීම

source: By clicking on the List Roles button, you can view a list of all the currently registered roles and a list of the permission flags turned on for each. In addition, you can find buttons that allow you to edit and delete the roles. Keep in mind that you will need to first remove every member from a role before you can delete it.
si_lk: ලැයිස්තු භූමිකාවන් බොත්තම ක්ලික් කිරීමෙන්, ඔබට දැනට ලියාපදිංචි වී ඇති සියලුම භූමිකාවන්ගේ ලැයිස්තුවක් සහ එක් එක් සඳහා සක්‍රිය කර ඇති අවසර සලකුණු ලැයිස්තුවක් නැරඹිය හැකිය. ඊට අමතරව, ඔබට භූමිකාවන් සංස්කරණය කිරීමට සහ මකා දැමීමට ඉඩ සලසන බොත්තම් සොයාගත හැකිය. ඔබට භූමිකාවක් මකා දැමීමට පෙර සෑම සාමාජිකයෙකුම එයින් ඉවත් කිරීමට අවශ්‍ය බව මතක තබා ගන්න.

source: List roles
si_lk: භූමිකාවන් ලැයිස්තුගත කරන්න

source: You can View, Edit or Delete roles using the action buttons to the right in each row. Keep in mind that a role has to be devoid of members before it can be deleted.
si_lk: ඔබට එක් එක් පේළියේ දකුණට ඇති ක්‍රියා බොත්තම් භාවිතයෙන් භූමිකාවන් බැලීමට, සංස්කරණය කිරීමට හෝ මකා දැමීමට හැකිය. භූමිකාවක් මකා දැමීමට පෙර සාමාජිකයින්ගෙන් තොර විය යුතු බව මතක තබා ගන්න.

source: Using the logs of MISP
si_lk: MISP හි ලඝු-සටහන් භාවිතා කිරීම

source: Users with audit permissions are able to browse or search the logs that MISP automatically appends each time certain actions are taken (actions that modify data or if a user logs in and out).
si_lk: විගණන අවසර ඇති පරිශීලකයින්ට යම් යම් ක්‍රියාමාර්ග ගන්නා සෑම අවස්ථාවකම MISP ස්වයංක්‍රීයව එකතු කරන ලඝු-සටහන් බ්‍රවුස් කිරීමට හෝ සෙවීමට හැකිය (දත්ත වෙනස් කරන ක්‍රියා හෝ පරිශීලකයෙකු ඇතුළු වී පිටතට ගියහොත්).

source: Generally, the following actions are logged
si_lk: සාමාන්‍යයෙන්, පහත ක්‍රියා සටහන් කර ඇත

source: Creation, deletion, modification, Login / Logout
si_lk: නිර්මාණය, මකාදැමීම, වෙනස් කිරීම, පුරනය වීම / පිටවීම

source: Creation, deletion, modification, publishing
si_lk: නිර්මාණය, මකාදැමීම, වෙනස් කිරීම, ප්‍රකාශනය

source: Creation, deletion, modification
si_lk: නිර්මාණය, මකාදැමීම, වෙනස් කිරීම

source: ShadowAttribute
si_lk: ShadowAtribute

source: Creation, deletion, Accept, Discard
si_lk: නිර්මාණය, මකාදැමීම, පිළිගන්න, ඉවතලන්න

source: Allowedlist
si_lk: අවසර ලත් ලැයිස්තුව

source: Browsing the logs
si_lk: ලඝු-සටහන් පිරික්සීම

source: Listing all the log entries will show the following columns generated by the users of your organisation (or all organisations in the case of site admins)
si_lk: සියලුම ලොග් ඇතුළත් කිරීම් ලැයිස්තුගත කිරීමෙන් ඔබේ සංවිධානයේ පරිශීලකයන් විසින් ජනනය කරන ලද පහත තීරු පෙන්වනු ඇත (හෝ අඩවි පරිපාලකයින් සම්බන්ධයෙන් සියලුම සංවිධාන)

source: List logs
si_lk: ලොග ලැයිස්තු

source: Here you can view a list of all logged actions.
si_lk: මෙහිදී ඔබට ලොග් වූ සියලුම ක්‍රියා ලැයිස්තුවක් නැරඹිය හැක.

source: The automatically assigned ID number of the entry.
si_lk: ඇතුල්වීමේ ස්වයංක්‍රීයව පවරන ලද හැඳුනුම් අංකය.

source: The e-mail address of the user whose actions triggered the entry.
si_lk: ක්‍රියාවන් ප්‍රවේශය අවුලුවාලූ පරිශීලකයාගේ විද්‍යුත් තැපැල් ලිපිනය.

source: The organisation of the above mentioned user.
si_lk: ඉහත සඳහන් කළ පරිශීලකයාගේ සංවිධානය.

source: The date and time when the entry originated.
si_lk: ප්‍රවේශය ආරම්භ වූ දිනය සහ වේලාව.

source: The action's type. This can include: login/logout for users, add, edit, delete for events, attributes, users and servers.
si_lk: ක්‍රියාවේ වර්ගය. මෙයට ඇතුළත් විය හැකිය: පරිශීලකයින් සඳහා පුරනය වීම/ලොග්අවුට් වීම, සිදුවීම් සඳහා එකතු කිරීම, සංස්කරණය කිරීම, මකා දැමීම, ගුණාංග, පරිශීලකයින් සහ සේවාදායකයන්.

source: The title of an event always includes the target type (Event, User, Attribute, Server), the target's ID and the target's name (for example: e-mail address for users, event description for events).
si_lk: සිදුවීමක මාතෘකාවට සෑම විටම ඉලක්ක වර්ගය (සිදුවීම, පරිශීලක, ගුණාංගය, සේවාදායකය), ඉලක්කයේ හැඳුනුම්පත සහ ඉලක්කයේ නම (උදාහරණයක් ලෙස: පරිශීලකයින් සඳහා විද්‍යුත් තැපැල් ලිපිනය, සිදුවීම් සඳහා සිදුවීම් විස්තරය) ඇතුළත් වේ.

source: This field is only filled out for entries with the action being add or edit. The changes are detailed in the following format
si_lk: මෙම ක්ෂේත්‍රය පුරවන්නේ එකතු කිරීම හෝ සංස්කරණය කිරීම යන ක්‍රියාව සහිත ඇතුළත් කිරීම් සඳහා පමණි. වෙනස්කම් පහත ආකෘතියෙන් විස්තර කෙරේ

source: When the entry is about the creation of a new item (such as adding a new event) then the change will look like this for example
si_lk: ප්‍රවේශය නව අයිතමයක් නිර්මාණය කිරීම (නව සිදුවීමක් එක් කිරීම වැනි) වන විට, වෙනස මේ ආකාරයට පෙනෙනු ඇත.

source: Search log
si_lk: සෙවුම් ලොගය

source: You can search the logs using this form, narrow down your search by filling out several fields.
si_lk: ඔබට මෙම පෝරමය භාවිතයෙන් ලඝු-සටහන් සෙවිය හැක, ක්ෂේත්‍ර කිහිපයක් පිරවීමෙන් ඔබගේ සෙවුම පටු කරන්න.

source: Searching the Logs
si_lk: ලඝු-සටහන් සෙවීම

source: Another way to browse the logs is to search it by filtering the results according to the following fields (the search is a sub-string search, the sub-string has to be an exact match for the entry in the field that is being searched for)
si_lk: ලඝු-සටහන් බ්‍රවුස් කිරීමට තවත් ක්‍රමයක් නම්, පහත ක්ෂේත්‍රවලට අනුව ප්‍රතිඵල පෙරීමෙන් එය සෙවීමයි (සෙවීම උප-තන්ත්‍ර සෙවීමකි, උප-තන්තුව සොයන ක්ෂේත්‍රයේ ප්‍රවේශය සඳහා හරියටම ගැළපීමක් විය යුතුය. )

source: By searching by Email, it is possible to view the log entries of a single user.
si_lk: විද්‍යුත් තැපෑලෙන් සෙවීමෙන්, තනි පරිශීලකයෙකුගේ ලොග් සටහන් බැලීමට හැකිය.

source: Searching for an organisation allows you to see all actions taken by any member of the organisation.
si_lk: සංවිධානයක් සඳහා සෙවීම ඔබට සංවිධානයේ ඕනෑම සාමාජිකයෙකු විසින් ගනු ලබන සියලුම ක්‍රියා බැලීමට ඉඩ සලසයි.

source: With the help of this drop down menu, you can search for various types of actions taken (such as logins, deletions, etc).
si_lk: මෙම පතන මෙනුව ආධාරයෙන්, ඔබට විවිධ ආකාරයේ ක්‍රියා (පිවිසුම්, මකාදැමීම්, ආදිය) සෙවිය හැක.

source: There are several ways in which to use this field, since the title fields contain several bits of information and the search searches for any substrings contained within the field, it is possible to just search for the ID number of a logged event, the username / server's name / event's name / attribute's name of the event target.
si_lk: මෙම ක්ෂේත්‍රය භාවිතා කිරීමට ක්‍රම කිහිපයක් ඇත, මාතෘකා ක්ෂේත්‍රවල තොරතුරු බිටු කිහිපයක් අඩංගු වන නිසා සහ ක්ෂේත්‍රය තුළ අඩංගු ඕනෑම උපසිරැසි සඳහා සෙවුම් සෙවුම් කරන බැවින්, ලොග් වූ සිදුවීමක ID අංකය, පරිශීලක නාමය / සෙවිය හැකිය. සේවාදායකයේ නම / සිදුවීමේ නම / සිද්ධි ඉලක්කයේ ගුණාංගයේ නම.

source: With the help of this field, you can search for various specific changes or changes to certain variables (such as published will find all the log entries where an event has gotten published, ip-src will find all attributes where a source IP address has been entered / edited, etc).
si_lk: මෙම ක්ෂේත්‍රයේ සහාය ඇතිව, ඔබට විවිධ විශේෂිත වෙනස්කම් හෝ යම් යම් විචල්‍යවල වෙනස්කම් සඳහා සෙවිය හැකිය (ප්‍රකාශනය වැනි සිදුවීම් ප්‍රකාශනය කර ඇති සියලුම ලොග් සටහන් සොයා ගනී, ip-src මූලාශ්‍ර IP ලිපිනයක් ඇති සියලුම ගුණාංග සොයා ගනී. ඇතුළු කරන ලද / සංස්කරණය කරන ලද, ආදිය).

source: MISP has a couple of administrative tools that help administrators keep their instance up to date and healthy. The list of these small tools can change rapidly with each new version, but they should be self-explanatory. Make sure to check this section after upgrading to a new version, just in case there is a new upgrade script in there - though if this is the case it will be mentioned in the upgrade instructions.
si_lk: MISP සතුව පරිපාලකයින්ට ඔවුන්ගේ අවස්ථාව යාවත්කාලීනව සහ සෞඛ්‍ය සම්පන්නව තබා ගැනීමට උපකාර වන පරිපාලන මෙවලම් කිහිපයක් ඇත. මෙම කුඩා මෙවලම් ලැයිස්තුව එක් එක් නව අනුවාදය සමඟ වේගයෙන් වෙනස් විය හැක, නමුත් ඒවා ස්වයං-පැහැදිලි කළ යුතුය. නව අනුවාදයකට උත්ශ්‍රේණි කිරීමෙන් පසු මෙම කොටස පරීක්ෂා කිරීමට වග බලා ගන්න, එහි නව උත්ශ්‍රේණිගත ස්ක්‍රිප්ට් එකක් තිබේ නම් - මෙය එසේ නම් එය උත්ශ්‍රේණිගත කිරීමේ උපදෙස් වල සඳහන් වේ.

source: If enabled, MISP can delegate a lot of the time intensive tasks to the background workers. These will then be executed in order, allowing the users of the instance to keep using the system without a hiccup and without having to wait for the process to finish. It also allows for certain tasks to be scheduled and automated.
si_lk: සක්‍රීය කර ඇත්නම්, MISP හට පසුබිම් සේවකයන්ට බොහෝ වේලාවක් තීව්‍ර කාර්යයන් පැවරිය හැක. මේවා පසුව පිළිවෙලට ක්‍රියාත්මක වනු ඇත, එම අවස්ථාව භාවිතා කරන්නන්ට බාධාවකින් තොරව සහ ක්‍රියාවලිය අවසන් වන තෙක් බලා සිටීමකින් තොරව පද්ධතිය දිගටම භාවිතා කිරීමට ඉඩ සලසයි. එය ඇතැම් කාර්යයන් කාලසටහන්ගත කිරීමට සහ ස්වයංක්‍රීය කිරීමට ද ඉඩ සලසයි.

source: Command Line Tools for the Background Workers
si_lk: පසුබිම් සේවකයින් සඳහා විධාන රේඛා මෙවලම්

source: The background workers are powered by <a href="https://github.com/kamisama/Cake-Resque">CakeResque</a>, so all of the CakeResque commands work. To start all of the workers needed by MISP go to your <code>/var/www/MISP/app/Console/worker</code> (assuming a standard installation path) and execute start.sh. To interact with the workers, here is a list of useful commands. Go to your <code>/var/www/MISP/app/Console</code> (assuming a standard installation path) and execute one of the following commands as a parameter to <code>./cake CakeResque.CakeResque</code> (for example: <code>./cake CakeResque.CakeResque tail</code>)
si_lk: පසුබිම් සේවකයින් <a href="https://github.com/kamisama/Cake-Resque">CakeResque</a>මගින් බලගන්වනු ලැබේ, එබැවින් CakeResque විධාන සියල්ල ක්‍රියා කරයි. MISP විසින් අවශ්‍ය සියලුම කම්කරුවන් ආරම්භ කිරීමට ඔබගේ <code>/var/www/MISP/app/Console/worker</code> වෙත ගොස් (සම්මත ස්ථාපන මාර්ගයක් උපකල්පනය කරමින්) start.sh ක්‍රියාත්මක කරන්න. කම්කරුවන් සමඟ අන්තර් ක්‍රියා කිරීමට, මෙන්න ප්‍රයෝජනවත් විධාන ලැයිස්තුවක්. ඔබගේ <code>/var/www/MISP/app/Console</code> වෙත යන්න (සම්මත ස්ථාපන මාර්ගයක් උපකල්පනය කරමින්) සහ <code>./cake CakeResque.CakeResque</code> වෙත පරාමිතියක් ලෙස පහත විධානයන්ගෙන් එකක් ක්‍රියාත්මක කරන්න (උදාහරණයක් ලෙස: <code>./cake CakeResque .කේක් රෙස්ක් වලිගය</code>)

source: tail
si_lk: වලිගය

source: tail the various log files that CakeResque creates, just choose the one from the list that you are interested in.
si_lk: CakeResque නිර්මාණය කරන විවිධ ලඝු-සටහන් ගොනු, ඔබ කැමති ලැයිස්තුවෙන් එකක් තෝරන්න.

source: cleanup
si_lk: ඉවර කරන්න

source: terminate the job that a worker is working on immediately. You will be presented with a choice of workers to choose from when executing this command.
si_lk: සේවකයෙකු වැඩ කරන රැකියාව වහාම අවසන් කරන්න. මෙම විධානය ක්‍රියාත්මක කිරීමේදී ඔබට තෝරා ගැනීමට කම්කරුවන් තේරීමක් ඉදිරිපත් කරනු ඇත.

source: clear
si_lk: පැහැදිලිව

source: Clear the queue of a worker immediately.
si_lk: සේවකයෙකුගේ පෝලිම වහාම ඉවත් කරන්න.

source: stats
si_lk: සංඛ්යාලේඛන

source: shows some statistics about your workers including the count of successful and failed jobs.
si_lk: සාර්ථක සහ අසාර්ථක රැකියා ගණන ඇතුළුව ඔබේ සේවකයන් පිළිබඳ සමහර සංඛ්‍යාලේඛන පෙන්වයි.

source: The other commands should not be needed, instead of starting / stopping or restarting workers use the supplied start.sh (it stops all workers and starts them all up again). For further instructions on how to use the console commands for the workers, visit the <a href="http://cakeresque.kamisama.me/commands#cleanup">CakeResque list of commands</a>.
si_lk: අනෙකුත් විධානයන් අවශ්‍ය නොවිය යුතුය, සේවකයින් ආරම්භ කිරීම / නැවැත්වීම හෝ නැවත ආරම්භ කිරීම වෙනුවට සපයන ලද start.sh භාවිතා කරන්න (එය සියලුම කම්කරුවන් නවතා ඔවුන් සියල්ල නැවත ආරම්භ කරයි). කම්කරුවන් සඳහා කොන්සෝල විධාන භාවිතා කරන ආකාරය පිළිබඳ වැඩිදුර උපදෙස් සඳහා, <a href="http://cakeresque.kamisama.me/commands#cleanup">CakeResque විධාන ලැයිස්තුව</a>වෙත පිවිසෙන්න.

source: Monitoring the Background Processes
si_lk: පසුබිම් ක්‍රියාවලි නිරීක්ෂණය කිරීම

source: The "Jobs" menu item within the Administration menu allows site admins to get an overview of all of the currently and in the past scheduled jobs. Admins can see the status of each job, and what the queued job is trying to do. If a job fails, it will try to set an error message here too. The following columns are shown in the jobs table
si_lk: පරිපාලන මෙනුව තුළ ඇති "රැකියා" මෙනු අයිතමය අඩවි පරිපාලකයින්ට දැනට සහ පසුගිය කාලසටහන්ගත කළ රැකියා සියල්ල පිළිබඳ දළ විශ්ලේෂණයක් ලබා ගැනීමට ඉඩ සලසයි. පරිපාලකයින්ට එක් එක් රැකියාවේ තත්ත්‍වය සහ පෝලිම්ගත රැකියාව කිරීමට උත්සාහ කරන දේ දැක ගත හැක. කාර්යයක් අසාර්ථක වුවහොත්, එය මෙහි දෝෂ පණිවිඩයක් සැකසීමට උත්සාහ කරයි. රැකියා වගුවේ පහත තීරු පෙන්වා ඇත

source: The job's ID (this is the ID of the job's meta-data stored in the default data-store, not to be confused with the process ID stored in the redis database and used by the workers.)
si_lk: රැකියා හැඳුනුම්පත (මෙය පෙරනිමි දත්ත ගබඩාවේ ගබඩා කර ඇති රැකියාවේ පාර-දත්තවල ID වේ, redis දත්ත ගබඩාවේ ගබඩා කර ඇති සහ කම්කරුවන් විසින් භාවිතා කරන ක්‍රියාවලි ID සමඟ පටලවා නොගත යුතුය.)

source: Process
si_lk: ක්රියාවලිය

source: The process's ID.
si_lk: ක්‍රියාවලියේ ID.

source: The name of the worker queue. There are 3+1 workers running if background jobs are enabled: default, cache, email, and a special Scheduler (this should never show up in the jobs table).
si_lk: සේවක පෝලිමේ නම. පසුබිම් රැකියා සබල කර ඇත්නම් 3+1 කම්කරුවන් ක්‍රියාත්මක වේ: පෙරනිමිය, හැඹිලිය, විද්‍යුත් තැපෑල සහ විශේෂ උපලේඛනය (මෙය කිසි විටෙක රැකියා වගුවේ නොපෙන්විය යුතුය).

source: Job Type
si_lk: රැකියා වර්ගය

source: The name of the queued job.
si_lk: පෝලිම් කළ රැකියාවේ නම.

source: Shows a basic input handled by the job - such as "Event:50" for a publish email alert job for event 50.
si_lk: සිදුවීම 50 සඳහා ප්‍රකාශන විද්‍යුත් තැපැල් ඇඟවීම් කාර්යයක් සඳහා "සිදුවීම:50" වැනි - කාර්යය විසින් හසුරුවන මූලික ආදානයක් පෙන්වයි.

source: This will show what the job is currently doing or alternatively an error message describing why a job failed.
si_lk: මෙය රැකියාව දැනට කරන්නේ කුමක්ද යන්න හෝ විකල්පයක් ලෙස රැකියාවක් අසාර්ථක වීමට හේතුව විස්තර කරන දෝෂ පණිවිඩයක් පෙන්වයි.

source: The string identifier of the organisation that has scheduled the job.
si_lk: කාර්යය කාලසටහන් කර ඇති සංවිධානයේ තන්තු හඳුනාගැනීම.

source: The status reported by the worker.
si_lk: සේවකයා විසින් වාර්තා කරන ලද තත්ත්වය.

source: A progress bar showing how the job is coming along.
si_lk: රැකියාව ඉදිරියට එන ආකාරය පෙන්වන ප්‍රගති තීරුවක්.

source: Scheduling Jobs and Recurring Jobs
si_lk: රැකියා උපලේඛනගත කිරීම සහ පුනරාවර්තන රැකියා

source: Apart from off-loading long-lasting jobs to the background workers, there is a second major benefit of enabling the background workers: Site-administrators can schedule recurring tasks for the jobs that generally take the longest to execute. At the moment this includes pushing / pulling other instances and generating a full export cache for every organisation and export type. MISP comes with these 3 tasks pre-defined, but further tasks are planned. The following fields make up the scheduled tasks table
si_lk: පසුබිම් සේවකයින්ට දිගුකාලීන රැකියා පැටවීමට අමතරව, පසුබිම් සේවකයින් සක්‍රීය කිරීමේ දෙවන ප්‍රධාන ප්‍රතිලාභයක් ඇත: අඩවි පරිපාලකයින්ට සාමාන්‍යයෙන් ක්‍රියාත්මක කිරීමට වැඩිම කාලයක් ගත වන රැකියා සඳහා පුනරාවර්තන කාර්යයන් උපලේඛනගත කළ හැකිය. මේ මොහොතේ මෙයට අනෙකුත් අවස්ථා තල්ලු කිරීම / අදින්න සහ සෑම ආයතනයක් සහ අපනයන වර්ගයක් සඳහාම සම්පූර්ණ අපනයන හැඹිලියක් ජනනය කිරීම ඇතුළත් වේ. MISP මෙම කාර්යයන් 3 පෙර-නිර්වචනය කර ඇත, නමුත් වැඩිදුර කාර්යයන් සැලසුම් කර ඇත. පහත ක්ෂේත්‍ර මඟින් නියමිත කාර්ය වගුව සාදයි

source: The ID of the task.
si_lk: කාර්යයේ ID.

source: The type of the task.
si_lk: කාර්යයේ වර්ගය.

source: Frequency
si_lk: සංඛ්යාතය

source: This number sets how often the job should be executed in hours. Setting this to 168 and picking the next execution on Sunday at 01:00 would execute the task every Sunday at 1 AM. Setting this value to 0 will make the task only run once on the scheduled date / time without rescheduling it afterwards.
si_lk: මෙම අංකය පැය ගණනකින් කාර්යය කොපමණ වාරයක් ක්‍රියාත්මක කළ යුතුද යන්න සකසයි. මෙය 168 ලෙස සකසා ඉරිදා 01:00ට මීළඟ ක්‍රියාත්මක කිරීම තෝරා ගැනීම සෑම ඉරිදාවකම පෙ.ව. මෙම අගය 0 ලෙස සැකසීමෙන් පසුව එය නැවත කාලසටහන් කිරීමකින් තොරව නියමිත දිනට / වේලාවට කාර්යය එක් වරක් පමණක් ක්‍රියාත්මක වේ.

source: Scheduled Time
si_lk: නියමිත වේලාව

source: The time (in 24h format) when the task should be executed the next time it runs (and all consecutive times if a multiple of 24 is chosen for frequency).
si_lk: ඊළඟ වතාවේ එය ක්‍රියාත්මක වන විට කාර්යය ක්‍රියාත්මක කළ යුතු කාලය (පැය 24 ආකෘතියෙන්) (සහ සංඛ්‍යාතය සඳහා 24 හි ගුණිතයක් තෝරා ගන්නේ නම් අඛණ්ඩව සියලු වාර).

source: Next Run
si_lk: ඊළඟ ධාවනය

source: The date on which the task should be executed.
si_lk: කාර්යය ඉටු කළ යුතු දිනය.

source: A brief description of the task.
si_lk: කාර්යය පිළිබඳ කෙටි විස්තරයක්.

source: This field shows when the job was queued by the scheduler for execution.
si_lk: මෙම ක්ෂේත්‍රය මඟින් කාර්යය ක්‍රියාත්මක කිරීම සඳහා උපලේඛකයා විසින් පෝලිම් කළ විට පෙන්වයි.

source: Site administrators can schedule reccuring tasks on this page.
si_lk: අඩවි පරිපාලකයින්ට මෙම පිටුවෙහි පුනරාවර්තන කාර්යයන් උපලේඛනගත කළ හැක.

source: Frequently asked questions
si_lk: නිතර අසන ප්රශ්න

source: Losing access to the platform and resetting the password
si_lk: වේදිකාවට ප්රවේශය අහිමි වීම සහ මුරපදය යළි පිහිටුවීම

source: If you ever lock yourself out of MISP as a site admin, there is a command line tool to reset your password. This can also be handy if you have changed the salt key and invalidated all of the passwords.
si_lk: ඔබ කවදා හෝ අඩවි පරිපාලකයෙකු ලෙස MISP වෙතින් ඔබව අගුලු දමා ඇත්නම්, ඔබේ මුරපදය යළි පිහිටුවීමට විධාන රේඛා මෙවලමක් තිබේ. ඔබ ලුණු යතුර වෙනස් කර සියලු මුරපද අවලංගු කර ඇත්නම් මෙයද පහසු විය හැක.

source: Simply run the command
si_lk: සරලව විධානය ක්රියාත්මක කරන්න

source: my_new_password
si_lk: මගේ_නව_මුරපදය

source: This will create a new password hash using the currently set salt.
si_lk: මෙය දැනට සකසා ඇති ලුණු භාවිතයෙන් නව මුරපද හැෂ් එකක් සාදනු ඇත.

source: Attribute Categories and Types
si_lk: ගුණාංග කාණ්ඩ සහ වර්ග

source: Attribute Categories vs. Types
si_lk: ගුණාංග කාණ්ඩ එදිරිව වර්ග

source: Click here to get the .md version for gitbook generation.
si_lk: gitbook උත්පාදනය සඳහා .md අනුවාදය ලබා ගැනීමට මෙතන ක්ලික් කරන්න.

source: Admins and Site Admins
si_lk: පරිපාලකයින් සහ අඩවි පරිපාලකයින්
