Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: Options: Your organisation only, This community only, Connected communities, All communities, Sharing group, Inherit event
si_lk: විකල්ප: ඔබේ සංවිධානය පමණක්, මෙම ප්‍රජාව පමණක්, සම්බන්ධිත ප්‍රජාවන්, සියලුම ප්‍රජාවන්, බෙදාගැනීමේ කණ්ඩායම, උරුමය සිදුවීම

source: Invalid ISO 8601 format
si_lk: වලංගු නොවන ISO 8601 ආකෘතිය

source: Last seen value should be greater than first seen value
si_lk: අවසන් වරට දුටු අගය මුලින්ම දුටු අගයට වඩා වැඩි විය යුතුය

source: Value is already in the exclusion list.
si_lk: අගය දැනටමත් බැහැර කිරීමේ ලැයිස්තුවේ ඇත.

source: Expected date format: YYYY-MM-DD
si_lk: අපේක්ෂිත දින ආකෘතිය: YYYY-MM-DD

source: Options : 1, 2, 3, 4 (for High, Medium, Low, Undefined)
si_lk: විකල්ප : 1, 2, 3, 4 (ඉහළ, මධ්‍යම, පහත්, නිර්වචනය නොකළ සඳහා)

source: Options : Your organisation only, This community only, Connected communities, All communities
si_lk: විකල්ප: ඔබේ සංවිධානයට පමණක්, මෙම ප්‍රජාවට පමණක්, සම්බන්ධිත ප්‍රජාවන්ට, සියලුම ප්‍රජාවන්ට

source: If the distribution is set to "Sharing Group", a sharing group has to be selected.
si_lk: බෙදා හැරීම "බෙදාගැනීමේ කණ්ඩායම" ලෙස සකසා ඇත්නම්, බෙදාගැනීමේ කණ්ඩායමක් තෝරාගත යුතුය.

source: Options : 0, 1, 2 (for Initial, Ongoing, Completed)
si_lk: විකල්ප : 0, 1, 2 (ආරම්භක, ක්‍රියාත්මක, සම්පූර්ණ කරන ලද සඳහා)

source: Please provide a valid UUID
si_lk: කරුණාකර වලංගු UUID එකක් සපයන්න

source: Event already blocklisted.
si_lk: සිදුවීම දැනටමත් අවහිර කර ඇත.

source: The provided eventGraph is not a valid json format
si_lk: සපයන ලද EventGraph වලංගු json ආකෘතියක් නොවේ

source: rule
si_lk: නීතිය

source: Please enter a numeric event ID or leave this field blank.
si_lk: කරුණාකර සංඛ්‍යාත්මක සිදුවීම් හැඳුනුම්පතක් ඇතුළු කරන්න නැතහොත් මෙම ක්ෂේත්‍රය හිස්ව තබන්න.

source: Options: Your organisation only, This community only, Connected communities, All communities, Sharing group
si_lk: විකල්ප: ඔබේ සංවිධානය පමණක්, මෙම ප්‍රජාව පමණක්, සම්බන්ධිත ප්‍රජාවන්, සියලුම ප්‍රජාවන්, බෙදාගැනීමේ කණ්ඩායම

source: Galaxy Cluster already blocklisted.
si_lk: Galaxy Cluster දැනටමත් අවහිර ලැයිස්තුගත කර ඇත.

source: Options : ...
si_lk: විකල්ප : ...

source: A relationship with this name already exists.
si_lk: මෙම නම සමඟ සම්බන්ධතාවක් දැනටමත් පවතී.

source: Organisation already blocklisted.
si_lk: සංවිධානය දැනටමත් අවහිර කර ඇත.

source: An organisation with this name already exists.
si_lk: මෙම නම සහිත සංවිධානයක් දැනටමත් පවතී.

source: An organisation with this UUID already exists.
si_lk: මෙම UUID සහිත සංවිධානයක් දැනටමත් පවතී.

source: This is not a valid regular expression. Don't forget the delimiters!
si_lk: මෙය වලංගු නිත්‍ය ප්‍රකාශනයක් නොවේ. සීමා නිර්ණයන් අමතක කරන්න එපා!

source: A role with this name already exists.
si_lk: මෙම නම සහිත භූමිකාවක් දැනටමත් පවතී.

source: Please enter a valid base-url.
si_lk: කරුණාකර වලංගු මූලික url එකක් ඇතුළු කරන්න.

source: allowEmpty
si_lk: ඉඩ හිස්

source: required
si_lk: අවශ්යයි

source: A sharing group with this name already exists.
si_lk: මෙම නම සහිත බෙදාගැනීමේ කණ්ඩායමක් දැනටමත් පවතී.

source: Invalid type. Valid options are: 0 (Sighting), 1 (False-positive), 2 (Expiration).
si_lk: වලංගු නොවන වර්ගය. වලංගු විකල්ප වනුයේ: 0 (දසුන්), 1 (අසත්‍ය-ධනාත්මක), 2 (කල් ඉකුත්වීම).

source: Name not set.
si_lk: නම සකසා නැත.

source: Host not set.
si_lk: ධාරකය සකසා නැත.

source: Port needs to be numeric.
si_lk: වරාය සංඛ්‍යාත්මක විය යුතුය.

source: Owner not set.
si_lk: හිමිකරු සකසා නැත.

source: This field is required.
si_lk: මෙම ක්ෂේත්රය අවශ්යයි.

source: Colour has to be in the RGB format (#FFFFFF)
si_lk: වර්ණය RGB ආකෘතියෙන් තිබිය යුතුය (#FFFFFF)

source: Please choose a category.
si_lk: කරුණාකර ප්‍රවර්ගයක් තෝරන්න.

source: Please choose a type.
si_lk: කරුණාකර වර්ගයක් තෝරන්න.

source: Please enter a Name
si_lk: කරුණාකර නමක් ඇතුළත් කරන්න

source: Please enter a Description
si_lk: කරුණාකර විස්තරයක් ඇතුළු කරන්න

source: Please fill out the text field
si_lk: කරුණාකර පෙළ ක්ෂේත්‍රය පුරවන්න

source: Password length requirement not met.
si_lk: මුරපද දිග අවශ්‍යතාවය සපුරා නැත.

source: Password complexity requirement not met.
si_lk: මුරපද සංකීර්ණතා අවශ්‍යතාවය සපුරා නැත.

source: Please re-enter your password twice so that the values match.
si_lk: අගයන් ගැලපෙන පරිදි කරුණාකර ඔබගේ මුරපදය දෙවරක් නැවත ඇතුල් කරන්න.

source: The organisation ID has to be a numeric value.
si_lk: සංවිධාන හැඳුනුම්පත සංඛ්‍යාත්මක අගයක් විය යුතුය.

source: Please enter a valid email address.
si_lk: කරණාකර වලංගු ඊතැපැල් ලිපිනයක් ඇතුළු කරන්න.

source: An account with this email address already exists.
si_lk: මෙම ඊමේල් ලිපිනය සහිත ගිණුමක් දැනටමත් පවතී.

source: A authkey of a minimum length of 40 is required.
si_lk: අවම දිග 40 ක Autkey එකක් අවශ්‍ය වේ.

source: GnuPG key not valid, please enter a valid key.
si_lk: GnuPG යතුර වලංගු නැත, කරුණාකර වලංගු යතුරක් ඇතුළත් කරන්න.

source: Certificate not valid, please enter a valid certificate (x509).
si_lk: සහතිකය වලංගු නැත, කරුණාකර වලංගු සහතිකයක් ඇතුළු කරන්න (x509).

source: A SID should be an integer.
si_lk: SID එකක් පූර්ණ සංඛ්‍යාවක් විය යුතුය.

source: notEmpty
si_lk: හිස් නැත

source: Warninglist with same name already exists.
si_lk: එකම නම සහිත අනතුරු ඇඟවීමේ ලැයිස්තුව දැනටමත් පවතී.
