Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: The Malware Information Sharing Platform (MISP) is the tool which will be used to facilitate the exchange of Indicator of Compromise (IOC) about targeted malware and attacks within your community of trusted members. It is a central Indicator of Compromise (IOC) database with technical and non-technical information. Exchanging this information should result in faster detection of targeted attacks and improve the detection ratio, while also reducing the number of false positives.
si_lk: Malware Information Sharing Platform (MISP) යනු ඔබේ විශ්වාසවන්ත සාමාජිකයින්ගේ ප්‍රජාව තුළ ඉලක්ක කරගත් අනිෂ්ට මෘදුකාංග සහ ප්‍රහාර ක් පමණ සම්මුති දර්ශකය (IOC) හුවමාරු කර ගැනීමට පහසුකම් සැලසීමට භාවිතා කරන මෙවලමයි. එය තාක්ෂණික සහ තාක්ෂණික නොවන තොරතුරු ක් සහිත සම්මුති පිළිබඳ මධ්‍යම දර්ශකය (IOC) දත්ත ගබඩාවකි. මෙම තොරතුරු හුවමාරු කර ගැනීමෙන් ඉලක්කගත ප්‍රහාර වේගයෙන් අනාවරණය කර ගැනීම සහ හඳුනාගැනීමේ අනුපාතය වැඩිදියුණු කිරීම, ව්‍යාජ ධනාත්මක සංඛ්‍යාව අඩු කිරීම ද සිදු විය යුතුය.

source: Create an Event
si_lk: සිදුවීමක් සාදන්න

source: Browsing past Events
si_lk: අතීත සිදුවීම් පිරික්සීම

source: Export Events for logsearches
si_lk: ලඝු සෙවුම් සඳහා සිදුවීම් අපනයනය කරන්න

source: First run of the system
si_lk: පද්ධතියේ පළමු ධාවනය

source: Managing your account
si_lk: ඔබගේ ගිණුම කළමනාකරණය කිරීම

source: Staying up to date
si_lk: යාවත්කාලීනව සිටීම

source: User Management and Global Actions
si_lk: පරිශීලක කළමනාකරණය සහ ගෝලීය ක්‍රියා

source: When first logging into MISP with the username and password provided by your administrator, there are a number of things that need to be done, before you can start using the system.
si_lk: ඔබගේ පරිපාලක විසින් ලබා දී ඇති පරිශීලක නාමය සහ මුරපදය සමඟ MISP වෙත ප්‍රථමයෙන් ලොග් වන විට, ඔබ පද්ධතිය භාවිතා කිරීම ආරම්භ කිරීමට පෙර, කළ යුතු දේවල් ගණනාවක් තිබේ.

source: Accepting the Terms of use
si_lk: භාවිතයේ නියමයන් පිළිගැනීම

source: The terms of use are shown immediately after logging in for the first time, make sure to read through this page before clicking "Accept Terms" at the bottom of the page.
si_lk: පළමු වරට ලොග් වූ වහාම භාවිත නියමයන් පෙන්වනු ලැබේ, පිටුවේ පතුලේ ඇති "කොන්දේසි පිළිගන්න" ක්ලික් කිරීමට පෙර මෙම පිටුව කියවීමට වග බලා ගන්න.

source: Changing the password
si_lk: මුරපදය වෙනස් කිරීම

source: After accepting the ToU, you'll be prompted to change your password, but keep in mind that it has to be at least 6 characters long, it has to include at least one upper-case and one lower-case character in addition to a digit or a special character. Enter the same password into the confirm password field, before clicking submit to finalise the change.
si_lk: ToU පිළිගැනීමෙන් පසු, ඔබගේ මුරපදය වෙනස් කිරීමට ඔබෙන් විමසනු ඇත, නමුත් එය අවම වශයෙන් අක්ෂර 6ක් දිග විය යුතු බව මතක තබා ගන්න, එයට අමතරව අවම වශයෙන් එක් ලොකු අකුරක් සහ කුඩා අකුරු එක් අක්ෂරයක් ඇතුළත් කළ යුතුය. ඉලක්කම් හෝ විශේෂ චරිතයක්. වෙනස් කිරීම අවසන් කිරීමට ඉදිරිපත් කරන්න ක්ලික් කිරීමට පෙර, තහවුරු කිරීමේ මුරපද ක්ෂේත්‍රයට එම මුරපදය ඇතුළත් කරන්න.

source: Setting up the GnuPG Key
si_lk: GnuPG යතුර සැකසීම

source: In order for the system to be able to encrypt the messages that you send through it, it needs to know your GnuPG key. Navigate to the Edit profile view (My Profile on the left -&gt; Edit profile in the top right corner). Paste the key into the GnuPG field and click submit.
si_lk: පද්ධතියට ඔබ එවන පණිවිඩ සංකේතනය කිරීමට හැකි වීම සඳහා, එය ඔබගේ GnuPG යතුර දැන සිටිය යුතුය. සංස්කරණය පැතිකඩ දසුන වෙත සංචාලනය කරන්න (වම් පැත්තේ මගේ පැතිකඩ -&gt; ඉහළ දකුණු කෙළවරේ පැතිකඩ සංස්කරණය කරන්න). යතුර GnuPG ක්ෂේත්‍රයට අලවා ඉදිරිපත් කරන්න ක්ලික් කරන්න.

source: Subscribing to Auto-alerts
si_lk: ස්වයංක්‍රීය ඇඟවීම් සඳහා දායක වීම

source: Turning auto-alerts on will allow the system to send you e-mail notifications about any new public events entered into the system by other users and private events added by members of your organisation. To turn this on, navigate to the Edit profile view (My profile on the left navigation menu -&gt; Edit profile in the top right corner). Tick the auto-alert checkbox and click submit to enable this feature.
si_lk: ස්වයංක්‍රීය ඇඟවීම් ක්‍රියාත්මක කිරීම මඟින් පද්ධතියට වෙනත් පරිශීලකයන් විසින් පද්ධතියට ඇතුළු කරන ලද ඕනෑම නව පොදු සිදුවීම් සහ ඔබේ සංවිධානයේ සාමාජිකයන් විසින් එක් කරන ලද පුද්ගලික සිදුවීම් පිළිබඳ විද්‍යුත් තැපෑල දැනුම්දීම් යැවීමට පද්ධතියට ඉඩ සලසයි. මෙය සක්‍රිය කිරීමට, පැතිකඩ දර්ශනය සංස්කරණය කිරීමට සංචාලනය කරන්න (වම් සංචාලන මෙනුවේ මගේ පැතිකඩ -&gt; ඉහළ දකුණු කෙළවරේ පැතිකඩ සංස්කරණය කරන්න). මෙම විශේෂාංගය සබල කිරීමට ස්වයංක්‍රීය ඇඟවීම් සලකුණු කොටුව සලකුණු කර ඉදිරිපත් කරන්න ක්ලික් කරන්න.

source: Use these checkboxes to subscribe to auto-alerts and contact reporter e-mails.
si_lk: ස්වයංක්‍රීය ඇඟවීම් සහ සම්බන්ධතා වාර්තාකරු ඊමේල් වෙත දායක වීමට මෙම පිරික්සුම් කොටු භාවිතා කරන්න.

source: Subscribing to e-mails sent via the "Contact Reporter" functionality
si_lk: "සම්බන්ධතා වාර්තාකරු" ක්‍රියාකාරීත්වය හරහා යවන ලද විද්‍යුත් තැපෑලට දායක වීම

source: This feature is turned on right below the autoalerts and will allow you to receive e-mails addressed to your organisation whenever a user tries to ask about an event that was posted by a user of your organisation. Keep in mind that you can still be addressed by such a request even when this setting is turned off, if someone tries to contact you as the event creator directly or your organisation for an event that you personally have created then you will be notified.
si_lk: මෙම විශේෂාංගය ස්වයංක්‍රීය ඇඟවීම්වලට පහළින් ක්‍රියාත්මක කර ඇති අතර පරිශීලකයෙකු ඔබේ සංවිධානයේ පරිශීලකයෙකු විසින් පළ කරන ලද සිදුවීමක් ගැන විමසීමට උත්සාහ කරන සෑම විටම ඔබේ සංවිධානයට ඊමේල් ලබා ගැනීමට ඔබට ඉඩ සලසයි. මෙම සැකසුම ක්‍රියාවිරහිත කර තිබියදී පවා එවැනි ඉල්ලීමක් මඟින් ඔබට තවමත් ආමන්ත්‍රණය කළ හැකි බව මතක තබා ගන්න, යමෙකු ඔබ පුද්ගලිකව නිර්මාණය කළ සිදුවීමක් සඳහා සිදුවීම් නිර්මාපකයා ලෙස හෝ ඔබේ සංවිධානය ලෙස ඔබව සෘජුවම සම්බන්ධ කර ගැනීමට උත්සාහ කරන්නේ නම් එවිට ඔබට දැනුම් දෙනු ලැබේ.

source: Reviewing the Terms &amp; Conditions
si_lk: කොන්දේසි &amp; කොන්දේසි සමාලෝචනය කිරීම

source: o review the Terms &amp; Conditions or to read the User Guide, use the appropriate button on the left navigation menu.
si_lk: o කොන්දේසි &amp; සමාලෝචනය කරන්න හෝ පරිශීලක මාර්ගෝපදේශය කියවීමට, වම් සංචාලන මෙනුවේ සුදුසු බොත්තම භාවිතා කරන්න.

source: Making sure that compatibility mode is turned off (IE9&amp;IE10)
si_lk: ගැළපුම් මාදිලිය අක්‍රිය කර ඇති බවට වග බලා ගැනීම (IE9&amp;IE10)

source: Compatibility mode can cause some elements to appear differently than intended or not appear at all. Make sure you have this option turned off.
si_lk: ගැළපෙන මාදිලිය සමහර මූලද්‍රව්‍ය බලාපොරොත්තු වූවාට වඩා වෙනස් ලෙස දිස්වීමට හෝ කිසිසේත් නොපෙනීමට හේතු විය හැක. ඔබ මෙම විකල්පය අක්‍රිය කර ඇති බවට වග බලා ගන්න.

source: To alter any details regarding your profile, use the "My Profile" menu button to bring up the profile overview and then click on "Edit Profile" in the right upper corner.
si_lk: ඔබගේ පැතිකඩ සම්බන්ධ ඕනෑම විස්තරයක් වෙනස් කිරීමට, පැතිකඩ දළ විශ්ලේෂණය ගෙන ඒමට "මගේ පැතිකඩ" මෙනු බොත්තම භාවිතා කර දකුණු ඉහළ කෙළවරේ ඇති "පැතිකඩ සංස්කරණය කරන්න" මත ක්ලික් කරන්න.

source: Change any of your profile settings here.
si_lk: ඔබගේ ඕනෑම පැතිකඩ සැකසීම් මෙතැනින් වෙනස් කරන්න.

source: Changing your e-mail address
si_lk: ඔබගේ විද්‍යුත් තැපැල් ලිපිනය වෙනස් කිරීම

source: Your e-mail address serves as both a login name and as a means of communication with other users of the MISP system via the contact reporter feature. To change your e-mail address, just enter the edit profile menu (My profile on the left navigation menu -&gt; Edit profile in the top right corner) and change the field titled Email.
si_lk: ඔබගේ විද්‍යුත් තැපැල් ලිපිනය පිවිසුම් නාමයක් ලෙසත්, සම්බන්ධතා වාර්තාකරු විශේෂාංගය හරහා MISP පද්ධතියේ අනෙකුත් පරිශීලකයින් සමඟ සන්නිවේදන මාධ්‍යයක් ලෙසත් ක්‍රියා කරයි. ඔබගේ විද්‍යුත් තැපැල් ලිපිනය වෙනස් කිරීමට, සංස්කරණ පැතිකඩ මෙනුව ඇතුළත් කරන්න (වම් සංචාලන මෙනුවේ මගේ පැතිකඩ -&gt; ඉහළ දකුණු කෙළවරේ පැතිකඩ සංස්කරණය කරන්න) සහ ඊමේල් යන මාතෘකාව වෙනස් කරන්න.

source: As a next step, change the password provided by your administrator to something of your own choosing. Click on My profile on the left navigation menu, under Global Actions, which will bring up the User view. Click on Edit User on the left navigation menu or Edit Profile in the top right corner. This next screen, allows you to edit your details, including your password, by filling out the password field. Keep in mind that the password has to be at least 6 characters long, has to include at least one upper-case and one lower-case character in addition to a digit or a special character. Enter the same password into the confirm password field, before clicking submit to finalise the change.
si_lk: මීළඟ පියවර ලෙස, ඔබේ පරිපාලක විසින් ලබා දී ඇති මුරපදය ඔබම තෝරා ගන්නා දෙයකට වෙනස් කරන්න. වම් සංචාලන මෙනුවේ, ගෝලීය ක්‍රියා යටතේ මගේ පැතිකඩ මත ක්ලික් කරන්න, එය පරිශීලක දසුන ගෙන එනු ඇත. වම් සංචාලන මෙනුවේ සංස්කරණය කරන්න පරිශීලක මත ක්ලික් කරන්න හෝ ඉහළ දකුණු කෙළවරේ පැතිකඩ සංස්කරණය කරන්න. මෙම මීළඟ තිරය, මුරපද ක්ෂේත්‍රය පිරවීමෙන් ඔබගේ මුරපදය ඇතුළුව ඔබගේ විස්තර සංස්කරණය කිරීමට ඔබට ඉඩ සලසයි. මුරපදය අවම වශයෙන් අක්ෂර 6ක්වත් දිග විය යුතු බවත්, ඉලක්කමකට හෝ විශේෂ අක්ෂරයකට අමතරව අවම වශයෙන් එක් ලොකු අකුරක් සහ කුඩා අකුරු එක් අකුරක්වත් ඇතුළත් කළ යුතු බවත් මතක තබා ගන්න. වෙනස් කිරීම අවසන් කිරීමට ඉදිරිපත් කරන්න ක්ලික් කිරීමට පෙර, තහවුරු කිරීමේ මුරපද ක්ෂේත්‍රයට එම මුරපදය ඇතුළත් කරන්න.

source: Turning this feature on will allow you to receive e-mails addressed to your organisation whenever a user tries to ask about an event that was posted by a user of your organisation. Keep in mind that you can still be addressed by such a request even when this setting is turned off, if someone tries to contact the person that reported an event that you yourself have created.
si_lk: මෙම විශේෂාංගය ක්‍රියාත්මක කිරීමෙන් පරිශීලකයෙකු ඔබේ සංවිධානයේ පරිශීලකයෙකු විසින් පළ කරන ලද සිදුවීමක් ගැන විමසීමට උත්සාහ කරන සෑම විටම ඔබේ සංවිධානයට ඊමේල් ලබා ගැනීමට ඉඩ සලසයි. ඔබ විසින්ම නිර්මාණය කරන ලද සිදුවීමක් වාර්තා කළ පුද්ගලයා සම්බන්ධ කර ගැනීමට යමෙකු උත්සාහ කරන්නේ නම්, මෙම සැකසීම ක්‍රියා විරහිත කර ඇති විට පවා එවැනි ඉල්ලීමක් මඟින් ඔබට තවමත් ආමන්ත්‍රණය කළ හැකි බව මතක තබා ගන්න.

source: In order for the system to be able to encrypt the messages that you send through it, it needs to know your GnuPG key. You can acquire this by clicking on the GnuPG key link at the bottom left of the screen. Copy the entirety of the key and navigate to the Edit profile view (My Profile on the left -&gt; Edit profile in the top right corner). Paste the key into the GnuPG field and click submit.
si_lk: පද්ධතියට ඔබ එවන පණිවිඩ සංකේතනය කිරීමට හැකි වීම සඳහා, එය ඔබගේ GnuPG යතුර දැන සිටිය යුතුය. තිරයේ පහළ වම්පස ඇති GnuPG යතුරු සබැඳිය ක්ලික් කිරීමෙන් ඔබට මෙය ලබා ගත හැක. යතුරේ සම්පූර්ණ පිටපත පිටපත් කර සංස්කරණය පැතිකඩ දර්ශනය වෙත සංචාලනය කරන්න (වමේ මගේ පැතිකඩ -&gt; ඉහළ දකුණු කෙළවරේ පැතිකඩ සංස්කරණය කරන්න). යතුර GnuPG ක්ෂේත්‍රයට අලවා ඉදිරිපත් කරන්න ක්ලික් කරන්න.

source: Requesting a new authentication key
si_lk: නව සත්‍යාපන යතුරක් ඉල්ලමින්

source: It is possible to make the system generate a new authentication key for you (for example if your previous one gets compromised. This can be accessed by clicking on the My Profile button and then clicking the reset key next to the currently active authentication code. The old key will become invalid when the new one is generated.
si_lk: පද්ධතිය ඔබ වෙනුවෙන් නව සත්‍යාපන යතුරක් ජනනය කිරීමට සැලැස්විය හැක (උදාහරණයක් ලෙස ඔබගේ පෙර එක සම්මුතියකට ලක්වුවහොත්. මෙය My Profile බොත්තම ක්ලික් කර දැනට ක්‍රියාත්මක සත්‍යාපන කේතය අසල ඇති reset යතුර ක්ලික් කිරීමෙන් ප්‍රවේශ විය හැක. නව යතුර උත්පාදනය කරන විට පැරණි යතුර අවලංගු වේ.

source: Clicking on reset will generate a new key for you and invalidate the old one, blocking it from being used.
si_lk: යළි පිහිටුවීම මත ක්ලික් කිරීමෙන් ඔබ සඳහා නව යතුරක් ජනනය වන අතර පැරණි එක අවලංගු කරයි, එය භාවිතා කිරීම අවහිර කරයි.

source: MISP also provides its users with some information about itself and its users through the links provided in the Global Actions menu.
si_lk: ගෝලීය ක්‍රියා මෙනුවෙහි සපයා ඇති සබැඳි හරහා MISP විසින් තම පරිශීලකයින්ට තමන් සහ එහි පරිශීලකයින් පිළිබඳ යම් තොරතුරු ද සපයයි.

source: To read about the news regarding the system itself, click on News on the left menu. This will bring up a list of news items concerning updates and changes to MISP itself.
si_lk: පද්ධතිය සම්බන්ධ පුවත් කියවීමට වම් පස ඇති ප්‍රවෘත්ති මත ක්ලික් කරන්න. මෙය MISP වෙතම යාවත්කාලීන කිරීම් සහ වෙනස් කිරීම් සම්බන්ධ පුවත් ලැයිස්තුවක් ගෙන එනු ඇත.

source: Member statistics
si_lk: සාමාජික සංඛ්යා ලේඛන

source: By using the Attribute Histogram menu button on the left, you can see a quick histogram depicting the distribution of attribute types created by each organisation.
si_lk: වම් පස ඇති Attribute Histogram මෙනු බොත්තම භාවිතා කිරීමෙන්, ඔබට එක් එක් සංවිධානය විසින් නිර්මාණය කරන ලද ගුණාංග වර්ග බෙදා හැරීම නිරූපණය කරන ඉක්මන් හිස්ටෝග්‍රැම් දැකිය හැක.

source: The user guide is also accessible via the Global Actions menu. You can find out more about how to use the system by reading this.
si_lk: පරිශීලක මාර්ගෝපදේශය ගෝලීය ක්‍රියා මෙනුව හරහා ද ප්‍රවේශ විය හැකිය. පද්ධතිය භාවිතා කරන්නේ කෙසේද යන්න පිළිබඳ වැඩි විස්තර මෙය කියවීමෙන් ඔබට සොයාගත හැකිය.

source: It is possible to review the terms &amp; conditions that were shown during the first run of the system by clicking on the terms &amp; conditions link in the Global Actions menu.
si_lk: ගෝලීය ක්‍රියා මෙනුවේ කොන්දේසි &amp; කොන්දේසි සබැඳිය ක්ලික් කිරීමෙන් පද්ධතියේ පළමු ධාවනයේදී පෙන්වූ කොන්දේසි &amp; සමාලෝචනය කළ හැකිය.

source: View statistics about the users and the data contained within this instance.
si_lk: පරිශීලකයන් පිළිබඳ සංඛ්‍යාලේඛන සහ මෙම අවස්ථාව තුළ අඩංගු දත්ත බලන්න.

source: General Statistics
si_lk: සාමාන්ය සංඛ්යා ලේඛන

source: View a set of statistics such as the number of Events and Attributes currently in existance on the platform. The number in the bracket shows the number of new items added during this week.
si_lk: වේදිකාවේ දැනට පවතින සිදුවීම් සහ ගුණාංග ගණන වැනි සංඛ්‍යාලේඛන කට්ටලයක් බලන්න. වරහනේ ඇති අංකය මෙම සතිය තුළ එකතු කරන ලද නව අයිතම ගණන පෙන්වයි.

source: Activity Heatmap
si_lk: ක්‍රියාකාරකම් තාප සිතියම

source: This graph shows a heatmap of all activity related to creating event related data on a day by day basis. By default, the graph shows the sum of the contributions of all organisations, but using the buttons representing each organisation in existance on the platform you can switch to the activity heatmap of a single organisation. If you'd like to see the activity further back in the past, just use the arrow buttons to navigate the heatmap.
si_lk: මෙම ප්‍රස්ථාරය දිනෙන් දින සිදුවීම් ආශ්‍රිත දත්ත සෑදීමට අදාළ සියලුම ක්‍රියාකාරකම්වල තාප සිතියමක් පෙන්වයි. පෙරනිමියෙන්, ප්‍රස්ථාරය සියලු සංවිධානවල දායකත්වයේ එකතුව පෙන්වයි, නමුත් වේදිකාවේ පවතින එක් එක් ආයතනය නියෝජනය කරන බොත්තම් භාවිතයෙන් ඔබට තනි සංවිධානයක ක්‍රියාකාරකම් තාප සිතියම වෙත මාරු විය හැක. ඔබ අතීතයේ ක්‍රියාකාරකම් තවදුරටත් දැකීමට කැමති නම්, තාප සිතියමේ සැරිසැරීමට ඊතල බොත්තම් භාවිතා කරන්න.

source: Inspecting the input filters
si_lk: ආදාන පෙරහන් පරීක්ෂා කිරීම

source: All the events and attributes that get entered into MISP will be run through a series of input filters. These are defined by the site administrators or users with special privileges to edit the filters, but every user can take a look at the currently active lists.
si_lk: MISP වෙත ඇතුළු වන සියලුම සිදුවීම් සහ ගුණාංග ආදාන පෙරහන් මාලාවක් හරහා ක්‍රියාත්මක වේ. මේවා අඩවි පරිපාලකයින් හෝ පෙරහන් සංස්කරණය කිරීමට විශේෂ වරප්‍රසාද ඇති පරිශීලකයින් විසින් නිර්වචනය කරනු ලැබේ, නමුත් සෑම පරිශීලකයෙකුටම දැනට ක්‍රියාත්මක වන ලැයිස්තු දෙස බැලිය හැකිය.

source: All Attribute value and Event info fields will be parsed for a set of regular expressions and replaced based on the replacement values contained in this section. This has many uses, such as unifying similar data for better correlation, removing personal data from file-paths or simply for clarity. It is also possible to blocklist data by not defining a replacement for a regular expression.
si_lk: සියලුම උපලක්ෂණ අගය සහ සිදුවීම් තොරතුරු ක්ෂේත්‍ර නිත්‍ය ප්‍රකාශන කට්ටලයක් සඳහා විග්‍රහ කෙරෙන අතර මෙම කොටසේ අඩංගු ප්‍රතිස්ථාපන අගයන් මත පදනම්ව ප්‍රතිස්ථාපනය කෙරේ. වඩා හොඳ සහසම්බන්ධයක් සඳහා සමාන දත්ත ඒකාබද්ධ කිරීම, ගොනු මාර්ගවලින් පුද්ගලික දත්ත ඉවත් කිරීම හෝ සරලව පැහැදිලි කිරීම සඳහා මෙය බොහෝ භාවිතයන් ඇත. නිත්‍ය ප්‍රකාශනයක් සඳහා ප්‍රතිස්ථාපනයක් නිර්වචනය නොකිරීමෙන් දත්ත වාරණ ලැයිස්තුගත කිරීමට ද හැකිය.

source: This list (can) contain a set of addresses that are allowed to be entered as attribute values but will be blocked from being exported to NIDS-es.
si_lk: මෙම ලැයිස්තුවේ (හැකි) ආරෝපණ අගයන් ලෙස ඇතුළත් කිරීමට අවසර දී ඇති නමුත් NIDS-es වෙත අපනයනය කිරීමෙන් අවහිර කරනු ලබන ලිපින කට්ටලයක් අඩංගු වේ.

source: Creating an event
si_lk: සිදුවීමක් නිර්මාණය කිරීම

source: Browsing past events
si_lk: අතීත සිදුවීම් පිරික්සීම

source: Updating and modifying events
si_lk: සිදුවීම් යාවත්කාලීන කිරීම සහ වෙනස් කිරීම

source: Contacting the publisher
si_lk: ප්රකාශකයා සම්බන්ධ කර ගැනීම

source: Exporting data
si_lk: දත්ත අපනයනය කිරීම

source: Connecting to other servers
si_lk: වෙනත් සේවාදායකයන් වෙත සම්බන්ධ වීම

source: Rest API
si_lk: විවේක API

source: The process of entering an event can be split into 3 phases, the creation of the event itself, populating it with attributes and attachments and finally publishing it.
si_lk: සිදුවීමක් ඇතුළු කිරීමේ ක්‍රියාවලිය අදියර 3 කට බෙදිය හැකිය, සිදුවීමම නිර්මාණය කිරීම, ගුණාංග සහ ඇමුණුම් සමඟ එය ජනනය කර අවසානයේ එය ප්‍රකාශයට පත් කිරීම.

source: During this first step, you will be create a basic event without any actual attributes, but storing general information such as a description, time and risk level of the incident. To start creating the event, click on the New Event button on the left and fill out the form you are presented with. The following fields need to be filled out
si_lk: මෙම පළමු පියවරේදී, ඔබ කිසිදු සත්‍ය ගුණාංගයකින් තොරව මූලික සිදුවීමක් නිර්මාණය කරනු ඇත, නමුත් සිද්ධියේ විස්තරයක්, වේලාව සහ අවදානම් මට්ටම වැනි සාමාන්‍ය තොරතුරු ගබඩා කරයි. සිදුවීම නිර්මාණය කිරීම ආරම්භ කිරීමට, වම් පස ඇති New Event බොත්තම මත ක්ලික් කර ඔබ ඉදිරිපත් කරන පෝරමය පුරවන්න. පහත ක්ෂේත්‍ර පිරවිය යුතුය

source: Fill this form out to create a skeleton event, before proceeding to populate it with attributes and attachments.
si_lk: ඇටසැකිල්ලක් සෑදීමට මෙම පෝරමය පුරවන්න, එය ගුණාංග සහ ඇමුණුම් සමඟ පුරවන්න.

source: The date when the incident has happened. Just click this field and a date-picker will pop up where you can select the desired date.
si_lk: සිද්ධිය සිදු වූ දිනය. මෙම ක්ෂේත්‍රය ක්ලික් කරන්න, ඔබට අවශ්‍ය දිනය තෝරාගත හැකි දින-පිකර් එකක් උත්පතන වනු ඇත.

source: This setting controls, who will be able to see this event once it becomes published and eventually when it becomes pulled. Apart from being able to set which users on this server are allowed to see the event, this also controls whether the event will be synchronised to other servers or not. The distribution is inherited by attributes: the most restrictive setting wins. The following options are available
si_lk: මෙම සිටුවම පාලනය කරයි, මෙම සිදුවීම ප්‍රකාශනය වූ පසු සහ අවසානයේ එය ඇද ගන්නා විට කාටද බැලීමට හැකි වනු ඇත. මෙම සේවාදායකයේ කුමන පරිශීලකයින්ට සිදුවීම බැලීමට අවසර ඇත්ද යන්න සැකසීමට අමතරව, සිදුවීම වෙනත් සේවාදායකයන් සමඟ සමමුහුර්ත කරන්නේද නැද්ද යන්නද මෙය පාලනය කරයි. බෙදාහැරීම ගුණාංග මගින් උරුම වේ: වඩාත්ම සීමා සහිත සැකසුම ජය ගනී. පහත විකල්ප තිබේ

source: Your organization only
si_lk: ඔබේ සංවිධානය පමණි

source: This setting will only allow members of your organisation to see this. It can be pulled to another instance by one of your organisation members where only your organisation will be able to see it. Events with this setting will not be synchronised
si_lk: මෙම සැකසීම ඔබගේ සංවිධානයේ සාමාජිකයින්ට පමණක් මෙය බැලීමට ඉඩ දෙනු ඇත. එය ඔබේ සංවිධානයට පමණක් දැකිය හැකි ඔබේ සංවිධානයේ සාමාජිකයෙකු විසින් වෙනත් අවස්ථාවකට ඇද දැමිය හැක. මෙම සැකසුම සහිත සිදුවීම් සමමුහුර්ත නොවනු ඇත

source: Upon push: do not push. Upon pull : pull.
si_lk: තල්ලු කිරීමේදී: තල්ලු නොකරන්න. අදින්න: අදින්න.

source: This Community-only
si_lk: මෙම ප්‍රජාවට පමණි

source: Users that are part of your MISP community will be able to see the event. This includes your own organisation, organisations on this MISP server and organisations running MISP servers that synchronise with this server. Any other organisations connected to such linked servers will be restricted from seeing the event
si_lk: ඔබගේ MISP ප්‍රජාවේ කොටසක් වන පරිශීලකයින්ට සිදුවීම දැකීමට හැකි වනු ඇත. මෙයට ඔබේම සංවිධානයක්, මෙම MISP සේවාදායකයේ සංවිධාන සහ මෙම සේවාදායකය සමඟ සමමුහුර්ත වන MISP සේවාදායක ධාවනය වන සංවිධාන ඇතුළත් වේ. එවැනි සම්බන්ධිත සේවාදායකයන්ට සම්බන්ධ වෙනත් ඕනෑම සංවිධානයක් සිදුවීම බැලීමෙන් සීමා කරනු ලැබේ

source: Upon push: do not push. Upon pull: pull and downgrade to Your organization only.
si_lk: තල්ලු කිරීමේදී: තල්ලු නොකරන්න. ඇදීම මත: අදින්න සහ පහත් කරන්න ඔබේ සංවිධානයට පමණි.

source: Users that are part of your MISP community will be able to see the event. This includes all organisations on this MISP server, all organisations on MISP servers synchronising with this server and the hosting organisations of servers that connect to those afore mentioned servers (so basically any server that is 2 hops away from this one). Any other organisations connected to linked servers that are 2 hops away from this own will be restricted from seeing the event.
si_lk: ඔබගේ MISP ප්‍රජාවේ කොටසක් වන පරිශීලකයින්ට සිදුවීම දැකීමට හැකි වනු ඇත. මෙයට මෙම MISP සේවාදායකයේ ඇති සියලුම සංවිධාන, මෙම සේවාදායකය සමඟ සමමුහුර්ත කරන MISP සේවාදායකයේ සියලුම සංවිධාන සහ ඉහත සඳහන් කළ සේවාදායකයන් වෙත සම්බන්ධ වන සේවාදායකයන්ගේ සත්කාරක සංවිධාන (එබැවින් මූලික වශයෙන් මෙයට හොප් 2 ක් දුරින් ඇති ඕනෑම සේවාදායකයක්) ඇතුළත් වේ. මෙයට හොප් 2ක් ඈතින් ඇති සම්බන්ධිත සේවාදායක කට සම්බන්ධ වෙනත් ඕනෑම සංවිධානයක් සිදුවීම බැලීමෙන් සීමා කෙරේ.

source: Upon push: downgrade to This Community only and push. Upon pull: pull and downgrade to This Community only.
si_lk: තල්ලු කිරීම මත: මෙම ප්‍රජාවට පමණක් පහත් කර තල්ලු කරන්න. ඇදීම මත: මෙම ප්‍රජාවට පමණක් අදින්න සහ පහත් කරන්න.

source: This will share the event with all MISP communities, allowing the event to be freely propagated from one server to the next.
si_lk: මෙම සිදුවීම සියලුම MISP ප්‍රජාවන් සමඟ බෙදා ගනු ඇත, මෙම සිදුවීම එක් සේවාදායකයකින් ඊළඟට නිදහසේ ප්‍රචාරණය කිරීමට ඉඩ සලසයි.

source: Upon push: push. Upon pull: pull.
si_lk: තල්ලු කිරීමේදී: තල්ලු කරන්න. අදින්න: අදින්න.

source: This field indicates the risk level of the event. Incidents can be categorised into three different threat categories (low, medium, high). This field can alternatively be left as undefined. The 3 options are
si_lk: මෙම ක්ෂේත්‍රය සිදුවීමේ අවදානම් මට්ටම පෙන්නුම් කරයි. සිදුවීම් විවිධ තර්ජන කාණ්ඩ තුනකට වර්ග කළ හැකිය (අඩු, මධ්‍යම, ඉහළ). මෙම ක්ෂේත්‍රය විකල්ප වශයෙන් නිර්වචනය නොකළ ලෙස තැබිය හැක. විකල්ප 3 වේ

source: General mass malware.
si_lk: සාමාන්‍ය ස්කන්ධ අනිෂ්ට මෘදුකාංග.

source: Advanced Persistent Threats (APT)
si_lk: උසස් ස්ථීර තර්ජන (APT)

source: Sophisticated APTs and 0day attacks.
si_lk: නවීන APTs සහ දින 0 ප්‍රහාර.

source: Indicates the current stage of the analysis for the event, with the following possible options
si_lk: පහත සඳහන් කළ හැකි විකල්ප සමඟ, සිද්ධිය සඳහා විශ්ලේෂණයේ වත්මන් අදියර පෙන්නුම් කරයි

source: The analysis is just beginning
si_lk: විශ්ලේෂණය ආරම්භය පමණි

source: The analysis is in progress
si_lk: විශ්ලේෂණය සිදු වෙමින් පවතී

source: The analysis is complete
si_lk: විශ්ලේෂණය සම්පූර්ණයි

source: Event Description
si_lk: සිදුවීම් විස්තරය
