Repository: tomking2/MISP
Catalog: app/Locale/*/LC_MESSAGES/default.po
Languages: si_lk

source: Detach
si_lk: වෙන් කරන්න

source: Are you sure you want to detach %s from this event?
si_lk: ඔබට මෙම සිදුවීමෙන් %s ඉවත් කිරීමට අවශ්‍ය බව විශ්වාසද?

source: Add new cluster
si_lk: නව පොකුරක් එකතු කරන්න

source: Add new local cluster
si_lk: නව දේශීය පොකුරක් එක් කරන්න

source: No item picked
si_lk: අයිතමයක් තෝරා ගත්තේ නැත

source: Due to the large number of options, no contextual information is provided.
si_lk: විකල්ප විශාල සංඛ්‍යාවක් නිසා, සන්දර්භීය තොරතුරු සපයන්නේ නැත.

source: Nothing to pick
si_lk: තෝරා ගැනීමට කිසිවක් නැත

source: Home
si_lk: නිවස

source: Event Actions
si_lk: සිදුවීම් ක්රියා

source: List Events
si_lk: සිදුවීම් ලැයිස්තුගත කරන්න

source: Add Event
si_lk: සිදුවීම එක් කරන්න

source: List Attributes
si_lk: ගුණාංග ලැයිස්තුගත කරන්න

source: Search Attributes
si_lk: ගුණාංග සොයන්න

source: View Proposals
si_lk: යෝජනා බලන්න

source: Events with proposals
si_lk: යෝජනා සහිත සිදුවීම්

source: View delegation requests
si_lk: නියෝජිත ඉල්ලීම් බලන්න

source: List Tags
si_lk: ලැයිස්තු ටැග්

source: List Tag Collections
si_lk: ලැයිස්තු ටැග් එකතු

source: Add Tag
si_lk: ටැගය එක් කරන්න

source: List Taxonomies
si_lk: වර්ගීකරණය ලැයිස්තුගත කරන්න

source: List Templates
si_lk: සැකිලි ලැයිස්තුගත කරන්න

source: Add Template
si_lk: සැකිල්ල එක් කරන්න

source: Export
si_lk: අපනයන

source: Automation
si_lk: ස්වයංක්රීයකරණය

source: Blocklist Event
si_lk: වාරණ ලැයිස්තු සිදුවීම

source: Manage Event Blocklists
si_lk: සිදුවීම් අවහිර ලැයිස්තු කළමනාකරණය කරන්න

source: Dashboard
si_lk: උපකරණ පුවරුව

source: List Galaxies
si_lk: Galaxies ලැයිස්තුගත කරන්න

source: List Relationships
si_lk: සබඳතා ලැයිස්තුගත කරන්න

source: Input Filters
si_lk: ආදාන පෙරහන්

source: Import Regexp
si_lk: Regexp ආනයනය කරන්න

source: Warninglists
si_lk: අනතුරු ඇඟවීමේ ලැයිස්තු

source: Noticelists
si_lk: දැන්වීම්කරුවන්

source: Correlation Exclusions
si_lk: සහසම්බන්ධතා බැහැර කිරීම්

source: Global Actions
si_lk: ගෝලීය ක්‍රියා

source: News
si_lk: පුවත්

source: My Profile
si_lk: මගේ පැතිකඩ

source: My Settings
si_lk: මගේ සැකසීම්

source: Set Setting
si_lk: සැකසීම් සැකසීම

source: Role Permissions
si_lk: භූමිකාව අවසර

source: List Object Templates
si_lk: වස්තු සැකිලි ලැයිස්තුගත කරන්න

source: List Sharing Groups
si_lk: ලැයිස්තු බෙදාගැනීමේ කණ්ඩායම්

source: Add Sharing Group
si_lk: බෙදාගැනීමේ කණ්ඩායම එක් කරන්න

source: Decaying Models Tool
si_lk: දිරාපත් වන ආකෘති මෙවලම

source: List Decaying Models
si_lk: දිරාපත් වන ආකෘති ලැයිස්තුගත කරන්න

source: User Guide
si_lk: පරිශීලක මාර්ගෝපදේශය

source: Categories & Types
si_lk: වර්ග සහ වර්ග

source: Terms & Conditions
si_lk: නියම සහ කොන්දේසි

source: Statistics
si_lk: සංඛ්යාලේඛන

source: List Discussions
si_lk: සාකච්ඡා ලැයිස්තුගත කරන්න

source: Start Discussion
si_lk: සාකච්ඡාව ආරම්භ කරන්න

source: Sync Actions
si_lk: සමමුහුර්ත ක්‍රියා

source: Create Sync Config
si_lk: සමමුහුර්ත වින්‍යාසය සාදන්න

source: Import Server Settings
si_lk: ආයාත සේවාදායක සැකසුම්

source: List Servers
si_lk: ලැයිස්තු සේවාදායකයන්

source: List Feeds
si_lk: සංග්‍රහ ලැයිස්තුගත කරන්න

source: Search Feed Caches
si_lk: සංග්‍රහ හැඹිලි සොයන්න

source: List SightingDB Connections
si_lk: SightingDB සම්බන්ධතා ලැයිස්තුගත කරන්න

source: Add SightingDB Connection
si_lk: SightingDB සම්බන්ධතාවය එක් කරන්න

source: List Communities
si_lk: ප්‍රජාවන් ලැයිස්තුගත කරන්න

source: Cerebrates
si_lk: සමරයි

source: Administration
si_lk: පරිපාලනය

source: List Users
si_lk: පරිශීලකයන් ලැයිස්තුගත කරන්න

source: List Auth Keys
si_lk: සත්‍යාපන යතුරු ලැයිස්තුගත කරන්න

source: List User Settings
si_lk: පරිශීලක සැකසුම් ලැයිස්තුගත කරන්න

source: Set User Setting
si_lk: පරිශීලක සැකසුම සකසන්න

source: Add User
si_lk: පරිශීලක එකතු කරන්න

source: Contact Users
si_lk: පරිශීලකයින් අමතන්න

source: User Registrations
si_lk: පරිශීලක ලියාපදිංචි කිරීම්

source: List Organisations
si_lk: ලැයිස්තුගත සංවිධාන

source: Add Organisations
si_lk: සංවිධාන එකතු කරන්න

source: List Roles
si_lk: භූමිකාවන් ලැයිස්තුගත කරන්න

source: Add Roles
si_lk: භූමිකාවන් එකතු කරන්න

source: Server Settings & Maintenance
si_lk: සේවාදායක සැකසුම් සහ නඩත්තුව

source: Jobs
si_lk: රැකියා

source: Scheduled Tasks
si_lk: උපලේඛනගත කාර්යයන්

source: Event Block Rules
si_lk: සිදුවීම් වාරණ නීති

source: Blocklist Organisation
si_lk: වාරණ ලැයිස්තු සංවිධානය

source: Manage Org Blocklists
si_lk: සංවිධානය අවහිර ලැයිස්තු කළමනාකරණය කරන්න

source: Top Correlations
si_lk: ඉහළ සහසම්බන්ධතා

source: Logs
si_lk: සටහන්

source: List Logs
si_lk: ලැයිස්තු ලොග

source: List Audit Logs
si_lk: ලැයිස්තු විගණන ලඝු-සටහන්

source: Search Logs
si_lk: සෙවුම් ලඝු-සටහන්

source: REST client
si_lk: REST සේවාදායකයා

source: Set the current page as your home page in MISP
si_lk: MISP හි ඔබගේ මුල් පිටුව ලෙස වත්මන් පිටුව සකසන්න

source: Notifications
si_lk: දැනුම්දීම්

source: Log out
si_lk: ලොග් අවුට් වෙන්න

source: you can also choose specific histogram items by clicking on attributes below
si_lk: පහත ගුණාංග මත ක්ලික් කිරීමෙන් ඔබට විශේෂිත හිස්ටෝග්‍රෑම් අයිතම තෝරාගත හැක

source: Toggle histogram
si_lk: හිස්ටෝග්‍රෑම් ටොගල් කරන්න

source: Attributes per organization
si_lk: සංවිධානයකට ගුණාංග

source: Loading
si_lk: පැටවීම

source: Elements having lower distribution level than the event
si_lk: සිදුවීමට වඩා අඩු බෙදාහැරීමේ මට්ටමක් ඇති මූලද්‍රව්‍ය

source: Distribution of the event
si_lk: උත්සවය බෙදා හැරීම

source: Inconsistent distribution level, fallback on the event distribution
si_lk: නොගැලපෙන බෙදාහැරීමේ මට්ටම, සිදුවීම් බෙදා හැරීම මත පසුබැසීම

source: Scope
si_lk: විෂය පථය

source: Physics
si_lk: භෞතික විද්යාව

source: Display
si_lk: ප්රදර්ශනය කරන්න

source: Filters
si_lk: පෙරහන්

source: History
si_lk: ඉතිහාසය

source: Toggle fullscreen
si_lk: සම්පූර්ණ තිරය ටොගල් කරන්න

source: Show all
si_lk: සියල්ල පෙන්වන්න

source: (%s items)
si_lk: (අයිතම%s)

source: Time scope
si_lk: කාල පරාසය

source: Computation
si_lk: ගණනය කිරීම

source: Result
si_lk: ප්රතිඵලය

source: Taxonomy effective ratio
si_lk: වර්ගීකරණය ඵලදායී අනුපාතය

source: Eff. Ratio
si_lk: එෆ්. අනුපාතය

source: Tag numerical value
si_lk: සංඛ්‍යාත්මක අගය ටැග් කරන්න

source: Pick an Attribute
si_lk: ගුණාංගයක් තෝරන්න

source: invalid scope or id
si_lk: වලංගු නොවන විෂය පථය හෝ හැඳුනුම්පත

source: No html support, typographer & autolinker
si_lk: html සහාය, යතුරු ලියනය සහ ස්වයංක්‍රීය ලින්කර් නොමැත

source: An additional syntax to reference MISP Elements
si_lk: MISP මූලද්‍රව්‍ය වෙත යොමු කිරීමට අමතර වාක්‍ය ඛණ්ඩයක්

source: Markdown format
si_lk: සලකුණු කිරීමේ ආකෘතිය

source: The suported markdown format is similar to %s with some differences:
si_lk: සහාය දක්වන සලකුණු කිරීමේ ආකෘතිය %s ට සමාන වෙනස්කම් සහිතව:

source: Markdown extended format
si_lk: සලකුණු කිරීම දිගු කළ ආකෘතිය

source: In order to have a visually pleasant report but more importantly, avoid hardcoding element's value or ID, MISP elements such as attributes and objects can be referenced with the following special syntax
si_lk: දෘශ්‍යමය වශයෙන් ප්‍රසන්න වාර්තාවක් ලබා ගැනීම සඳහා, නමුත් වඩාත් වැදගත් ලෙස, දෘඪ කේත මූලද්‍රව්‍යයේ අගය හෝ හැඳුනුම්පත වළක්වා ගැනීම සඳහා, ගුණාංග සහ වස්තු වැනි MISP මූලද්‍රව්‍ය පහත විශේෂ වාක්‍ය ඛණ්ඩය සමඟින් යොමු කළ හැක.

source: Where:
si_lk: කොහෙද:

source: Is the scope to which the UUID is related to.
si_lk: UUID සම්බන්ධ වන විෂය පථය වේ.

source: Can be one of the following: %s
si_lk: පහත ඒවායින් එකක් විය හැක: %s

source: Is the UUID of the MISP element with only one exception for the tag
si_lk: ටැගය සඳහා එක් ව්‍යතිරේකයක් සහිත MISP මූලද්‍රව්‍යයේ UUID වේ

source: Examples:
si_lk: උදාහරණ:

source: Pictures from attachment-type attributes
si_lk: ඇමුණුම් ආකාරයේ ගුණාංග වලින් පින්තූර

source: Syntax for pictures is like the syntax for referencing MISP elements but with two differences:
si_lk: පින්තූර සඳහා වාක්‍ය ඛණ්ඩය MISP මූලද්‍රව්‍ය යොමු කිරීම සඳහා වන වාක්‍ය ඛණ්ඩය වැනි නමුත් වෙනස්කම් දෙකක් ඇත:

source: The addition of the %s character to indicate that the picture should be displayed and not the atttribute
si_lk: පින්තූරය පෙන්විය යුතු බව පෙන්වීමට අක්ෂර %s එකතු කිරීම සහ ගුණාංගය නොවේ

source: The scope is fixed to %s as only attributes can contain a file
si_lk: ගොනුවක් අඩංගු විය හැක්කේ ගුණාංගවල පමණක් බැවින් විෂය පථය %s ලෙස නියම කර ඇත

source: Syntax for representing tags is similar the syntax for referencing MISP elements but with two differences:
si_lk: ටැග් නියෝජනය කිරීම සඳහා වන වාක්‍ය ඛණ්ඩය MISP මූලද්‍රව්‍ය යොමු කිරීමේ වාක්‍ය ඛණ්ඩයට සමාන නමුත් වෙනස්කම් දෙකක් ඇත:

source: The scope is fixed to %s
si_lk: විෂය පථය %sට සවි කර ඇත

source: The UUID is replaced by the tag name sa tags don't have UUID
si_lk: UUID එක ටැග් නාමයෙන් ප්‍රතිස්ථාපනය වේ sa ටැග් වලට UUID නැත

source: Event's Galaxy matrixes
si_lk: සිදුවීමේ Galaxy matrixes

source: Syntax for embedding the ATT&CK matrix or any other galaxy matrixes is similar to the syntax for referencing MISP elements:
si_lk: ATT&CK න්‍යාසය හෝ වෙනත් මන්දාකිණි න්‍යාස කාවැද්දීම සඳහා වන වාක්‍ය ඛණ්ඩය MISP මූලද්‍රව්‍ය යොමු කිරීම සඳහා වන වාක්‍ය ඛණ්ඩයට සමාන වේ:

source: The matrix will be generated for the whole event for which the report is linked to
si_lk: වාර්තාව සම්බන්ධ කර ඇති සම්පූර්ණ සිදුවීම සඳහා අනුකෘතිය ජනනය කෙරේ

source: Select all events on current page
si_lk: වත්මන් පිටුවේ ඇති සියලුම සිදුවීම් තෝරන්න

source: Source org
si_lk: මූලාශ්රය org

source: Member org
si_lk: සාමාජික සංවිධානය

source: Owner org
si_lk: හිමිකරු සංවිධානය

source: Clusters
si_lk: පොකුරු

source: Correlation Count
si_lk: සහසම්බන්ධතා ගණන

source: #Corr.
si_lk: #කොර්.

source: Report Count
si_lk: වාර්තා ගණන

source: #Reports
si_lk: #වාර්තා

source: Sighting Count
si_lk: දර්ශන ගණන

source: #Sightings
si_lk: #දසුන්

source: Proposal Count
si_lk: යෝජනා ගණන

source: #Prop
si_lk: #මුක්කු

source: Post Count
si_lk: තැපැල් ගණන

source: #Posts
si_lk: #පළ කිරීම්

source: Creator user
si_lk: නිර්මාපක පරිශීලක

source: Last modified at
si_lk: අවසන් වරට වෙනස් කරන ලද්දේ

source: View
si_lk: දැක්ම

source: Threat level: %s
si_lk: තර්ජන මට්ටම: %s

source: Show filtered event with correlation only.
si_lk: සහසම්බන්ධතාවයෙන් පමණක් පෙරූ සිදුවීම පෙන්වන්න.

source: NEW
si_lk: නවතම

source: Toggle advanced sharing network viewer
si_lk: උසස් බෙදාගැනීමේ ජාල බලන්නා ටොගල් කරන්න

source: Publish Event
si_lk: සිදුවීම ප්‍රකාශ කරන්න

source: Are you sure this event is complete and everyone should be informed?
si_lk: මෙම සිදුවීම සම්පූර්ණ බවත් සියලු දෙනා දැනුවත් කළ යුතු බවත් ඔබට විශ්වාසද?

source: Are you sure you want to delete #
si_lk: ඔබට මැකීමට අවශ්ය බව ඔබට විශ්වාසද #

source: %s correlation
si_lk: %s සහසම්බන්ධය

source: %s proposal
si_lk: %s යෝජනාව

source: Show %s more...
si_lk: තව %s පෙන්වන්න...

source: Collapse…
si_lk: හකුළන්න…

source: - restricted to own organisation only.
si_lk: - තමන්ගේම සංවිධානයකට පමණක් සීමා වේ.

source: Advanced Sightings
si_lk: උසස් දර්ශන

source: This related event contains %s unique correlation
si_lk: මෙම ආශ්‍රිත සිදුවීමෙහි අද්විතීය සහසම්බන්ධතා %s ක් අඩංගු වේ

source: Select attribute
si_lk: ගුණාංගය තෝරන්න

source: Show hover enrichment
si_lk: hover enrichment පෙන්වන්න

source: Toggle correlation
si_lk: සහසම්බන්ධය ටොගල් කරන්න

source: Provider
si_lk: සපයන්නා

source: Event UUIDs
si_lk: සිදුවීම් UUIDs

source: Toggle IDS flag
si_lk: IDS ධජය ටොගල් කරන්න

source: Restore attribute
si_lk: ගුණාංගය ප්‍රතිසාධනය කරන්න

source: Query enrichment
si_lk: විමසුම් පොහොසත් කිරීම

source: Propose Edit
si_lk: සංස්කරණය කරන්න යෝජනා කරන්න

source: Propose Deletion
si_lk: මකාදැමීම යෝජනා කරන්න

source: Soft-delete attribute
si_lk: මෘදු-මකන්න ගුණාංගය

source: Object name:
si_lk: වස්තුවේ නම:

source: Expand or Collapse
si_lk: පුළුල් කරන්න හෝ හකුළන්න

source: Meta-category:
si_lk: මෙටා-ප්‍රවර්ගය:

source: Description:
si_lk: විස්තර:

source: Template:
si_lk: සැකිල්ල:

source: Permanently delete object
si_lk: වස්තුව ස්ථිරවම මකන්න

source: Soft delete object
si_lk: මෘදු මකා දැමීමේ වස්තුව

source: Add an Object Attribute
si_lk: Object Attribute එකක් එකතු කරන්න

source: References:
si_lk: යොමු:

source: Add reference
si_lk: යොමු එකතු කරන්න

source: Delete object reference
si_lk: වස්තු යොමු මකන්න

source: Referenced by:
si_lk: යොමු කළේ:

source: Select proposal
si_lk: යෝජනාව තෝරන්න

source: Accept Proposal
si_lk: යෝජනාව පිළිගන්න

source: Accept proposal
si_lk: යෝජනාව පිළිගන්න

source: Discard proposal
si_lk: යෝජනාව ඉවතලන්න

source: DELETE
si_lk: මකන්න

source: Add sighting
si_lk: පෙනීම එකතු කරන්න

source: Mark as false-positive
si_lk: ව්‍යාජ ධනාත්මක ලෙස ලකුණු කරන්න

source: Advanced sightings
si_lk: උසස් දර්ශන

source: This file was not checked by AV scan. Do you really want to download it?
si_lk: මෙම ගොනුව AV ස්කෑන් මගින් පරීක්ෂා කර නැත. ඔබට ඇත්තටම එය බාගත කිරීමට අවශ්‍යද?

source: According to AV scan, this file contains %s malware. Do you really want to download it?
si_lk: AV ස්කෑන් වලට අනුව, මෙම ගොනුවේ අනිෂ්ට මෘදුකාංග %s ක් අඩංගු වේ. ඔබට ඇත්තටම එය බාගත කිරීමට අවශ්‍යද?

source: This file contains malware %s
si_lk: මෙම ගොනුවේ අනිෂ්ට මෘදුකාංග %sඅඩංගු වේ

source: Show more information about this vulnerability in external tool
si_lk: බාහිර මෙවලමෙහි මෙම අවදානම පිළිබඳ වැඩි විස්තර පෙන්වන්න

source: Show more information about this weakness in external tool
si_lk: බාහිර මෙවලමෙහි මෙම දුර්වලතාවය පිළිබඳ වැඩි විස්තර පෙන්වන්න

source: Cortex object
si_lk: බාහික වස්තුව

source: Hexadecimal representation
si_lk: ෂඩාස්රාකාර නියෝජනය

source: Switch to binary representation
si_lk: ද්විමය නිරූපණය වෙත මාරු වන්න

source: Warning, this doesn't seem to be a legitimate %s value
si_lk: අවවාදයයි, මෙය නීත්‍යානුකූල %s අගයක් නොවන බව පෙනේ

source: warning
si_lk: අනතුරු ඇඟවීම

source: Feed coverage tool
si_lk: පෝෂක ආවරණ මෙවලම

source: Coverage by currently selected sources:
si_lk: දැනට තෝරාගත් මූලාශ්‍ර මගින් ආවරණය:

source: Include
si_lk: ඇතුළත් කරන්න

source: Exclude
si_lk: බැහැර කරන්න

source: Check coverage
si_lk: ආවරණය පරීක්ෂා කරන්න

source: Name:
si_lk: නම:

source: Meta-category
si_lk: මෙටා කාණ්ඩය

source: Toggle Cluster Elements UI
si_lk: Cluster Elements UI ටොගල් කරන්න

source: Edit Cluster's Elements
si_lk: පොකුරු මූලද්‍රව්‍ය සංස්කරණය කරන්න

source: Add Element
si_lk: මූලද්රව්යය එකතු කරන්න

source: Save changes
si_lk: වෙනස්කම් සුරකින්න

source: Include inbound relations from other galaxies
si_lk: අනෙකුත් මන්දාකිණි වලින් ඇතුල් වන සම්බන්ධතා ඇතුලත් කරන්න

source: This galaxy does not have any relationships.
si_lk: මෙම මන්දාකිණියට කිසිදු සබඳතාවක් නොමැත.

source: Owner Org.
si_lk: හිමිකරු සංවිධානය.

source: Creator Org.
si_lk: නිර්මාපක සංවිධානය.

source: Tag name
si_lk: ටැග් නම

source: Source
si_lk: මූලාශ්රය

source: Target
si_lk: ඉලක්කය

source: Numerical value:
si_lk: සංඛ්‍යාත්මක අගය:

source: Average value
si_lk: සාමාන්ය අගය

source: Include inbound relations
si_lk: අභ්යන්තර සම්බන්ධතා ඇතුළත් කරන්න

source: Required
si_lk: අවශ්යයි

source: Update template and merge
si_lk: අච්චුව යාවත්කාලීන කර ඒකාබද්ධ කරන්න

source: Can't merge due to template version
si_lk: අච්චු අනුවාදය හේතුවෙන් ඒකාබද්ධ කළ නොහැක

source: Review merge
si_lk: සමාලෝචන ඒකාබද්ධ කිරීම

source: Similarity amount
si_lk: සමානතා ප්රමාණය

source: The template version used by this object.
si_lk: මෙම වස්තුව භාවිතා කරන අච්චු අනුවාදය.

source: This attribute is also contained in the revised object. However, as multiple instantiations are allowed by the template, both attributes will be kept.
si_lk: මෙම ගුණාංගය සංශෝධිත වස්තුවේ ද අඩංගු වේ. කෙසේ වෙතත්, අච්චුව මඟින් බහුවිධ අවස්ථා වලට ඉඩ දී ඇති බැවින්, ගුණාංග දෙකම තබා ගනු ඇත.

source: This attribute is conflicting with the one in the revised object. Manual merge will be required.
si_lk: මෙම ගුණාංගය සංශෝධිත වස්තුවේ ඇති එක සමඟ ගැටේ. අතින් ඒකාබද්ධ කිරීම අවශ්ය වනු ඇත.

source: This attribute is only contained in this matching object. It will remain untouched.
si_lk: මෙම ගුණාංගය මෙම ගැළපෙන වස්තුවේ පමණක් අඩංගු වේ. එය නොනැසී පවතිනු ඇත.

source: This attribute has the same value as the one in the revised object.
si_lk: මෙම ගුණාංගයට සංශෝධිත වස්තුවේ ඇති අගයට සමාන අගයක් ඇත.

source: This attribute will be added to this similar object during the merge.
si_lk: ඒකාබද්ධ කිරීමේදී මෙම සමාන වස්තුවට මෙම ගුණාංගය එක් කරනු ඇත.

source: -- Select an option --
si_lk: -- විකල්පයක් තෝරන්න --

source: all
si_lk: සෑම

source: Template
si_lk: සැකිල්ල

source: References
si_lk: යොමු කිරීම්

source: Referenced by
si_lk: විසින් යොමු කරන ලදී

source: Are you sure you want to delete "%s"?
si_lk: ඔබට "%s" මැකීමට අවශ්‍ය බව විශ්වාසද?

source: Download configuration
si_lk: බාගත කිරීමේ වින්‍යාසය

source: Changes since last visit
si_lk: පසුගිය සංචාරයේ සිට වෙනස්කම්

source: Events updated:
si_lk: සිදුවීම් යාවත්කාලීන:

source: Events published:
si_lk: ප්‍රකාශිත සිදුවීම්:

source: Reset
si_lk: යළි පිහිටුවන්න

source: Proposals:
si_lk: යෝජනා:

source: Events with proposals:
si_lk: යෝජනා සහිත සිදුවීම්:

source: Delegation requests:
si_lk: නියෝජිත ඉල්ලීම්:

source: Configure widget
si_lk: විජට් වින්‍යාස කරන්න

source: Remove widget
si_lk: විජට් ඉවත් කරන්න

source: Achievements Unlocked!
si_lk: ජයග්‍රහණ අගුලු හරින ලදී!

source: You don't have any achievement yet. Check them below to get started!
si_lk: ඔබට තවමත් ජයග්‍රහණ කිසිවක් නැත. ආරම්භ කිරීමට පහත ඒවා පරීක්ෂා කරන්න!

source: Next on your list:
si_lk: ඔබගේ ලැයිස්තුවේ ඊළඟට:

source: Well done! You got them all.
si_lk: හොඳින් කළා! ඔබට ඒවා සියල්ලම ලැබුණා.

source: Read more here
si_lk: වැඩි විස්තර මෙතැනින් කියවන්න

source: No data.
si_lk: දත්ත නැත.

source: Picker
si_lk: පිකර්

source: Are you sure you want to delete %s %s (%s)?
si_lk: ඔබට %s %s (%s) මැකීමට අවශ්‍ය බව විශ්වාසද?

source: %s a %s propagates the deletion to other instances and lets you restore it in the future
si_lk: %s a %s මකාදැමීම වෙනත් අවස්ථාවන්ට ප්‍රචාරණය කරන අතර අනාගතයේදී එය ප්‍රතිසාධන කිරීමට ඔබට ඉඩ සලසයි

source: Soft-deleting
si_lk: මෘදු-මැකීම

source: %s a %s permanentaly deletes it
si_lk: %s a %s එය ස්ථිරවම මකයි

source: Hard-deleting
si_lk: අමාරුවෙන් මකා දැමීම

source: Soft-delete
si_lk: මෘදු-මකන්න

source: Hard-delete
si_lk: අමාරුවෙන් මකන්න

source: Add Basic Auth
si_lk: මූලික සත්‍යාපනය එක් කරන්න

source: Username
si_lk: පරිශීලක නාමය

source: Password
si_lk: මුරපදය

source: Add basic auth header
si_lk: මූලික සත්‍යාපන ශීර්ෂකය එක් කරන්න

source: Filter rules
si_lk: පෙරහන් නීති

source: Events with the following tags allowed
si_lk: පහත ටැග් සහිත සිදුවීම් ඉඩ දෙනු ලැබේ

source: Events with the following tags blocked
si_lk: පහත ටැග් සහිත සිදුවීම් අවහිර කර ඇත

source: Events with the following organisations allowed
si_lk: පහත සඳහන් සංවිධාන සමඟ සිදුවීම්වලට අවසර ඇත

source: Events with the following organisations blocked
si_lk: පහත සංවිධාන සමඟ සිදුවීම් අවහිර කර ඇත

source: Modify
si_lk: වෙනස් කරන්න

source: Set PULL rules
si_lk: PULL නීති සකසන්න

source: Configure the rules to be applied when PULLing data to the server
si_lk: සේවාදායකය වෙත දත්ත ඇද ගන්නා විට යෙදිය යුතු නීති වින්‍යාස කරන්න

source: Update
si_lk: යාවත්කාලීන කරන්න

source: first
si_lk: පළමුවන

source: last
si_lk: අවසන්

source: Could not retrieve current state.
si_lk: වත්මන් තත්ත්වය ලබා ගැනීමට නොහැකි විය.

source: Field updated.
si_lk: ක්ෂේත්‍රය යාවත්කාලීන කරන ලදී.

source: Could not update field.
si_lk: ක්ෂේත්‍රය යාවත්කාලීන කළ නොහැකි විය.

source: Rules
si_lk: නීති

source: Not applicable
si_lk: අදාළ නොවේ

source: Age:
si_lk: වයස:

source: Not cached
si_lk: හැඹිලිගත කර නැත

source: Cache feed
si_lk: හැඹිලි සංග්‍රහය

source: %s toggle
si_lk: %s ටොගල් කරන්න

source: Indefinite
si_lk: අවිනිශ්චිත

source: Expired at %s
si_lk: %sට කල් ඉකුත් විය

source: Expired
si_lk: කල් ඉකුත් වී ඇත

source: Will expire in %s day
si_lk: දින %s කින් කල් ඉකුත් වේ

source: Target galaxy cluster not found.
si_lk: ඉලක්ක මන්දාකිණි පොකුරක් හමු නොවීය.

source: Unkown cluster
si_lk: නොදන්නා පොකුරක්

source: Reveal hidden value
si_lk: සැඟවුණු වටිනාකම හෙළි කරන්න

source: This %s %s %s other %s
si_lk: මෙම %s %s %s වෙනත් %s

source: Confirm action?
si_lk: ක්‍රියාව තහවුරු කරන්නද?

source: Object does not exist locally.
si_lk: වස්තුව දේශීයව නොපවතී.

source: Object exists locally.
si_lk: වස්තුව දේශීයව පවතී.

source: Object exists locally, but the following fields contain different information on the remote: %s
si_lk: වස්තුව දේශීයව පවතී, නමුත් පහත ක්ෂේත්‍රවල දුරස්ථ පාලකයේ විවිධ තොරතුරු අඩංගු වේ: %s

source: click here
si_lk: මෙහි ක්ලික් කරන්න

source: Error: Invalid event!
si_lk: දෝෂය: අවලංගු සිදුවීමක්!

source: Fixed event %s
si_lk: ස්ථාවර සිදුවීම %s

source: New fixed event
si_lk: නව ස්ථාවර සිදුවීමක්

source: New event each pull can lead to potentially endlessly growing correlation tables. Only use this setting if you are sure that the data in the feed will mostly be completely distinct between each individual pull, otherwise use fixed events. Generally this setting is NOT recommended.
si_lk: නව සිදුවීමක් සෑම ඇදීමක්ම නිමක් නැතිව වර්ධනය විය හැකි සහසම්බන්ධතා වගු වලට හේතු විය හැක. සංග්‍රහයේ ඇති දත්ත එක් එක් පුද්ගල අදින්න අතර බොහෝ දුරට වෙනස් වන බව ඔබට විශ්වාස නම් පමණක් මෙම සැකසුම භාවිතා කරන්න, එසේ නොමැතිනම් ස්ථාවර සිදුවීම් භාවිතා කරන්න. සාමාන්යයෙන් මෙම සැකසුම නිර්දේශ නොකරයි.

source: New event each pull
si_lk: සෑම ඇදීමක්ම අලුත් සිදුවීමක්

source: Feed not enabled
si_lk: සංග්‍රහය සබල කර නැත

source: View Dashboard
si_lk: උපකරණ පුවරුව බලන්න

source: Import Config JSON
si_lk: වින්‍යාස JSON ආයාත කරන්න

source: Export Config JSON
si_lk: නිර්යාත JSON වින්‍යාස කරන්න

source: Save Dashboard Config
si_lk: උපකරණ පුවරු වින්‍යාසය සුරකින්න

source: List Dashboard Templates
si_lk: උපකරණ පුවරු සැකිලි ලැයිස්තුගත කරන්න

source: Populate From Template
si_lk: සැකිල්ලෙන් ජනප්‍රිය කරන්න

source: Enrichment Module Result
si_lk: පොහොසත් කිරීමේ මොඩියුලයේ ප්රතිඵලය

source: Freetext Import Result
si_lk: Freetext ආයාත ප්‍රතිඵලය

source: View Event
si_lk: සිදුවීම බලන්න

source: View Correlation Graph
si_lk: සහසම්බන්ධතා ප්‍රස්තාරය බලන්න

source: View Event History
si_lk: සිදුවීම් ඉතිහාසය බලන්න

source: Edit Event
si_lk: සිදුවීම සංස්කරණය කරන්න

source: Delete Event
si_lk: සිදුවීම මකන්න

source: Are you sure you want to delete event #%s?
si_lk: ඔබට #%sසිදුවීම මැකීමට අවශ්‍ය බව විශ්වාසද?

source: Add Object
si_lk: වස්තුව එකතු කරන්න

source: Add Attachment
si_lk: ඇමුණුම එකතු කරන්න

source: Add Event Report
si_lk: සිදුවීම් වාර්තාව එක් කරන්න

source: Populate from…
si_lk: …සිට ජනනය කරන්න

source: Enrich Event
si_lk: සිදුවීම පොහොසත් කරන්න

source: Merge attributes from…
si_lk: …සිට ගුණාංග ඒකාබද්ධ කරන්න

source: Propose Attribute
si_lk: ගුණාංගය යෝජනා කරන්න

source: Propose Attachment
si_lk: ඇමුණුම යෝජනා කරන්න

source: Publish (no email)
si_lk: ප්‍රකාශනය කරන්න (ඊමේල් නැත)

source: Unpublish
si_lk: ප්‍රකාශනය ඉවත් කරන්න

source: Publish Sightings
si_lk: දර්ශන පළ කරන්න

source: Delegate Publishing
si_lk: නියෝජිත ප්රකාශනය

source: Accept Delegation Request
si_lk: නියෝජිත ඉල්ලීම පිළිගන්න

source: Discard Delegation Request
si_lk: නියෝජිත ඉල්ලීම ඉවතලන්න

source: Publish event to ZMQ
si_lk: ZMQ වෙත සිදුවීම ප්‍රකාශ කරන්න

source: Are you sure you wish to republish the current event to the ZMQ channel?
si_lk: වත්මන් සිදුවීම ZMQ නාලිකාවට නැවත ප්‍රකාශ කිරීමට අවශ්‍ය බව ඔබට විශ්වාසද?

source: Publish event to Kafka
si_lk: සිදුවීම කෆ්කා වෙත ප්‍රකාශ කරන්න

source: Are you sure you wish to republish the current event to the Kafka topic?
si_lk: වත්මන් සිදුවීම කෆ්කා මාතෘකාවට නැවත ප්‍රකාශ කිරීමට අවශ්‍ය බව ඔබට විශ්වාසද?

source: Contact Reporter
si_lk: වාර්තාකරු අමතන්න

source: Download as…
si_lk: …ලෙස බාගන්න

source: Add Tag Collection
si_lk: ටැග් එකතුව එක් කරන්න

source: Export Tag Collections
si_lk: ටැග් එකතු කිරීම් අපනයනය කරන්න

source: Import Tag Collections
si_lk: ටැග් එකතු කිරීම් ආනයනය කරන්න

source: Import from…
si_lk: …සිට ආයාත කරන්න

source: Blocklists Event
si_lk: වාරණ ලැයිස්තු සිදුවීම

source: List Event Reports
si_lk: සිදුවීම් වාර්තා ලැයිස්තුගත කරන්න

source: View Event Report
si_lk: සිදුවීම් වාර්තාව බලන්න

source: Edit Event Report
si_lk: සිදුවීම් වාර්තාව සංස්කරණය කරන්න

source: View report history
si_lk: වාර්තා ඉතිහාසය බලන්න

source: List Regexp
si_lk: Regexp ලැයිස්තුව

source: New Regexp
si_lk: නව Regexp

source: Perform on existing
si_lk: පවතින මත ඉටු කරන්න
